["my mom favorite love", "lost control", "alon you are lagend", "Lily ♥️♥️", "Diamond Heart is just my absolute favorite. It's so epic", "*This is the album that made alan walker a true legend*", "*Alan I am part of your world*", "Alone ! Faded !", "Pierwszy utwór😁❤️", "Alone one", "The faded one", "That's right", "All of your songs are so soothing!", "Bhai kya hi one tap diya bhai", "Masya Allah Sukses selalu 👍", "Amazing Love from Indonesia️", "Это просто бомба😋", "my favorite song is difrent world and lily", "All song of Allan walker is Amazing,well even and without mask\nOfcourse his song and he is so handsome..", "this is the best album i love it", "lembro quando lançou.... foi incrível nem parece que já faz 2 anos...", "Waoh, alan walker is only 24 years old and has already created 20 songs that I have falling in love with.  Thank you Walker it goes to show that creating music is your Passion.", "What a talented musician is Alan!! And lyrics in his songs are also worthy. A rare mix nowadays", "Cada que empezaba otra gritaba más que en la anterior tratando de cantarla por qué yo hablo español pero las cante ❤😅", "I've been following Alan walker since his first launch Fade in NCS\nNever imagine  that he could be grow this much\nBest wishes to Alan\nKeep on changing the world", "FADED TO", "LILY\nDARKSIDE\nALONE\nDIFFERENT WORLD", "Do the Intro have a track?", "Alan if you read this comment answer me, i want that you know( a lot of people tell you this everyday) you're the best, i mean the first song that i heard was FADED and since that day i listen you'r music. <3", "A", "nostalgia", "Diamond heart!🥰🥰", "Alan top love music", "my fav. album of all time", "Only children choose, I like them all.", "Does someone know what that intro song is called?", "43:59", "Alone 🖤💔", "Alan walker music alone 🕊️\nYou are not alone ❤️\nBut. ....?\nAlmost alone 🤞", "You are not alone ❤️", "Love it❤️❤️", "Darkside....Diamond Heart...🥰🥰", "faded alone", "Beautiful music and voce 🎶👍", "Что за херня", "If your reading this it means that alan will be okay should he tell the world about him hacking me for a long time now lots of love this Xmas wow x", "Y Differet Worlt", "Mi Canción favorita es Diamond Heart 😎", "i like al songs you are a crack", "00.00-1;15 Intro", "My biggest Dream is one Time Met In Alan Walker  Take Love Form Bangladesh 🇧🇩.    🙂🙂😔😔", "Diamond heart. Super.", "Dalko", "I love Lily, All falls down, Alone, Faded, the spectre, sing me to sleep, darkside and On my way", "so I see that all of Alan walker's songs sound cool. however, I have that question I want to know the meaning of the sign of his songs", "I like lntro", "I LOVE YOUR SONGS", "Cantantes más escuchados en el  2020-21.. Alan Walter, harry Styles... alguien más?", "1:17-4:56: Lost Control\r\n4:59-7:39: Don’t Wanna Go\r\n7:40-10:55: Lily\r\n10:56-14:31: Lonely\r\n14:32-17:26: Do It All For You\r\n17:26-20:49: Different World\r\n20:49-22:08: Interlude\r\n22:08-25:17: Sing Me to Sleep\r\n25:18-28:35: All Falls Down\r\n28:38-32:05: Darkside\r\n32:09-34:49: Alone\r\n34:50-38:49: Diamond Heart\r\n38:51-39:29: Faded (Interlude)\r\n39:31-43:00: Faded", "I. miss  you 💓 💓💓", "My favorite song was the intro.", "Didn't realize that Alan Walker's mask would be usefull until now.\n\nAlan was really ahead of his time,he was already in a pandemic while walkers were just partying the past 5 years", "Alan Walker  I love you so much greetings from.TURKEY", "Yeah it is Casper with a k and you're right Alan Walker he's good really good", "Wonderful songs...", "Alan Walker é o MELHOR em músicas eletrónicas.\nO MELHOR dos Melhores, quem não concorda cria o mundo dele sozinho.", "🇧🇷 Hello! \"Merry\" CHRISTMAS and a Happy New Year to all of you. it was wonderful total success kisses.🌍🌹❤️🥰🍾🥂🎆🌠", "🇧🇷🎄🎁❤️❤️❤️🌼🌍🌠🌹🌹🌼🎆🎋", "Alan walker never Fails even the intro fire I'm addicted to it", "ohohohohohohohohoh", "w", "somg alan walker", "YO I LOVE THIS ALBUM, i've been your music for the past 5 years, its so good", "Spectator", "ต่อไป", "Liked", "I like the Intro :D", "Different World 🥔", "Does nobody else want a full version of the intro???", "I wish I could give more than one like....", "lol you are funny. <3 <3 and now you are way off the chain.", "🤩the song it's so........ AAAAAAAAAAAAAAAAAAAAAAAAAAA. i love the song 💙", "My favorite is “Do it all for you” ✨", "Jaki nasz Piękny jest Świat A Obudziły się jak W Nowym Świecie Zapraszają nas Obudzimy się!! TAK KAZDY DZIEN JAK nowy Świat Wita nas My Przedstawiamy Wotamy się Razem Każdego Dnia !! PIEKNIE Przrdstawuiny I NOWE Światy Wiataja Nas !!!", "In my opinion, Lost Control is the most underrated song here", "My favorite is Lost control, Alan Walker you are the best diyey I have heard in my life since I heard the first song you heard I fell in love with your songs, compared to the other mucicos I listen to, you are number one, no one will ever be able to take your place. , I began to listen to you at 6 or 7 years old, and I still listen to you I am 10 years old and when I am 11 I will be on May 3, which is the other year, and although I have not seen you in person because I live in I love you Toluca", "ชอบทุกๆเพลงทั้งในMV Game", "I'm so intrigued by you.", "Top!#!@@@@@@@", "Different World And World of Walker😍❤", "I've actually heard all of these songs individually trough out the year, crazy to think there was a whole album", "Stupid engine and car sounds in this video!", "(づ ●─● )づ", "eSpring", "ε٩(๑> ₃ <)7з", "हैकर तुम्हारा बाप है हम (*❛‿❛)→(😡)", "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "at 17:26 This song is very true for today's time. I did not grow up in a world like this but where I grew up things were more peaceful, life was easier and people were more happy back then, it truly was a different world compared to today's time. I honestly wish I could return to my own time and world, this isn't it.", "My favorite song is Interlude", "When im doing my homeworks; i listen this songs", "Different Worlds the song playing now. I do it all for you... first time hearing but I feel same as you. I feel it deep inside me like it's attached to my essence or DNA in the body. . Missi9on bell rings kinda thing.", "Me transporta *-*", "wenderfull", "Aore", "I love", "All them are phenomenal, ¿don't you think so?👌😍😁", "♥️🌈🌐", "Awesome", "My favourite song in this album is 'Don't wanna go', but in Aviation movie (Julie Bergan, co-pilot:)) this song was ... stronger speaking about singer technique, if I use this term right. :))\nAs well as All Falls Down.\n\nBtw, would you be so kind to explain why in the Darkside song singer (either in this album or in Aviation movie) pronounce this word as something like 'darkshide'. At the same time in Aviation movie singer AU/RA pronounce this word clean. I don't mind about this 'darkshide', it is even cute from some point of view, but interesting why. Thank you for your music and in advance for the answer. :)\n\nP. S. I couldn't left this answer under the pinned comment. :(", "wow", "I love the intro so much", "P R I D E     = )", "No", "sing me to sleep", "Let’s GOooooooooooooooooooooooooooooooooooooooooooooooooooooooo", "🎉🎉🎉", "7:40 lily song I love that song 🤗🤗", "On ne s'en lasse jamais!  ça réveille tellement de choses  enfouies au plus profond de mon âme...", "❤️", "different world", "the intro is so fk good", "( ◜‿◝ )♡", "PEGA LA CANCION QUE TE HAYA SALIDO... Y SI ESTA TODO SIN TILDES QUE TENGO EL USO DE SIGNOS EN EL TECLADO HECHO UN ASCO Y NO ENCUENTRO LA TILDE JAJAJAJA, \n5:05:50    DALE EL CLICK AL TIEMPO Y PEGA AQUI ABAJO LO QUE TE HAYA SALIDO, VAMOS A CONOCER SUS GUSTOS JAJAJA", "Wow ❤️  love this from srilanka 🇱🇰", "DAAAAAAAAARKKK SIIIIIIIIIDEEEEEEEEEEEEEEEEEE", "Whenever I play LOSE CONTROL, it just hits me so differently can't even describe it.", "Lost Control.\nCovid-19: Yes", "So beautiful and amazing🌷🌷🌷", "Alan Walker. U are the best of the best", "intro 💘💘", "I was Heading Home\r\nWhen the world around me Faded.\r\nI was Alone in a Different World.\r\nI know I’m On My Way to Paradise,\r\nBut I Don’t Wanna Go.\r\n\r\nA voice from somewhere in the Sky.\r\nMaybe it was a Ghost or some hidden unknow Force,\r\nAll I know is that it said, “Sweet Dreams”, \r\nAnd that was when I knew, that, for me, \r\nIt was the End of Time\r\n\r\nWe Live\r\nWe Love\r\nWe Die", "Whenever I'm craving for Peace of Mind, I search for any Alan Walker song. ❤️", "😁😁😁👍❤️❤️❤️❤️💕", "lily, sing me to sleep, alone, lonely, diamond heart, lost control", "Não perco um vídeo desse canal", "Estouro! Parabéns", "Mi favorita es Alone", "The best album for me so far", "all songs are the best.", "Alan Walker is a legend", "You are the Best!!!", "Really why you gotta come pull on these heart strings .. why we trying to pull through to", "最高高盛です", "I like all\nFist Faded     second Different world  and lily", "Faded", "Estoy haciendo un trabajo de escuela sobre tu álbum y es como debe ser un gran Éxito.\nI am doing a school work on your album and it should be a great success.", "Who else there who plays just intro again and  again?", "faded OP love from INDIA", "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx", "U made our day ❤️❤️❤️❤️", "*My Favorite songs\n4:56 Lost Control\n28:35 All Falls Down\n34:49 Alone\n25:17 Sing Me To Sleep\n32:05 Dark Side", "Quando é bom é bom. não precisa nem de mais palavras pra descrever como é perfeito o trabalho dele.e seu grupo.nota  mil.  Gosto de outros mais ele é diferente.sinto a música penetrar em meu coração.", "Faded is and darks sites and legend never die any way what is your favorite song of your comment down and different world", "❣️❣️❣️❣️❣️❣️❣️❣️❣️❣️", "Faded", "podkuplenci z nagobčniki od mafije plačani", "KOHAM        CIE", "... Но отдавна ... не съм питал... Как си, Алан? Може би ... няма как, да ми отговориш, но ме е грижа! Дано ... си безсмъртен!:):):)", "... But I haven't asked in a long time ... How are you, Alan? Maybe ... you can't answer me, but I care! I hope ... you are immortal! :) :) :)", "Опаааа Браузера ни прехвърли! Но ...на правилното място!", "Oops, the browser transferred us! But ... in the right place!", "Знаеш ли, кога да спреш!...И аз се питам...?", "Do you know when to stop! ... And I wonder ...?", "Super best album forever all song was super awesome super best music 🎵🎵🎵🎵 and remix 🎶🎶🎶🎶🎶 super sooooooooooo fabolous 🌎😦😎", "all falls down\nI love", "who are all the people vocalists that sing on his tracks?\ni need to see their names", "Don't Wanna Go", "I felt the meaning of living from your music. I love you 💜", "A very good album to listen to while studying ❤❤", "alllllllllllllllllllllllllllllllllllllllll", "Lind💎", "Musicas boas para jogar pubg", "Your song always be my favorite. Amazing", "darkside", "why all music some hint in side", "Alan Walker 1 year ago\r\nWhich song was your favorite?  \n👍14K\r\n\r\nKungFlu BatSoup 33 seconds ago \nMARY HAD A LITTLE LAMB.", "Alan Walker  will always stay in my heart", "Love your music! It’s just amazing 🤩!", "I'm very thankful to my friend who introduced me to a Demi God Mr. Alan Walker and his song.", "amayzing good job you tuyệt vời 10 điểm", "Pa", ".......", "Everything is good🌠🤩", "😞🤍🤍", "your songs are so epic😎😎", "MEGCANTA", "Lonely and Do it all for you", "Why", "Love you ❤️😉", "I really really wanna my comments got ♥️ from Alan Walker😭 even though this video I watch it on 2021🔥✨\nStay safe Alan!!!💪🏻 Walker form Malaysia🇲🇾🔥", "spctre", "MN não sei como tem gente dando deslaike \nem uma msc tão perfeita como essa!!", "great hits ever", "Dark side and alone", "finished it twice now. this music always gets me into the grindset.", "good", "Alan walker Fans  Bangladesh 🇧🇩", "Love this playlist...takes me to different world ..", "Oh this is my favorite album. I like it. Wow beautiful. walker Alan Walker", "My favorite song is faded.", "only album of alan", "It is on my bucket list to go to an Alan Walker concert. Top priority. Appreciate the music, bro!", "different world is my favourite music", "FADED will always remain on Top💥💯", "I've unintentionally converted both my parents, my sister and best friend to your music and it's literally the best feeling to bond over these incredible heartfelt songs. Your music really brings people together, Alan! :)", "Thanks, Alan!", "I believe that I am not the only one, support me ..... and you will not be alone! And I know you have it! Respond !!!!!", "I join the journey of the album ..... and I wish it to everyone who has an open heart and soul.", "Greetings to all friends ... without exceptions .....", "If you can, post a translation of the lyrics (words) in different languages ​​so that the emotions in the words are visible.", "This will be happiness ..... for millions .....", "I hope you're happy, Alan!", "While we are here ..... we will not allow it ....", "They delete the post again, but the dictation does it ...", "And we in Bulgaria are waiting for different times, but .....", "The translation is never accurate, excuse me .....", "Out of habit, you have to brag ..... a ..... excuse me, but you don't need it. You are on a level ..... seven haven .....", "Forgive the chaff, but the feelings ..... remain .....", "And again I am ..... happy .....", "Restartirakh, Alan.\r\nI'm restarting, Alan.", "<3", "If you don’t like all of them , you can’t be my friend 😂 Next XD", "diamond heart", "the best 44 minutes of my life like yy I subscribe", "The Spectre", ">w< i love all song!!! Ellowww Alan walker im from Indonesia!!", "P⁰0ⁿ", ".", "Cool\nTodas las musicas son lo mejor...!! 😍🤩", "same i the thing i say even before 10 months and now also I LOVE YOUR SONGS BRO", "Nice music 🎶 🎵 👌", "de dragon í alan ưalker", "c zc", "his recent songs aren't bad, but i miss his old house style.", "Lily was my favorite", "đẳng cấp thế giới ALAN WALKER", "20:50 Name ?", "미쳤다 오빠...사랑해여...진심..", "On September", "Трябва да ...Рестартирам.....", "I have to ... Restart .....", "Няма да те хваля, както прави всеки! Ти сам знаеш, кой си и какво правиш. Давай! Че искам да съм  близо...Да ... И само с което разполагам ..You Tube. Kolkooto trqbwa da blagodarq na Teb, to tolkowa I na ...Tubata! Тя е връзката! Бъди Здрав!", "I will not praise you as everyone does! You know who you are and what you do. Come on! That I want to be close ... Yes ... And all I have ..You Tube. Kolkooto trqbwa da blagodarq na Teb, to tolkowa I na ... Tubata! She is the connection! Be healthy!", "Здравей, Алан! Компютъра ми е вече...тотално смазан. Не физически, а софтуерно! Поздрави, приятелю! Дано скоро успея, да го възстановя! Но говоря или пиша! Знай, стоя ...здраво зад теб! Радвам се, че сме заедно,в това време! Говоря много...или пиша, но мисълта ми върви заедно с пръстите. Извини за грешки, но приеми обичта, с която живея!", "Hi, Alan! My computer is already ... totally crushed. Not physically, but software! Greetings, my friend! I hope I succeed soon, to restore it! But I speak or write! You know, I'm standing ... firmly behind you! I'm glad we're together at this time! I talk a lot ... or I write, but my thoughts go with my fingers. Sorry for the mistakes, but accept the love I live with!", "Different World toca minha alma de uma forma tão profunda... Desde que lançou, antes da pandemia ou de qualquer coisa que tenha acontecido. Nós precisamos tornar o mundo melhor, esse não é o mundo que nós tínhamos em mente mas podemos fazer diferente. Sou fã do Alan desde que eu era criança. hoje tenho 16 anos, e continuo sendo fã. Abraços Alan", "you saved my life alan walker", "Hi Alan, I want a ❤ from you.", "my song favorite is: Diamond Heart,Alone,Lily and Lost Control.", "Lily🖤", "A ot tozi fakt...mi stava oshte po-dobre.....\r\nAnd from this fact ... I feel even better .....", "Но, Алан, знам, че всичко се е родило...в твоята глава.....и това няма и никой не може да го отнеме...", "But, Alan, I know it was all born ... in your head ..... and it doesn't exist and no one can take it away ...", "I ..... just give him ..... gas .....", "Take a look at the album Different World and choose for yourself ...", "Don't make me ..... choose ..... a song ..... they are already more ..... than ..... what to choose ..... a little .... .grace on your part ..... at least to me ...", "Final .....", "Secret ... a lot of Bulgarians ..... are not in class .....", "And the garage ... is still crumbling with Iselin !!!", "And all the smiles I can get from the World!", "Thanks. Lots!", "Slightly ... I post ... links ... to artists ... don't be angry ... a certain guy like you would be interested, thanks for the things that happened.", "Пускам превод.....само смях и подигравки мога да отнеся! Но както и да е! Но с теб е всичко друго, но не и самотно!", "I'm posting a translation ..... I can only take laughter and ridicule! Whatever! But with you is everything else, but not lonely!", "Дано не съм досаден!", "I hope I'm not annoying!", "Оставам,Алан. Утре може и да не мога, но днес ... съм с теб!", "I'm staying, Alan. I may not be able to tomorrow, but today ... I'm with you!", "Има музика на , която се кефиш, и се радваш...като... дете!", "There's music you enjoy and enjoy ... like ... a child!", "Amei essa pasta amoooooo alan walker maravilhoso💗💗💗💗💖💖💖💖✌👏👏👏👏❤❤❤❤❤❤💖💖💖😘😘💞", "This album was my ex-partner's favorite. Especially \"Lost\". He was a little lost back then and was involved in addiction. We broke up the hard way, both hurt so much physically and emotionally.", "Love from India\nMy Favorite was Spectre", "gOOd", "Love you, love your songs, all of your songs. Love from Vietnam 💙💙💙", "All songs my favorite ❤️❤️❤️\nWe are  Walker's🙏🙏", "The intro just made me feel like i was in heaven i would like yo hear more of that💖", "Tough question \r\nAll are awesome but ' Don't wanna go' 'Lonely' 'Faded' 'Diamond Heart' and 'Darkside' hits my heart the best.", "All Of Them", "I don't choose really yes all my favourite song ❤️❤️❤️", "I find myself come back to the album over and over. Are you doing the same?", "And please also make a single music video of Lost Control", "Please make a single video of Intro.", "To be honest the intro also great .", "Honestly I love Lily song because music in this song  very good.", "Hola, Alan walker, como estás, gracias por esta música tan bonita, que Dios bendiga a Alan walker y a todas las personas que trabajan con él, tu eres el mejor, que Dios también bendiga a todos los que lean este comentario, delen like  por favor, le quiere mucho Luisa María Girón Méndez desde Andalucía Valle del Cauca Colombia.  😀😀😁😁💗💗💓💓🙏🙏👍👍✨✨🔥🔥", "Super hit album forever 😦😦", "cool", "Super best album forever all song was soooooooo mindblowing super best music and remix 😦😦😦", "walker world", "Dang! I just realized HOW DEEP the meaning of \"Lily\" is.....\nI mean, it's a shame that I realized it after so many years of listening to the song\nWell, anyway, the album is lit! and so is it's every song!\n(Bruh, the intro and interludes are also lit!)", "Still now all these songs are my favourite and will be favourite forever.I never felt like  bore while listening to ALAN WALKER songs🖤 Keep rocking with many more milestones in future\n           -----------Walker from INDIA🇮🇳", "Respect to ALAN WALKER....From the UNITED EIGHT.\n\nI-KIRIBATI TUVALU\n\nAARON HONOLULU PINE\n0137\n\n\nskygod", "We're standing with you, Alan!", "I love all of these song but my fav was  Sing  Me  To  Sleep!", "Thank you for the great music 😍😍👍💃", "This was the best album on 2020 ❤️💙", "Super best album forever you are super best genius all world 😦😦", "Awesome!", "⭐⭐⭐⭐⭐⭐", "Words can't describe this masterpiece!", "The Best album ever i love every single second of it", "Or rather Distinguish, ... my mistake ....", "Until I'm done ... that's ... Different!", "And you won't know ... Why ... :)", "It's been a long time ... I haven't died, not physically, but in ..... the other way ...", "But when I look at myself ... what do I look like ... they won't be ... small ... :)", "You don't give me time ... to sleep! I will have to impose ... fines! I haven't decided ... what to be!", "Is it just me or we all can hear cars horns in between the songs or whenever the music's low ??", "The beginning intro 🔝", "Super greatest  hit album forever super best music and remix super best 😦😦😦😦", "não me canso de ouvir esse álbum, já não aguento de esperar pelo próximo!!", "My favorite músic is Lily, faded and all falls down", "28:38 is my favourite song\n\n\n\n\n\nIt's darkside", "❤️❤️❤️ all - 📢 cant stop hearing ⚡️⚡️⚡️⚡️🔊🔊🔊\nThanx @ Alan Walker 🔝", "I'm fall in love with the intro song.. although just an intro but it is a nice and best to hear!! Goodjob Alan!✨", "Remember playing dancing line and rolling sky when they had your songs on there, sad to see both games go but glad you are still around", "Thank you very much, your music has a soul.", "Super best music and remix you rock all over the world 😦😦😦💖😦", "Super best ablum each and every song was super mindblowing this album rock every year this is because of you 💖💖😦😦", "Lost control", "Super best album forever 😦😦😦😦", "Super awesome alum all song was mindblowing super best leyrics 🥰😦😦", "I dont like studying but listening to this while studying helps a lot. it makes studying way more bearable. thank you Alan.", "All song one side, & Faded & Darksids, song one side, love this song, love u Alan walker😍😘😍😘😍😘😍😘", "i love different world song", "Jak dla mnie 💋 Alan JESTEŚ Królem 👑 świetna muzyka 🌹🌹🌹", "Where is the spectre, men ? It's my favourite.", "Every time I listen to Alan walker’s song, I lost control\nMe being like : this song is so good, I don’t wanna go\nBtw Alan walker has a song called lily\nI listen to it when I feel lonely \nHe just does it all for us\nIt feels like a different world \nThe songs sing me to sleep\nIt doesn’t matters even if it all falls down\nThe song never makes me feel in the darkside \nIt makes me feel that I am not alone \nAlan Walker sure has a diamond heart \nI will listen to the songs till I’m faded", "Love from Hong Kong 🇭🇰🇭🇰🇭🇰", "The intro music is so good, just love listening all the time", "all the songs are superb", "Whi is listening these song on Agust 2021?", "Different👻", "em quanto jogo te ouvo sua mosica", "oi sou teu fan quero comnhece", "All songs are my favorite", "🇮🇶🥺🌚😗🤗♥️🔥😑😎😭🌨😍😃🤔🤨🧐🐼😰👽😠☃️😂❤☠🤣🎧🛹", "fede me", ":)", "Olav ....your songs are really great....💖💖💖", "All the songs are really awesome...💖💖💖💖💖💖", "the intro hits different <3", "This albums just still rocks", "AW+darkside= AWs song darkside/ the best song", "I like All your songs they got me through the covid-19 your music and I cried alot together .. kudos ❤️", "love you alan from sri lanka", "I am proud to be a Walker☺️😊😊", "I love intro❤ and all song off you", "this man yet was on other  time with that sanitary mask. I´M ZORRY MY english , I´m peruvian", "Who Remember This Album On Live Stream 🥰♥️😍🤩", "39:29 best drop I think", "Who/what is binod??", "Now for advanture and future 🚀", "✨💫Beautiful💫✨", "Alan Walker's song's always lead me to think about what was.\nWhat was, usually my old friends and how I miss them.", "2021.07.24   I love your favour song. You use 1 silent melody (faded - interlude) for keeping it🎶 away from the rest. \nAnd I love [your Logo] look like this song: the girl A💫 dive in deep sea 🌊and may be the boy W🌟 still wait for her in below. Haha :v 🤣 (“Under the bright But faded lights” haha :v 🤣)\n        📝My feeling about [Faded]:\n🎵The girl dive down 🤿to dark side of deep sea 🌊(faded) to find light of love ❤️ (as Atlantis in ancient legend)🎶\n                Wild monters in deep sea is no more dangerous than inside herself. Haha :v 🤣\n\n                ⭐️⭐️⭐️⭐️🌙⭐️⭐️⭐️⭐️\n                🌊✨🌊✨🌊✨🌊✨🌊", "When I listen this its seems really like a ❤DIFFERENT WORLD ❤🔥...\nThnxx Alan Walker 💙😊...\nLots of love from INDIA 🇮🇳❤...", "Love ❤DIFFERENT WORLD❤", "Legend never die", "Cadê os BR daqui? kkkkkkkkk Tava escutando lost control e até subiu um arrepio aki... Música boa é outro nível kkkkkkkkkkkk Se vc é BR dá um up aí pra mim saber que noix n ta sozinho kkkkkkkkkkk", "soon 8M views!!! \nlistening every day 😍😍", "I  really  like  the  DARKSIDE  song  and  the  UNITY  song  !!", "And ,  I  even  try  to  Draw  you ,  but  it  turned  out  quite  horrifying  !!\n  But ,  I  just  called  it  THE  WALKERSTEIN  Drawing  or  THE  ALANSTEIN  !!\n                       It's  a  Halloween  Story  , I  just  made  up  !!", "OMG ,  You  look  so  gorgeous  looking and  I  even  DREAMED  of  you  sometimes  \n        IT'S    A   MID  --  SPRING  NIGHT'S   PROM   DREAM  !!   \n    And ,  I  sketched  an  Picture  of  ALAN  WALKER \n        recently  ,  but  as  an  FRANKENSTEIN   kind  of   Look  !!\n     And , I  called  it  THE  ALANSTEIN  !!", "I Don't Wanna Go", "differente world da como que ganas de vivir el cambio, muy prontoo jeeeeeeeeeee", "el sonido es tranquilizante, es bonito escuchar estas canciones, porque como estan en ingles no me distraigo, la melodia me ayuda a concentrarme, muy buenaaas XD\nhago mi tareita con la musica de alan ejejej", "me gustaron 2: lily y darkside :3", "sos un Duro mi hermano, el mejor del mundo, saludos desde Colombia!!!", "Hi everyone Im truly say that today  I do my numericals so than I Played Alan album because he takes to much time so the duration of this to long😂😂", "<3", "👍🎶👍🎶👍✌️✌️✌️✌️", "Can't decide , all songs are just out of this world ⚡🔥🔥🔥😍", "three years since i discovered alan walker and i still cant pick a favourite song,\nheading home, on my way, darkside, lost control, lily, alone, different world, play it for me, heading home, dont wanna go, faded, spectrum, sing me to sleep AND STILL COUNTING☺️🔥🔥❤️❤️❤️❤️", "intro was fabulas. and my fav song is diamond heart", "I like the songs a lot 🇧🇩🇧🇩🇧🇩", "Probably my most favorite album ever, I don’t wanna go is so underrated, lily is very good, but Lost control is in my top 5 songs of all time :)", "Shout out to everyone who has a copy of this playing in their car!", "One day i wanna really meet him", "Alan Walker suck 😒\nWatch our\" Permission to dance\" song 😘💜, BTS better than Alan Walker 😌", "I keep watching this album. It never fades.", "my favorite song is \"don't wanna go\" the song is pretty", "We need a song with this vocals in the intro, we NEED one please.", "Sometimes,when we cant express feelings,songs can help us to.And,I appreciate that😂", "Lily- each color of the sounds complements the other, but the whole thing is too simple,for me  you are a genious and inspiration, i belive you can create a XXII century sound :)", "We love the whole album, all your songs! Sending you lots of love from UK ! We were there on the show in Manchester Albert Hall !!! What a great performance!", "ALAN WALKER IS OP ❤️", "I don't know why I want cry listening to album,  shout in joy, dance like our ancient ancestors and just run as fast as I can while my feet hit the pavement to the rhythm of every beat all at the same time", "my favorite music is \"alone, different word, darkside\" among others", "Intro amazing melodie ❤️", "I like all of them💙💙", "Different World and Don't Wanna Go👌", "Alan walker is my favourite song .🤗😉😎", "This intro is the best, i love it", "I WANT TO DIE HEARING YOUR SONGS", "I just want to keep watching more and more", "I never want this to end", "MMMMMMMMMMMMMMMMMM", "Who is still here in July 2021✋✋\nAnyone please", "28:50 TOOOOOP🇲🇦🇲🇦", "Now this is masterpiece", "ignite not found in the list?", "Thank you so much\nI for supporting the new album 😍\nI love music vibes, and really wanted to contribute something to the style 😇\nThank you all so much for the kind words, and I hope you like the rest of the album as well 🥳", "sad sometimes", "long live alan walker", "long live alan walker", "алан начало конца 2-пришествие близко  е-еей как близко", "Most people: this SONGS is so cool!\nMe: experiencing PTSD from ME!ME!ME!", "WOWWW this intro is so incredible.. I LOVED SO MUCH", "Amazing album all was so nice .", "You are a great musician and best D.J  rockers .", "Mostly like faded and darkside song that,s my favourite song .", "Ohh I always click this music video on music, I be like 1000 click per second to click this music video", "I Love you from Germany ❤️", "What a nice album", "The spectre", "all of it are my favorite", "This album had best message\nBrings back alot of memories", "Every song is best becz every singer sings all the songs in their pretty voice!🌹\nAnd your music is fab!🎻❤️", "faded legend", "God music alan walker", "best of the best music. love this", "👍", "Kanza", "Alan walker is the best 😉", "so far all my fav AW songs :-)", "lntro\nAlan Walker", "Hoooo mon dieu.. musique,, merci", "Es mi música de preferencia esmi fan", "Thank all , i from indonesia , u song an ummat , crisis economi and judgement-day !! Hey hey hey . .", "I think the first song is very nice. I would also like to know what it's called.", "When i listen this album, it reminds a lot of good memories.", "Lagu Alan walker paling debes 👍", "Different world", "Awwwwwww I love this", "all of his songs just hits differently then any other Alen Walker is a legend since the day he awake till when he must rest but will still remain legend", "The intro 😍", "Idk the name but I like the aaaaaa aaaaaaaa\nThe first one", "I really liked the intro part of the song and believe it's good enough for its own song", "super muza", "Thank you, Alan, your songs take me to a different world making all these sufferings go away 🤗😍", "WoW", "\"Diamond heart\" is my favorite. But \"Faded\" is my most listened to. However, \"All falls down\" gives me the most goosebumps. . . I could keep going.", "I like all falls down", "When I listen this song I feel like I m alone n am living in cloud,dark, silence,stars  at night 🥰", "Thank you so much Alan And Ava. you both taught me music university Self Taught thank you very much xoxo", "Literally all the songs are amazing-", "From here dont wanna go, but my favourite is end of time", "The man made the world of music  beautiful and all it seems is relaxsation u feel that hard emotion in the song these song are a masterpiece infact this guy is a legend", "I go with darkside sing me to sleep alone and faded", "I liked all of them", "best song: the inrto lol i loved it", "all of them", "b", "❤", "Lost Control, Diamond Heart, I don't wanna go is on fire for me:))))", "Intro", "This song is one of the best of alan walker, and it is OMG", "2021 anyone", "that moment when you try to listen to something else but in the end i find my self playing this... 5 year addiction", "Not me hearing this álbum and playing with cardboard bricks ;-;", "Спокойной ночи😄😄😄", "ALL of Them)))", "All of them are my fave. Thank you. You make us happy with your songs. Make a movie full of your songs. You might win the Oscars maybe even the Grammy's.", "Same same the world .cambodia very beautyful country", "Hello, Alan Walker. May i use one of your songs (Lilly) To make a meme?\n\n\nCan you please reply the rules to me?", "Omg", "Waght ar you the real Alan Walker?", "End dark site", "Hello hello", "I lOVE YOU MIUSIC", "I love you Alan olev Walker\none love from me\n❤❤❤❤❤❤❤❤❤❤❤❤❤\n🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹\n💕💕💕💕💕💕💕\ni love your all songs \ncant differentiate which is the best\nall are best for me\n💖💖💖💖💖💖💖💖💖", "if you dont like alan walker, i cant like you", "i wish you did the music videos too.\nbut the songs are amazing", "All songs loved ❤", "the intro song, does it have a name?", "I love it ... from Hungary", "Everytime I hear any of your music it hits the same.......... So puree😍😍😍😍", "Lonely just hit diff when listening thru headphone", "I'm in Taiwan", "Faded", "Can't choos,all tha songs are my favourite ❤️🥰\nYou are the best 💯💯", "cool", "all falls down", "Wow you made a whole album for a hope. Incredible. This is your world right? And the song about the real world is a different world for you. Alan why is it  so hard to reach you? And say you that I am here.... Who you were searching has to escape from Atlantis. Only one who can do it is you. Just gave me a chance to reach you. Let people wonder a silly comment or a realase....🌱", "Alan Walker I want to hug you 😭🖤", "i love alan walker", "00:00-1:15: Intro\r\n1:17-4:56: Lost Control\r\n4:59-7:39: Don’t Wanna Go\r\n7:40-10:55: Lily\r\n10:56-14:31: Lonely\r\n14:32-17:26: Do It All For You\r\n17:26-20:49: Different World\r\n20:49-22:08: Interlude\r\n22:08-25:17: Sing Me to Sleep\r\n25:18-28:35: All Falls Down\r\n28:38-32:05: Darkside\r\n32:09-34:49: Alone\r\n34:50-38:49: Diamond Heart\r\n38:51-39:29: Faded (Interlude)\r\n39:31-43:00: Faded", "Your songs are so relatable to the point where it’s kinda scary😂", "Pp there cant be no better you are no.1❤️‍🔥🇨🇭🇨🇭🇨🇭🇨🇭🇨🇭🇨🇭🇨🇭🇨🇭🇨🇭🇨🇭🇨🇭", "My favorite though is darkside", "മലയാളീസ് undo??", "faded was my favorite", "All songs are my favourite in this album...", "28:56", "im in love with intro and I wanna more stuff of it", "7898962\n78916", "Ngl, Faded almost makes me cry", "This is so nice song", "I miss these times.....\n\n\n\n\n\n\n\n\nEVEN THOUGH I AM ONLY 13😂", "I love bag ground music ❤️", "Sad xd", "great!", "The Intro is the best song . . .Period!!", "I'm I the only one noticing the helicopter on the top left side.", "this is my wish to meet world best person alanwalker.", "Every song is my favourite i LOVE THEM ALL IM YOUR BIGGEST FAN 🥳🥳🥳", "I love all music, they reveal my true self", "alan walker my favourite is intro", "🔥🔥🔥🎶", "I fall in love with it 😢😢", "And we both know 💔", "The only artist who wear mask early than us all. I think Alan Walker knew about COVID-19 long ago.", "Super❤️❤️😘", "it's 2021 and still kick'n!", "COD", "Lily", "I love it", "<3", "UWU", "❤️❤️❤️❤️❤️❤️❤️❤️🎧🎵🎶❤️❤️❤️❤️❤️🇧🇷", "dude you did it all so all is the best \nbut my favorite is alone , darkside", "I love all,I think all best", "🙂", "Lily", "Ikr", "I think im inlove with alan walker HAHA", "xd y uso la cuenta de mi mama para los comentarios", "Donde estan lo fans de Alan Walker q hablan españooool", "pubho, opml;m,", "Intro my favorite😊", "hi 🕊️🇵🇭👑⛪", "Best album of alan", "Yang dicari\" lewat beranda dengan sendirinya😭", "وقتاش يردو البث مرة اخرى🤔", "Faded is my favorite", "Alan walker 's different world is best when you are in a different world ( mad fan of alan walker )", "Timestamps:\n00:00​-1:15: Intro\n1:17​-4:56: Lost Control\n4:59​-7:39: Don’t Wanna Go\n7:40​-10:55: Lily\n10:56​-14:31: Lonely\n14:32​-17:26: Do It All For You\n17:26​-20:49: Different World\n20:49​-22:08: Interlude\n22:08​-25:17: Sing Me to Sleep\n25:18​-28:35: All Falls Down\n28:38​-32:05: Darkside\n32:09​-34:49: Alone\n34:50​-38:49: Diamond Heart\n38:51​-39:29: Faded (Interlude)\n39:31​-43:00: Faded", "you love bro", "It's hard to choice the best, I love all of them! \r\nBut maybe \"All Falls Down\" and \"I don't wanna go\" are my favorites", "Spirit alan my support 👍", "Darkside", "pubg", "volta in venu", "difference in every space @planet", "Alan walker lyrics IM not alone beautiful songs thanks Youtube ♥️ ♥️ ♥️ 🎸 🎸 🎸 🌏", "Gdzie są fani Alana Walkera którzy mówią po polsku?? Kto sądzi że jest najlepszy i jego piosenki sa niezastąpione daje lika <3", "Defo darkside", "Alan Walker's music always has this astonishing way of striking straight at the heart.", "My daily album 🤘", "😌🤗❤️👌", "I'm watching in April 2021\nWho is with me?", "Different world is a song that make you sad for no reason.              Love this masterpiece❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "2021 Alan Walker ❤😍👏👏", "WHO'S HERE IN 2021? doing hw while listening to this<3", "argh lit af!!", "me encanta tu música Alan Walker el mejor DJ del mundo", "Fantastic playlists! \n\nOn the other note, where can I buy a merchandise of a similar hooded jacket with pocket in front as popularised by Alan Walker. \n\nHis signature constant wearing of Face Mask 😷 just fit in the year 2020 pandemic.", "jest dobry", "different worl", "do it all for you\r\nlistened to it over and over again", "faded is my favorite song", "I'm French but I' love your song and I listen your music on repeat it's really good. And finally my favorite music is \"lily\".", "amazing work!", "D", "D", "I love all the debuts of Alan walker. Those who like to be alone can feel his songs better than others", "Congratulations", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️💯💯💯💯 exclllent music Alan Walker extradinary Remix So much ❤️ magnífic voices", "LOVE THE MUSIC!!!  but...Too many ads!!  :-()  At least do it between songs, not smack in the middle of them!!  SMH", "I like this...", "sit on song", "@Alan Walker, i have two from this album...Don't wanna go & Different World, For a side note been listening to your music for a few years now dude...your music has helped me through some rough times i won't say em but there were times when i wanted to just give up but then i hear your music and sing along to the lyrics and i start to feel better so Thank you Alan Keep On Keeping on dude", "My favorites are sing me to sleep, all falls down, and darkside   :)", "<3", "All of your Songs . put i got NO CASH", "my favrite song is lily", "Lily", "my favorite songs are: Don’t Wanna Go, Lily, Lost Control and Darkside", "Different worlds come from different thoughts", "Belle musique super", "This is the best", "I wish the intro was longer", "your favorite alan walker", "love this", "Trafic in starting of every song", "I hate Warframe", "ငါအဲ့ကိုလာလို့ရလား😞", "🏆", "Lily 😊😊😀😀", "If u like Alan walker👍", "all XD", "it is amazing how alan walker makes everything so perfect!", "Я не знал что распространение информации это шизофриния", "Ну я их не напишу если вы не преедите ко мне дамой и незакроете в затоболовку справка есть удостверение есть теперь я личность", "Hi Alan walker", "Best bub", "I love this intro.", "the intro is the best"]