["🥰🤩", "Esta es mucha canción", "TRAIGO ESTÉ MENSAJE PARA TODOS ESPERO Q LO COMPARTAN CON MUCHAS MAS PERSONAS ES PARA SALVAR EL PLANETA!, LAS TEMPERATURAS ESTÁN SUBIENDO TENEMOS 3 AÑOS PARA SALVAR EL PLANETA TENEMOS Q REACCIONAR YA! SI NO LO HACEMOS EL MUNDO PASARA POR UN CATÁSTROFE HORRIBLE GRACIAS AL CALENTAMIENTO GLOBAL Y MUCHAS COSAS MAS PORFAVOR COMPARTAN ESTE COMENTARIO A MAS PERSONAS REACCIONE NOS VAMOS A MORIR TODOS TENEMOS Q HACER ALGO YA!!!🙏🙏🙏🙏", "🇧🇷👏🏻", "1:23", "TEMAZOOOOO", "siempre que me siento mal escucho bad bunny", "Me gusta mucho la música 🎶🎶🎶🎶", "Por  que  no  fuistes  ayer  alos  premios   o  nnca  vas", "Maldito año", "I played this song and a bunch of latina moms came out of no where", "Temazo sigue haci mi Bad bunny 💪", "Tqqqq Richhhhh", "La canción que escuchábamos juntos. </3", "Mi sueño el saludar a bad boni", "Bad Bunny te quiero hacerle a mi comentario hay una copia tuya que", "1:23", "1:22", "Justamente me botaron del trabajo escuchando esta canción.💔", "ESTO ES UNA CANCION MARAVILLOSA UNICA YO 24 7 CON LA CANCION JAJAJAJA", "Que lindooo", "1:22 min", "Escucho bad bunny 😊", "https://youtu.be/p22FqnUsb-E", "B👁️B.", "Es la primera y hasta ahora, única canción que me gustó de Bad Bunny😿💗", "F para el vato que se iba a morir", "estes es mi tema", "Me recuerda la cuarentena 😭", "Viva bad Bunny cabrones 😎😎😎😎el rey de la música", "Sos tan bueno, mejor que un tal Ed 😻", "Yeayae", "lloro mucho", "yo  escuchando bad bunny \n\nmi mamá que escuchas \n\nyo bad bunny \n\nmi mama bad q \njajajajja", "Pasen el nombre de la canción de fondoooooo,la que es salsa", "No me gusta este tipo de música, pero la parte de \"conocí a alguien, pero no sé, nunca encajo\" se siente tanto porqué a ese alguien que perdí era tan especial y no hay nadie reemplazable...", "Sigo viendo este video y me parece precioso y nostálgico. ❤️ En verdad este Man cambio mi forma de ver el reggaeton", "💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗", "Hoy salí con los muchachos a bebeeeer  buen ritmo bad buny", "Mi parte fav es en el minuto 1:22", "❤️🙂", "Maldito Año Nuevo, y lo que me trajo me “votaron del trabajo” jajajaja", "desde que salio no la puedo dejar de reproducir, esta cancion es joya", "Bad bunt", "O", "A", "Mi hermano le encantaba badbunny desde los 15 y se murió en algo de bicicletas yo quería verlo en el concierto de badbunny 😭yo cumpliré el deseo por el gracias badbunny por tus canciones pero no dejes de cantar lo estraño  mucho y a el le gustan chambear ahora soy peor  y no alcanzo a escuchar yonaguni 😭 lo are por el así q muy pronto iré 😭😂😊 😞 para no estry sola y sentirme sola", "i was forced to listen to this", "400 míllones 🥺✨?", "Jjjajajajaja jajajajaja jjajajajaja jjajajajaja jjajajajaja jjajajajaja jjajajajaja jjajajajaja jjajajajaja", ".", "Maldito año nuevo 😅", "la mejor canción xd", "maldito año nuevo y lo que me trajo y lo que me quito", "2:38 muy buena", "My favorite song while I'm drinking alone", "Maldito año nuevo y lo que me trajo : muchas tareas 😅", "Bad bunny que haces?", "No pa yo cuando estoy triste escuchó faraón love shady 😎raaa", "esa musica que se usa como intro, da mil años de vida <3", "le faltto intro", "estò no caducaa😢", "La canción de mi vida y mi hermano", "18/ de septiembre del 2021💔💔💔💔21 de febrero 2022 todo acabó💀💀💀", "Está canción la escuche cuando salió por un amigo, ese mismo día terminé con la que hasta hoy día fue mi última relación, tiempo después a ese amigo lo perdí y ahora yo estoy solo escuchando esta joyita", "Amo este himno me hace sentir muy feliz y triste a la vez 😿❤", "Si veo a tu maaama\nY esque estoy arreeeeeebaaaaatttttaaaaaaaaao\nNo e borrado su foto jaja solo la puse en privado", "Wuuuuuuuuuuuuuuuwwwwwwww", "¿pero que música loca es esa?...  eso no es un coño de música... ese no es artista nada!!!!!!!", "Empieza 1:24", "2 años nuevos sin fiesta por lo del covid😰pero nos vale quesos🤣", "De nuevo digo !Que alegria ver a mi amiguita del liceo en este video!yupiii", "Yo igual escucho bad bunny reírme un cacho y olvidar mi problemas", "maldito coronavirus", "Cách hát của đức phúc luôn làm hài lòng tất cả mn.", "tú sabes lo que yo hago cuando estoy triste? escucho Bad Bunny pues sí, es cierto.", "que buena cancion bad bunny brutal", "Como se llama la salsa del principio", "Hola", "@Bad Bunny porfa escúchalo te gustara esta cancion de este Domiciano: https://www.youtube.com/watch?v=vrlLHy89tHA", "Bad Bunny", "WTF NO SUPERO ESTO.", "Me gustó mucho", "Quien en 2025 sigue escuchando esta rola💪😶?", "alguien me podría decir el nombre del chico q sale al principio?", "tu mamaaaaáaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa🎉🎉🎉🎉🎉🎉🎉", "2 años desde que salió está joya de cancion y aún la sigo reproduciendo 🎶🎶", "Al principio se parece a la canción de Spidee González", "😭😭😭😭😭", "2:21no se porque diablo me engaño diciendo que te olvide cuando te extraño solo comparto memes ya yo no escribo nada y no e borrado tu foto solo la puse en pribada", "Te amooooo88888888888888 jsjsjsjwjjsjwjwjwj", "Yo soy fan de Bad buni meses todas sus canciones", "Vamos bad bany mi mejor artista veamos cadajo", "Las personas que están escuchando en abril bendiciones.", "soy tu fan numero *1", "COMOOO ME LA SUBE ESTE TEMA ES RAMMMDOOOOMM 🌠", "Así el Benito hico que no suic7d8", "Me ases berga  esta música ✊🏻", "Porque ya tú no me quieres y sin ti meva mejor 🥺🥺🥺", "Bueno creo que todos pasamos por momentos muy duros 😝😝😝", "Jueves 14 de abril \nY todavía estoy escuchando este temaso", "Alguien sabe el nombre del.chico que se quería ahorcar??? 😍", "Y no e borrado tu foto solo la puse privada", "Esta música es muy linda", "La canción empieza en 1:34", "Aguante Paraguay", "1:22 😎🍍", "SI VEO A TU MAMA", "https://www.youtube.com/watch?v=tET9-mA759w&t=1003s", "💔😭😭🥲😓🥺", "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "GET LIL YACHTY ON THIS", "ede bad bany", "Bad bunny si que le acerto a ese año y lo que nos trajo😢", "todavía  yo te quiero", "El niño cada día más basado", "Bad ochi", "👁", "que buena rola de michael jackson", "Soy tu fan", "Bad bonny canta horrible... cielo santo, bendito youtube por recomendarme esta canción casi me rompe el tímpanoo   😩😥", "Esta canción define mi situación actual 😪", "ay papi", "tu sabe' lo q hago cuando estoy triste??", "bad bunny me voy a mudar a puerto rico voy por ti", "Cuando era feliz y no había pandemia:(", "Gracias...", "vamo por los 400 míllones ❤️", "aún no supero está canción<3", "La canción comienza en 1:23 !!! Like si lo escuchas en el 2022 !!!", "Hace dos años de esta canción  y la escucho como si salio  ayer ❤♾ si veo a tu mama ❤", "2022 llega la canción;si veo a tú  bro\nXDXD", "Q canción más    bonita para mi porque me marido me la dedico😊😄", "Maldito año nuevo .. Y lo que me trajo .   Mi Esposo falleció en  enero 😓.  Chida rola", "Me acuerdo cuando salió esta canción y era feliz ahora cada que escucho está canción me da nostalgia", "Trr", "www", "Klk", "Exelente 💎", "me botaron del trabajo por estar mirando pa bajo uuu", "https://youtu.be/LGMk1rN-Q5E \n\nRochy RD Tiradera A El Alfa", "Best latino artist ❤️ the way he put efforts on his songs ❤️love from india ❤️", "No me gusta nada bad bunny pero escucho esta cancion y si me dan ganas de vivir", "Te amo netaaaaaaaaa", "Amo bad bunny🌯🐱", "tequierooooo", "This man can sing!!!!", "maldito 🥺", "Dios i jesús nos guarden", "🐰🐰", "Jajajajaja Coronavirus", "Nunca pensé que me identificaría con esta música.", "Termine con mi polola hace 2 semanas, y realmente esta cancion es mi salvacion, estoy hecho mierda pero esta cancion lo retrata de un modo distinto y me llega a subir el animo....gracias bad bunny por salvarme la vida con este tema <3", "eee", "Zzzz", "Hasta mejor con ramon ayala", "Hola 🖤", "Para R va, no se porta no me engaño diciendo que te olvide cuando te extraño jsjajja seguite b4s4nd0 con 6", "2022", "Esa es la actitud \nVer a bad bunny Cantando \ncon su gran virtud.\nEnseñando a los mayores \nTambién a la juventud.", "Que asco!!!", "Es increíble que escucho las canciones de bad bunny en el momento justo donde la letra encaja con mi presente", "Mañana cumple 23 meses que ascendio al cielo el alma de quien en vida fue uno de mis grandes amigos, esta cancion me recuerda todos los momentos deacachimba que pasamos juntos, esta canción se volvio tan emblematica que me traslada al 25 de diciembre del año 2019 a las 4:45 de la madrugada. Sonó por casualidad en ese instante mientras yo hablaba por telefono con mi ex, claro... me encontraba ebrio, ebrio pero con los panas. Mi consejo es que nunca se es joven de nuevo y nunca se vuelven a repetir  los momentos que compartimos con lo demas. Un abrazo hasta el cielo, bro. #hoysalíconlosmuchachosabeber.", "1:20", "Because Moms@AriAsErBorelakdieidb\nYeah you adore of bon", "1:50", "I am so cold wirthour 🕸", "BcUZheHursZ", "un hit", "Esta joyita nunca pasara d moda", "Yo escuchándola en este preciso momento...!!!", "1:22 denada gente", "me encanta esa cacion", "la estraño", "my mama meabandono", "yomesiento asy.😣😓😢😭", "Love you bad bunny", "Hoy sali con los muchachos a beber 🍻 y dije que de ti no iba hablar, son las 5 ya va amanecer 🌅 si no prenden la boy a llamar 😩", "ga", "YO: cuando pongo esta canción y veo que todo el mundo la está viendo  \nEn el chat :v XD", "yo aqui escuchando la musica y viendo tik tok y todo el mundo en el concierto de el 😭😭", "2020 de mierda y pensar que tenia muchas posibilidades :c", "hola", "https://youtu.be/Ei9SP9Y9Gs0", "no puede ser que ya pasaron dos años desde que salió este himno recuerdo como si hubiera sido ayer :)", "Quién 2022", "Y si veo a tu mamá..", "Te amo crush", "𝚀𝚞𝚎 𝚋𝚞𝚎𝚗𝚊 𝚖𝚒𝚜𝚒𝚌", "la forma se escucha un poco chotiada al principio y casi al final de la canción de speedy Gonzáles haber si no le demandan por derechos 😂😂", "no", "Yo tengo todavía una de esas radios pequeñas amarilla jaja", "Amo este temaso es cucha:\nNose por qué diablo me engaño disiendo que te olvide cuando te extraño solo comparto memes llano escribo nada y no e borrado tu foto sólo la puse en privada....", "SOLO EL INSTRUMENTAL PORFAVOR SI VOS DE VIEJO", "Lento with a Nosse is My Minme afihewa Ko0)b3 \npe32", "De todas las canciones de Bad Bunny, esta es la única canción que me gusta, y creo que no soy el único, somos varios ;) \n\nSaludos para todos", "2 años de esta canción? Wtf pero si yo creia que era nueva", "1:22", "1:23 empieza la música", "Me acuerdo que cuando empezó la cuarentena repetia esta canción era la que más me gustaba entre otras 12, me recuerda esos momentos buenos, cuando nació mi prima, hacia frío veía netflix todo el día, y como era cuarentena y estaba este bicho yo sabia que iba a pasar más tiempo con mi familia en la casa, eso, solo quiero decir que disfruten todos esos momentos", "bad que 😅🤣😂", "aoyo", "#ThanksYouKNB", "literal cuando estoy triste lo escucho ;)", "!lkkkkk\n\n\n\n\n\nÑ", "AMO ESTE TEMA", "Suena como cancion de roberto y su nuevo montuno o tnt band... cual sera?", "😌🤘🤘🎶", "no puede ser que ya pasaron dos años desde que salio este himno recuerdo como si hubiera sido ayer :'') (ama soy famoso :DD)", "Maldito año nuevo", "Megusta escobar la cuando estoy triste", "Kar t amo 💙 1M\n\nComenzamos", "NO SUPERO ESTE TEMAZO 😅💯 MUSICA", "😭😭😭😭", "Laura cry", "https://youtu.be/aQk4AS3KBE8", "Mi musica favorita nunca va a pasar de moda", "El conejo 🐇 malo", "đầu tư trang phục quá chừng", "Yo poniendola en el colegio para que escuche mi ex", "Comenzar el 2023 bien cabron con esta rolita porque ya te estoy superando beibii", "Me siento en 2020 con esta canción", "The Era leaded by passionated artists is struggling with the era of anti passion puppets, that serve as a vulgars objects to make the fake art machine bigger, Stop consuming social media, the future must me created by free minds and souls, the message behind this cheap material is making you a non value thing.", "SI VEO A TU MAMA XD", "Como pasan los años y este sigue siendo un temon", "Le copio el estilo a una canción de leo dan", "Yeh, yeh\r\nTodavía yo te quiero\r\nPero sé que es un error\r\nPorque ya tú no me quieres\r\nY sin ti me va mejor\r\nY si veo a tu mamá (ey)\r\nYo le pregunto por ti\r\nPa' ver si ya tienes a alguien (ah)\r\nAlguien que te haga feliz\r\nY es que estoy arrebatao'\r\nPensando en toa' las veces que te lo metí\r\nPensando en toa' las veces que estuve pa' ti\r\n(Pa' ti, pa' ti, pa' ti)\r\nNo sé por qué diablos me engaño (no)\r\nDiciendo que te olvidé cuando te extraño\r\nSolo comparto memes, ya yo no escribo nada (nah)\r\nY no he borrao' tu foto, solo la puse privada\r\nMaldito año nuevo\r\nY lo que me trajo, ey\r\nMe botaron del trabajo\r\nPor estar mirando pa' abajo\r\nPensando en ti siempre cabizbajo\r\nMe veo gordito, nada que rebajo (ah)\r\nNo sé por qué la vida me ultrajo (no)\r\nPensando coger un atajo\r\nConocí a alguien, pero no sé, nunca encajo (ah)\r\nAl menos que seas tú (tú, tú, tú, tú)\r\nBaby, te quiero aunque diga lo contrario\r\nLlevo seis meses solitario pero\r\nHoy salí con los muchachos a beber\r\nY dije que de ti no iba a hablar (no, no, no)\r\nSon las cinco, ya va amanecer\r\nSi no prenden la voy a llamar\r\nHoy salí con los muchachos a beber (eh, eh)\r\nY dije que de ti no iba a hablar (no-no, no-no)\r\nSon las cinco, ya va amanecer\r\nSi no prenden la voy a llamar\r\nTodavía yo te quiero (yo te quiero)\r\nPero sé que es un error (no se hace, no)\r\nPorque ya tú no me quieres (no, no)\r\nY sin ti me va mejor (uh-uh)\r\nY si veo a tu mamá, (mami) ey\r\nYo le pregunto por ti (eh, okay)\r\nPa' ver si ya tienes a alguien\r\nAlguien que te haga feliz", "Wow 2 años y todavía recuerdo estar escuchando esta rola en año nuevo", "1:23 empieza :)", "👊👊👊👊👌👌👌👌🎰🎰🎰😎😎😎😎😎😎😎😎😎😎👊👊👊👌👌👌👌", "me encantan tus canciones y me  las sé casi todas y soy una niña y me 3ncantan", "bad bunny sienpre nos da felizidat con sus rolas", "baby te quiero aunque diga lo contrario 😢😢", "Story time? Crop", "Esto me hace recordar cuando estábamos en cuarentena, la pandemia y todo eso.. Inolvidables momentos buenos y malos.", "che porque me graban cuando estoy a punto de venirme, digo, irme", "😮‍💨😮‍💨", "Aquí lo que rifa es Bad boneee .... 😁", "Abril del 2022 y todavía te quiero pero se que es un error,", "No se pero amó esta pieza", "Proximamente Bad bunny: SI VEO A TU PAPA \nXD", "Tu sabes lo que yo hago cuando estoy triste ? ORAR  🙏🏻.  Y TAMBIÉN ESCUCHO BUDBUNNY", "Pero q tu haces... Haciendo?", "Si a mi me gusta cuando dise  aldito Año Nuevo", "Que rola tan perra", "Todavía yo te quiero pero se que es un error🤧", "Yo amor está música 🤩❣️", "conpa no es tes triste", "Una madrugada el 4 de abril en pleno 2022 escuchando esta canción es lo mejor", "de la mejor cancion", "🔥🔥🔥", "En esta parte  4:09/ 4:26, me hace recordar a mi ex  @Laura Alejandra mogollón  arias, Te extraño", "Ya dos años desde q salió este tema, q rápido paso el tiempo, verdad?", "Te amo benito", "Bad Bunny lo mejor!!", "Girl from ipanema as the melody is great", "bad bunny siuuu j balvin siuuuuuuu oasis", "siuuuuuuuuuuuuuuuuuuuuuuu", "pero que tu haces    haciendo ...", "Todavía yo te quiero 💃🏻pero se que es un error 😭", "like si te gusstan las canciones de bad bunny", "Uff que rolón 3 de abril esperando el nuevo álbum 2022🥲", "Maldito año nuevo me botaron del trabajo", "bellllpooo", "Cada que me siento mal vengo aquí:(", "Abril del 2022 y no dejo de escucharla,es un temazo del conejo malo 🔥", "https://youtu.be/SRt0KAMCI4Q", "Amo esta cancion", "La amo trae muchos recuerdos ami mente bad bunny es el mejor", "no te extraño a la persona, si no tu compañia...", "Maravillloso me encanta", "Ay! Bad bunny burn tra", "Alguien mas esta canción le recuerda a Leo Dan ? xd", "Tu sabes lo que hago cuando estoy triste ?\n*Que? \nEscucho Bad Bunny\n👌🎶💗✨", "cancion buenasa para año nuevo y siempre sera mi favorita", "Se ha vuelto mi favorita 🥰", "garota de ipanema?", "Te amo Bad Bunny quiero ir a tu concierto", "Se parece a rocky el boxeador", "Cómo que en una parte tiene el tono de la canción Speedy González de Manolo muñoz", "Me encanta esta canción", "Grande alexby", "🤮🤮🤮🤮🤮", "Pensar q ah  la unica persona q le cantaba esta cancion hera ah mi hermanaº , Y se me fue hace dias. , Cuando la escucho ahora lloro mucho me arecuerdo de todo lo q vivimos te amo hermana😭😫💔", "Amo esta cancion🌹 quien mas en el 2022", "Bad Bunny mi patron :)", "Jajajja 😔", "Y si veo a  tu mama le pregunto por ti \nEs que estoy arrebatao 😄😄\nEse Bad Bunny \nMe fascina me vuelve loca :v", "Si veo a tu mamá yo le doy pol ti", "Si sobrevivimos a la pandemia y variaciones, a los inicios de guerra y al meteorito que siempre dicen que se estrellada, a los alienígenas  y a la suegra cantaremos está canción !!", "No me gusta mucho bad bunny pero esta canción una de las pocas que me gustan demasiado😄", "Ni modo a escucharla para empezar bien abril", "Temazo", "<3", "Es cierto sin ti me va mejor", "Buenazo", "Llevo sei mese solitario pero hoy sali con los muchachos a beber", "xara estas aqui", "como me gusta el beat amigo\nbuenarda", "temazoo", "Buena música ♪┌|∵|┘♪", "Quien sigue escuchándolo este tema en el 2022 Marzo", "UN ROLON", "👁", "Rolita pa' el diciembre, otra gloriosa creacion de bad bunny", "Yo la pongo en el año nuevo", ":(", "al minuto 1:33 empieza XD por que tanta cinemática bad bunny", "Q feo canta", "siempre habra alguien que te escuche, ayude, solo ay que buscar bien y uno de ellos es bad que bad bunny", "Todavía yo te quiero pero se que es un error por qué ya tu no me quieres y sin ti me va mejor. Jiji", ":( Yo le pregunto por tiiii pa ver si ya tienes a alguien alguien que te aga feliz 😖", "yose que a un la quieres", "TENGO GANAS DE UN NEGRO", "que temazo", "Diciembre seviene chido otra ves es cuchsndo de nuevo esa cancion y eso que ya estámos en el 2022 no meaburro de escucharla😎😎😎😎", "Llevo 5 años solitario pero se siente como 6 meses\n\n\nEsta rola me hace sentir haci", "🥺💗te amo bad", "Vanne esta mal de la cabezaaaa", "HOT POR ANTHONY jajajaja", "Y tu novio vannery?🥵🙏😻", "Yo también escucho bad bunny cuando estoy triste o feliz… pero hoy andamos sad 🥲🥺", "BAD BUNNY\r\nSI VEO A TU MAMÁ | YHLQMDLG (Video Oficial)\r\nEscucha YHLQMDLG:", "hoja en blanco", "Ya tendrás a alguien mejor ? 😭😭😭", "gud song papu :v", "Sssshhhhhhshshshshhs🙈🙉🙊😝😝😝😝👅👅👅👅👅👅💪💪💪🙏🤙🤙🤙🤙🤙💐🌿🍃💭🐬💜🙏🤙🤙🤙🤙👅🤙🤙", "Que💭💭ssshhh🤙🤙🤙😭💐🍃🌿🍀🤙🤙🤙🤙🤍🙏🙏🙏🙏🙏💐🌿🍃🙏🙏🙏💜🐬🐬🐬🐬🐬🤙🤙🤙🤙💭💭💭💭🐬💜💜💜🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🍀🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙🤙", "Hay que rescatar unos temas de bad bunny son muy buenos y son varios pero este es mi preferido ¡¡¡", "Yo también escucho a Bad Bunny cuando estoy triste", "Si veo atu mama yo le pregunto x ti🙏❤️🔥", "2:54 AL MENOS QUE SEAS TUUUUUU", "2:53 adicto", "No se por que diablo me engaño diciendo que te olvide cuando más te extraño 😔", "Uy no está rolita está buena no creen  🎉", "orrendo temazo", "Y empezamos a recorrer el álbum completo.❤️", "Marzo 29 ,2022 y para mi la mejor rola ,, Benitoooo", "Me encanta esta canción 😍", "Qué rola. Tan buena", "Quien presente escuchando este tema????????", "La mejr cancion de bad bunny 🐰 🐇 😍", "el verdadero : bad bunny me hace feliz", "Yo estoy escuchando esta rola el 28de marzo el año 2022", "La única música que me gusta de bad bunny como la escucho bastante, temazoo ❤️❤️", "1:30 empieza el bailongo por dioss", "¿Quien la escucha a finales de marzo y empezando abril?reporte se con un like", "UFFFFFFF PICANTE LA MUSIC", "se estreno en 2020 y recien hoy lo escucho \nuna bomba sin duda 10 de 10 \njusto cuando me dejaron :c", "Hoy salí con los muchachos a beber y dije que de ti no iba hablar🎶", "La mejor parte es que diga maldito año nuevo", "El único que artista que tiene más vistas que subs,y los que los vistan saben que esta canción pegas más!🫠", "upaaa With the best energy I recommend you ‘’ Euphoria - Feelings (Acid and tech house)’’ https://www.youtube.com/watch?v=4U1hvFcxJ00&t=245s&ab_channel=FEELINGS", "27/3/2022", "Vallan poniendo las bosnias con la canción 🙃🍻", "27 marzo del 2022 y aún amo esta canción.", "1:25", "ESTE HIMNO SE ESCUCHA A TODO VOLUMEN💜🔥🔥✨", "Te amo mucho", "Soy tu fan número 1", ":) te amo bad bunny", "A", "Quien en el 2022 escuchando este himno?🤪", "Siento ganas de llorar cuando escucho está canción, por qué???\nNo entiendo por qué", "Me llega ban bonny", "🙌🏼❤", "Al menos que sea tu ❣️❣️🥺 ... Hoy salí con los muchachos a beber 🤤 y dije que de ti no Hiba hablar todavía ti te quiero pero se que es un error y si veo a tu mamá ❣️💔 yo le pregunto x tu uuyyyyy........", "😍😍😍😍😍😍❣️❣️❣️❣️❣️❣️🥰", "1:20", "Los videos de bad bunny son unicos", "Ya hasta vivo con mi suegra 😂", "BASURA \nYA NOS FUIMOS AL CARAJO COMO SOCIEDAD", "No se por qué diablo' me engaño\nDiciéndo que te olvidé cuándo te extraño... :c", "1:22", "💗", "Mi tío es fan😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "Teamooooooooooooooooooooooooo", "sssii", "Hola", "Bad bunny Te amo<3", "La unica cancion que puedos escuchar repetidamente 😔🌍🤙", "porque la musica de bad bunny te pone sad:(", "Mi hijo dice que eres un genio...creo que tiene razón😄", "lle todabia yo te quiero  me gusta  mucho esta  parte 💜💜☺", "En el minuto 1:21 ya enpiesa la canción", "De los 350M de vistas 10 millones son mías 🧠🤯", "al menooos que sea tuuuuuuuu", "MI ROLAA", "a quien mas le salio un anuncio de 6 palabras para que la mujeres te amen XD", "Ay mi 2019 🥺", "❤️B🔥A❤️D🔥B❤️U🔥N❤️N🔥Y🐰", "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "i love this song", "Como la extraño", "Yo se que me quieres", "Por eso se retiro Daddy Yankee los artistas actuales estan sacando mejores canciones y se vuelven tendencias hasta en tik tok y nuevos trend en cambio Daddy empezo quedando al pasado .. y antes que decayera su carrera mejor se retiro", "me gusta la cancion muy buena", "\"Solo Comparto Memes ya Yo no Escribó nada Y no he Borrao tu foto solo la puse privada\"\n\nMe Identifica esta Frase", "Hola ❤️", "M ENCANTA LA CANCION", "TE AMO", "No es por nada pero es la mejor rola 😔😔 casi finalizando marzo del 22 y la sigo escuchando", "Temazoo👍🥳🥳🥳", "1:22 xd", "Si gratis si gratis gratis todo si si si si gratis todo si soy dioses soy dioses si soy dioses si gratis gratis todo si", "Pinche canción toda mongola", "el mejor disco y album que saco bab bunny este disco me hace recordadr cosas de atras y cuando me siento solo lo escucho y me desaoga  te agmiramos", "esta cancion fue para el 2020\n\n y yo aca recordando ese año", "Mmmmm en version bachata seria excellente tambien !remix BadB!", "😎😎😎😎😎", "buena muisca para el año nuevo", "Asiiii ess    🥺🥺🥺🥺🥺🥺🥺🥺😏😏😏", "Yeyeyeye", "amoooo😍😍😍😍😍😍🥰🥰🥰", "me justa mucho esta cancion", "L pa primera escena es demasiado level", "Temaso", "Gracias. Yu", "🥺❤️🖤✨BAD BUNNY EL MEJOR", "Dicen que ese muchacho se terminó sucidando 3 minutos más tarde..", "1:23", "Benito el mejor álbum YHLQMDLG🐰", "Te amo Benito tus canciones son muy buenas", "Benito salvando la cuarentena.", "Tu  no", "❤️❤️❤️❤️❤️❤️", "Na muy ramdom la intro", "★★★☆☆", "Bad Bunny - Si Veo A Tu Mamá [Official Video]", "Ojala mi papá hubiese visto este video.", "Superior 🛐", "El ritmo está bien mamon jaja", "Gracias Bad Bunny por estos temones, la vdd siempre los escucho cuando ando mal, gracias por acompañarme en mis momentos donde siento que no doy más 😔... xq nadie me escucha.", "que nostalgia escuchar al grande, de nuevo 💝", "La mejor pa", "La mejor cancion q he escuchado", "No le gustaba escuchar Badd bunny hasta el día de hoy", "yo igual en la escuela solo con musica las 5 horas por que no tengo a nadie (￣ ‘i ￣;)😢", "Todavia yo te quiero pero se que hubo un error por que tu ya no me quieres y sin ti me va mejor y si veo a tu mamá pa preguntarle si ya tienes a alguien alguien que te haga feliz y es que estoy arrebata o🍵", "Quien la sigue escuchando en 2022", "Siempre escuché críticas , primera vez que lo escucho 🤔🤔y me gustó su música 🤔el ritmo y la letra 🤔 está buena e fondo 👍", "VLAD - SI VEO A TÚ MAMÁ | YHLQMDLG (Video Oficial) #Vlad #SiVeoATuMama #YHLQMDLG Vlad", "Thank you for this video because when ever I’m in that dark place where I want to attempt suicide, the first 2 min always make me smile because you always have 1 person who see’s you.", "Me gusta esta canción 🥰🥰🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳", "Aquí solito escuchando este temazo", "Que grande", "Parecera chiste Pero muchos no’s sentimos como ese tipo", "😔😓", "No soy fan, sin embargo sentí ese deseo de ya no estar aquí.", "Soy dioses soy dioses si gratis gratis gratis si gratis todo si si gratis gratis si si gratis", "Gratis gratis gratis todo si si si gratis gratis soy dioses soy dioses", "Soy dioses si soy dioses si soy dioses si soy dioses", "Lo mejor!!!", "Soy dioses si si si soy dioses si gratis gratis gratis todo si si gratis", "Teamo", "Bad Bunny versión Padre de Familia jsjs", "Solo las principales palabras que dice bad bunny dan nostlgia tristesa y no me nieguen que no recuerdan a sus ex", "1:23 Inicio", "Orrible canción me recomendaron sin el autotom no es nada canta cosas sin sentido 👎👎👎👎👎👎", "Mi sueño es ser cantante y militar", "XX bad bunny", "Creo q Bad Bunny recientemente tiene mas popularidad que Daddy Yankee por eso mismo Daddy se retiro antes que su carrera comenzara a decaer ya q artistas nuevos como Bad Bunny Raw Alejandro y etc son tendencia tanto en redes sociales como en plataformas digitales ya que en tik tok se vuelven famosas también muchas canciones y en tik tok ni una de Daddy se volvio tendencia bastante tiene q ver eso", "sigamos disfrutando este temazoo", "🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇱🇷🇱🇷🇺🇦🇺🇦🇺🇲🇵🇷🇵🇷🇵🇷🇵🇷", "real yo tambien escucho badbunny cuando estoy sad :'(", "Like si estás en 2022😂😂", "1:23 comienza la musica", "Yo terminaría suicidándome al escuchar esa mier🤬😂😂", "pinche roloóoooon, no mamen.", "Más vista 🔥🔥 que temaaa 🔥", "Esa canción es de leo dan pinche plagio de melodia", "Hoy quien más escuchando el álbum YHLQMDLG completo de nuestro conejo🐰 favorito", "BOMBA BOMBA SI GRATIS TODO SI AUXILIO BOMBA SI ROSA SI ZULMI GRATIS TODO SOY DIOSES soy dioses", "Mi cumple va a hacer de bad boney\nEres  mi fann", "0:51", "Ilaek eta cason de victoria👍👏✌🏻👅😍♥️♥️♥️", "\"Conocí a alguien, pero no se nunca encajo, A MENOOS QUE SEAS TU\"✨❤", "el rey mmmmmmmmmmmmmm sisisiisisisisisisisiis", "wtf, como pasé de canciones de \"el pepe\" a esto XD", "re contra buenAAAAAAAAAAA FELIZZXZZZZZZZZZZZZZZ", "QUE", "OLA", "De nadabro canción k m gusta tiene mi apollo", "Eh sido de los que siempre lo critican , pero esta es un roloooon y más si lo que dice lo estás pasando", "Aaaaaaaaaa I Love You!!!!!!!!!!!!!!!!!!!😚😘💝", "El abuelo es un vacilon lo mejor del video por el lo veo a diario", "cuando suenes como ellos podras llamate musico https://www.youtube.com/watch?v=jn3QeUubM00", "la mejor cancion del mundo", "No te pases de lanza... Si estoy triste y me ponen este asko de rola me pongo más triste jajajaja.. que asko de \"cantante\"🤣🤣🤣", "2:40", "😘😘😘😘😘😘\nTe. quiero bad bunny", "el mejor cantante", "Hola", "😎😎😎😎😎😎😎", "😎", "🙏🙏🙏🙏", "Está canción es muy bonita porque es una copia de \"girl of Ipanema\" 🤗", "Que mal pedo que se deba limitar el alcance de una canción por la gente de cristal", "A alguien más le suena la tonada de Speedy González en el min.1:36 Al 2:02????", "I liked bad bunny I show him respect", "Like si la estás escuchando en el 2022", "🤩🤩", "OGM went to his Concert in  philly on Wednesday the 16th 2022 and it was just incredible 🐰🇵🇷🎵🎵🔥🔥🎵🎵💙🐰🔥🔥", "Te odio niño que me hace cantar esta canción a todo pulmón <|3", "Pov-la escuchas en 2022 :)", "COMO QUE ESTA CANCION YA LLEVA 2 AÑOS!?", "a", "hi", "Realmente Bad bunny relaja", "Te amo ♡¤¤♡♡♡♡♡ de corozon", "Solo comparto memes ya yo no escribo nada y no he borrado tu foto solo la puse privada maldito año nuevo y lo que me trajo me botaron del trabajo por estar mirando para abajo pensando en ti cada que habita yo no sé porque la vida me trajo pensando en coger una Tahoe conocí a alguien pero no sé nunca encajó", "Pensando en to'a las veces que tuve pa'ti", "La canción ta guapa pero no tiene sentido:v", "Escucho bad bunny 🤣🤣🤣🤣🤣🤣🤣🤣", "jijijija", "Estoy calificando canciones y a este le doy un 8", "Cómo es que se llama la música que aparece al principio de y si veo a tu mama ?", "SOY DIOS SOY DIOS SI SI ADIOS ADIOS SI SOY soy dios gratis gratis todo si soy dios si si gratis adiós si soy dios gratis todo eee soy dios e Lee si Lee @ dios SOY DIOS", "Soy dios soy dios dios si soy soy dios soy dios si adiós si si Yes", "Soy dios soy dios si adiós dios si si soy dios", "Soy dios soy DIOS SOY DIOS", "ESTA ES LA UNICA CANCION QUE ME GUSTA TUYA :D", "Cancionsasa manos vean mi verdín porfa", "🙂🙂🙂🙂", "🥰🥰", "Que chimba", "💜🐬💐🍀🍃😘🤙🙃🙊🙉🙈💞💞💞💜❣🍃", "Me dio cancer de oido", "Sabes que es lo que hago cuando estoy triste que me jalo el ganso 🤣🤣🤣🤣", "Bad bunny te amooo", "la mejor cancio del mundo", "Ekide", "ZzZzZz", "Y si veo a tu mama", "Chida musi❤️❤️❤️❤️❤️❤️😍😍", "Este Tema Lo Hubiéramos Cantado En Un Tono Pero No Vino La Maldita Pandemia Vino Y Nos Malogró Todo", "3:08 the feeling", "No mamen Luigi es bad bunny ?😮", "Que bonito era escuchar esta canción ante de está perra pandemia ala verga el amor", "Esta canción es de Leo dan.", "Ya me di cuenta q bad bunny no es malo :(", "Ta chida la rola 👌", "Mi parte favorita : pensando en coger un atajo conocí a alguien pero no sé nunca encajo... ADMENOS QUE SEAS TUUUUUUUUUUUUU\"  ( a fuerzas uno ahí donde no debe estar jajajaja 😂🤡", "Lo escucha... procede a suic$%¿*¡... 🏃", "Y si veo a tu mama🤙🤑🤑🤑🤑🤑", "Alguien de el 2022 en marzo?", "que temazo", "Hau", "bab bunny elmegor", "Ya 2022 y sigo escuchando esta belleza de cancion ❤❤", "P", "Me gusta mucho la música", "17/3/2022 💔", "que ped2 con lo que recuerda cuantas veces se lo metio jajaja", "Gracias a esta canción me hice famoso ❤️❤️bad  BUNNY", "Aww I LOVE NO HABLO INGLÉS", "😀", "🙂👌", "Genial", "Alguien sabe por que el \"Capi Perez\" sale cantando la canción..??\n😂\nBuena rola...", "La intro es la descripción real de perfecto", "La mejor canción", "El mensaje que más me llega de esta canción es el escenario inicial. Donde el chico está apunto de acabar con su vida pero al rededor nadie le toma importancia, nadie le nota. Y ya solo fue cuestión de el mismo salir de allí. Ya sea con música, o en otros casos, con lo que nos guste hacer.", "una cancion que tiene suidido no puede hablar de \"Pensando en toa' las veces que te lo meti\" que loco es esa vaina.", "Que tema karajoooo😖😖", "hola bad bunny te mando saludes desde yolombo", "Este parece a una canción antigua pero no recuerdo a cual va con ese tipo de ritmo", "Esta canción la puse en año nuevo en el momento exacto💖💎\nTe amamos conejo malo💖🐰", "Bad Bunny es para estar triste pero con ritmo 💗🤑😏🌶️", "Tu sabe lo que yo hago cuando estoy triste? Escucho a Bad bunny", "en minuto 2:12 se olle alguien tociendo ._.", "Amo en canción 🥺", "Esta si es un cancion para ponerse ah pd", "el niño... sabe lo que yo hago cuando estoy triste.. escucho bad bunny yo llorando con la cancion XD", "Horrible😛", "escuhar a bad voni es vonito", "ta ta buena la verdad", "y si veo a tu mama yo le pregunto por ti", "Me frustra el hecho de haberle dado el visto malo a Bad Bunny en el tiempo que sacó éste tema. Ahora estando todo achicopalado, esta rola me ha subido el ánimo con su tono alegre y letra tristona, me pone a ver las cosas buenas en los malos momentos, e intentar seguir adelante a pesar del pasado", "Odio la música de Bad Bunny pero tengo que admitir que esta canción es buena ya que está  \"inspirada\" en un clásico Brasileño  que se llama la chica La chica de Ipanema, pero sigo diciendo que este hombre no canta, solo hace ruidos jejejeje.\nLes dejo el link de El Chombo donde nos ilustra mas si esta canción es un plagio de otra canción o solo es una copia bien disimulada. https://www.youtube.com/watch?v=_DK29Z-wrxA", "Es mejor la canción", "Y  lo desagradable qué era pará mí el Reguetón  no sé qué fué la poesía de él , no se pero por esta joyita me curé y me enamoré ❤️❤️❤️🥺😍", "Quien más escucha para recordar lo que pasamos en época de la pandemia!!", "Tu Fe Solo No Te Salva Sigues a Cristo\nhttps://youtu.be/lofP_FkcSCE", "Bad bunny cuando estas triste, feliz, nostalgiado… bad bunny es todo", "La chica de Ipanema ahora que más se va a plagiar?", "Tremendo temón en 2k22", "lo mejor para estudiar", "NADIE ABSOLUTAMENTE NADIE :                                                                                                                                                                                                             ESTA PARTE DE LA CANCIÓN : NO SÉ PORQUE DIABLOS ME ENGAÑO DICIENDO QUE TE OLVIDE CUANDO TE EXTRAÑO , SOLO COMPARTO MEMES YA YO NO ESCRIBO NADA Y NO E BORRA'O TU FOTO SOLO LA PUSE EN PRIVADA . ✨", "Es como decirle.. que no se mate para que se vaya a la farra y a la bebida (refugio en eso) que te mata lentamente", "que punyata\\", "A qui le presentó el nuevo talentos que vas a cavar con El alfa y rochi RD  viene cómo un ciclón de rápido  https://youtu.be/nsQuUV0EhfI", "💔💔💔💔🎤🎤😭😭😭😭 ximena 💔💔🎤🎤✍️✍️", "Ami si que me echaron del trabajo...y me dejo ese amor...esta musica es terapia pura ❤️", "🛐↘🔛🔚🔚🔙↘🚭🚳🛂🚳🚰🛅🚸🚳🚷☣⬆⬅↖", "Te quiero😍😍😍", "Que asco 🤢", "🤢🤢🤢🤢", "que carajos con el videoclip pero la musica está buena :3", "El que no conoce a dios con cualquier barbón se persina..."]