["Me encanta la música de Bad Bunny el mejos", "listening to this to keep me awake as i study for my last exam!! <33 Love them ^^", "Esta canxion me gusta mucho. Muy realistic pero me caga el que menciona cosas de Dios \"Messiah\"!! Eso no es para canciones. Lo entiendo pero no sr juega con eso.", "., mm op", "Y ya me ha pasao", "Y ya me ah pasao", "La evolución de Bad bunny en la música es grande. Se ganó mi admiración", "No le veo mucho arte, a esta música, poco entendible, y muy publicitada, impulsada con dinero pero vacia", "Oigan este mixeo de Bad Bunny https://youtu.be/wOGH3QD0WcE", "XD?", "Muy chido el tonito y todo pero nada de lo que dicen tiene sentido jajaja", "La canción es hermosa\nla voz de Rosalía es increíble", "Se debería de casar con Rosalía", "Se debería de casar con Rosalía", "Shout out to her uni browl", "💔", "❤❤❤❤❤😁😙🐽2022", "🤩🤩🤩🤩 esta cansion le ciero poner ami nobia", "Mi rola fav", "😿😿💔", "REDUNDATION SONG", "Enfócate en ti, en tu proyecto y en tu paz mental desde RD seguiré trabajando duro para algún día colaborar contigo de corazón ♥️🙏❤️Dios bendiga a todos aquí espero de su gran apoyo en La Unión esta la fuerza ❤️🙏", "Estáis. Genial", "pobre rauw. le quitaron a su novia jiji", "La española de hace famoso con el conejo", "Rosalía 🥵😈", "¿Cómo puede gustarles este tipo de música? Escucho los comentarios que hay romanticismo, buena letra, buen dúo. Cada vez de mal en peor esta generación que no sabe escuchar música y escucha pelotudeces.", "I'm 4 months into learning Spanish. The way your guys' language moves me before even understanding is incredible. Falling more and more in love with every word I learn. Go Rosalía & Bad Bunny!", "ya me a pasao no esta ami lado\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n.", "😍😍", "Amo esta canción", "vui quá ta ơi", "Cống hiến hơn nữa trong sự nghiệp của mình. Một lần nữa cảm ơn Đức Phúc và chương trình đã mang đến những giây phút thư giãn này. Mãi yêu!!!❤❤❤", "🤩😇🙏", "Esta niña no puede hacer altos en su voz, porque no Sabe cantar.... q mala", "Por qué Rosalía se parece a Frida kalo?", "2023🎇", "A alguien se le parece frida Halo Rosalía?", "😍 His painted nails 💅", "Es Frida jaja no cantan nada productivo puro culeteooo que vergüenza", "1.Hermosa eleccion Kissss.Uno de mejor ❤️\n2. elecciones  9.5/10 \n3. culturales )l 9.3/10\n.\n\n.\n''Son unos de los mejores conciertos''.", "Me gusta mucho la letras del nuevo Reggaeton.  🎼🎶🎵🔊", "hii", "Buena canción ❤🔥", "Solo veo esta casion porque bad bonny esta pero......... la rosalia con esas ejas el diablo", "Demasia me encanta 🥰", "La mejor musica q e' ecuchado", "And as it is appointed unto men once to die, but after this the judgment: (Hebrews 9:27)\nAnd the times of this ignorance God winked at; but now commandeth all men every where to repent: (Acts 17:30)\nFor godly sorrow worketh repentance to salvation not to be repented of: but the sorrow of the world worketh death. (2 Corinthians 7:10)\nI tell you, Nay: but, except ye repent, ye shall all likewise perish. (Luke 13:5)\nFor whosoever shall call upon the name of the Lord shall be saved. (Romans 10:13)", "Excelente cantante es el mejor yo digo que el canta mejor que el tal anuel AA", "#6ix9ine #rosalia", "Mas que la letra o la instrumentación. El arte visual esta buenardo. 🧐", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "A rauw no me gusta esto 🌚", "Y desde acá los shippeo..", "Las cejas de rosalia ayudsa", ":)", "Raw Alejandro viendo esto: 👁️👄👁️", "💎💎💎💎💎💎💎", "💘 hermosa la canción", "😁😇😥", "Abril 2022", "rasalia es novia🤔", "Se parece a Frida Kahlo", "❤️❤️❤️❤️❤️❤️", "Cuando creían que estaba con Bad Bunny y Alfinal estaba con raw all so🤡🤡", "💖💖💖💖💖💖💖💖💖💖💖❤️❤️❤️❤️❤️❤️❤️", "🤑🤑🤑🤑🤑🔥🔥🔥🔥🔥🔥🔥", "🥰🥰🥰🥰🥰🥰🥰💯💯💯💯💯💯💯💯🔥🔥🔥🔥🔥🔥🔥🔥🔥", "Cuando Rosalía era god", "✨✨✨", "Venezuela torturada es patio trasero de Rusia almacén comercial de China y una nueva Cuba gracias a alcahuetes como uds", "Me dejaste el corazon frio-invierno ... Ya me ha pasao que me han ilusionao..ya me ha pasao que me han abandonao...🥲\ny que levante la mano quien ya paso esto y aun seguimos aqui con vida....y seguimos adelante...💪🥰", "Dime mami esa noche quien la borraaaaaa 👽", "AjT_T", "Kmn", "La única canción que me gusta del cejas", "Que cancion mas mala. Suenan como 2 gatos pillados.", "Bad bonny canta horrible... cielo santo, bendito youtube por recomendarme esta canción casi me rompe el tímpano😩😥", "🥵🥵🥵💋💋💋💋💍💄🩳👙🎤🔦", "Rosalía i Bad Bunny son mis ídolos sobre todo Bad Bunny que es mi ídolo", "❤️🇲🇽😞", "Mejor Que la cancion De yailin y anuel AA", "👏👏👏👏👏😎😎😎😎👻👻👻👻🤑🤑🤑🤑😈😈😈😈😈😈🏍️❤️❤️❤️❤️🥰🥰🥰", "Bad bunni por siempre comches........", "Yo que pense que terminarian juntos y no se dio :c", "sigamos disfrutando este temazoo y a por los 500 millones", "mucho", "y la amo", "lo amo", "Raw ta bien con ella pero bad bunny le dio la noche de anoche 😂😝", "😘", "La neta eran bonita pareja 💋", "Lo bueno de los comentarios es q sales con 800 bendiciones y 100 años de buena suerte 🤡🤡", "❤️❤️❤️❤️❤️❤️❤️❤️", "Te amo BabyDaddy", "Caca Lirical", "Creo que esta canción representa una relación rota entre dos amantes, que siguen adelante con su vida, pero que todavía arden cada vez que se encuentran y pasan las noches juntos. Demasiado para estar juntos, demasiado poco para ser nada.", "Pinche cancion espectacular", "Ya culero la canción 2022", "Uy contacto", "MUCHA BURRERA ....... ¨FAMOSOS¨  0  TALENTO....", "Quien 2022 🇵🇷🇩🇴🇨🇴🇩🇴🇵🇷", "Quien escuchandola en el 2022", "Estos  dos cantan  horrible", "Bad bonny ase buenas musicas", "✨admiro mucho tu música , Mi sueño es vivir de la música como tu y algún día grabar con grandes artistas.🇩🇴He trabajado pase lo que pasa para lograrlo y confío en Dios que tarde o temprano mi sueño se hará realidad. ♥️", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "Es fuego", "🐮", "Elegante", "hora dile que cea tu ex y se ven y si no dile que cea tu ex plis  o que cecase contigo qeu al de es tas op xionos", "vacboni pídele divorsio note deges eres fuerte. si no se casó contigo 💔💔❤️. con fiaen mi ya es tas feliz", "No puedo creer que me guste este señor si antes lo odiaba. Las hipocresías del amor 🤣", "Rosalía pierde mucho cantando con estos", "¿Vas al Cielo? \nhttps://youtu.be/FJIei76njqg", "Porq le hicieron esas cejas a la chiquilla?", "Goals: your video has no 👎, 🤩", "Manooo, não dá \nEu casaria fácil com o Bad Bunny😍😍\nQue homem perfeito Deeeus♥️", "Yo extrañando al ex que claramente no tengo", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "Esta Musica nos conecta con una chica muy especial q hoy en dia no somos nada por q el tiempo y el destino nos separo y espero q el mismo tiempo nos reuna hoy recibi una llamada de ella q decia veamonos y eso me puso muy Feliz esta MUSICA ENTRE NOSOTROA NUNCA PERDIO SU ENCANTO ..👽😋😋😎😅🤩", "👍👍👍", "I gotta learn Spanish so I can not only groove, but know what my brothers and sisters across the water are talking about in all the dope songs on my playlist. 🤦🏾‍♂️🤷🏾‍♂️✌🏾🙏🏾", "me encanta la escucho todo los dias", "Que hermoso mi hombre ❤", "WTF MUSICA PARA GENTE NACA😚💅🏻", "gg\ngg", "Salió de lo mejor esa canción, Gracias por sacarla Amigo Bad Y Rosalía suena bien", "ME GUSTA ESA MUSICA", "dime papi", "te amo", "Jajajaj al flow", "Mae mía si yo fuera el Raw no podría ver este video, que sensualidad.....", "I think Tainy.\nThank you for reminding\nIG that Ibeyi was Sadhguru's \nShiva and PArvati]\nAre not Josephine and Benito.", "baro", "Most powerful song & duo performance. Just wow!", "unete ami grupo de operador digo que sii", "temazoo benito", "Ay pero que lindos se ven juntos!", "Diễn vậy mà cũng diễn được", "1:34", "Love you 🥰", "23:23 -Hermosa elección- 4.Fo/Hotlove\n\n10:10 Hopi: ″Sweeter″\n11:12 Sun: ″Hotter″\n00:18 Toonie: ″Cooler″\n18:00 Yoongy: ″Butter″\n23:23 /Son unos de los mejores conciertos ☬/", "Hay thật sự, cảm ơn Đức Phúc mang cho mình dòng cảm xúc này!", "ಥ_ಥ", "Chúc cho Đức Thật nhiều sức khỏe.", "Vaya mierda musica y no saben hablar", "LOVE Spanish People So Much ❤❤❤", "Están cantando después de ir al dentista? Parece que tienen una papa en la boca", "LA MEJOR CANCION DE BAD BUNNY JUNTO A LA REINA ROSALÍA", "Una noche de amor y pasión... q nunca se olvidará❤️💔", "isieron un video vien grasioso de esta cancion", "crap music", "eres el mejor", "Chúc anh luôn sức khỏe và hát cho chúng em nghe nhé", "Pa mi ex", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "Buen tema pa las chikillas", "La única canción bonita de la cejona de la Rosalía", "Me gusta que esta cancion no tenga ni un dislike.", "Ufffff este es un temazoooooo", "VLAD x DIANA - LA NOCHE DE ANOCHE (Video Oficial) #Vlad #Diana #ElÚltimoTourDelMundo Vlad", "RAUW ALEJANDRO x LUNAY x NIO GARCIA x JAY WHEELER x FEID x BAD BUNNY x J BALVIN x DALEX x PAOPAO x LA GABI x VILLANO ANTILLANO x ARIA VEGA x CAMI DA BABY x ROSALÍA - LA NOCHE DE ANOCHE (Video Oficial) #RauwAlejandro #Lunay #NioGarcia Rauw Alejandro", "The heights of Rosalia with the lows and the deepness of Bad Bunny, bye, i'm dying! It's sounds sooooooo gOOOOOOD!", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "27:23:53:52 esta parte esta chida", "For godly sorrow worketh repentance to salvation not to be repented of: but the sorrow of the world worketh death. (2 Corinthians 7:10)\nThe Lord is not slack concerning his promise, as some men count slackness; but is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance. (2 Peter 3:9)\nAnd the times of this ignorance God winked at; but now commandeth all men every where to repent: (Acts 17:30)", "Aquí no Brasil, La Rosaria faz A festa, Boas vibrações 🇧🇷", "Te acordas victor ? 2021 San Francisco?", "Ya estamos 3 de abrir, el nuevo álbum por favor :\"v", "Siempre vuelvo a esta canción solo para recordar cuando Rosalía hacia buena música.", "Jfjfjejudichql de lsk", "😔", "https://youtu.be/9WYbBKyRds0", "1B- z", "Espero que el próximo lanzamiento sea de un puente 👍", "Un día como hoy paso Algo que yo no puedo olvidar 😏😝Que ya me a pasado como 3 cuando estoy cerca de él su nombre es Ronald", "Buenas tardes! Alguien sabe a que se refiere Rosalía diciendo hookeado como si fuera tote? Graaacias!", "Si juntos imperio trató niña sería ideal y palacio para ti todo tendrias eres mi rey perfecto 🥰🥰👑💘💘🐰🐰", "https://youtu.be/SRt0KAMCI4Q  . ..", "Rosalia!!!❤️❤️❤️❤️", "ME ENCANTA ESTA CANCION", "Unbeso", "Un besi", "Un besi", "C😗😗😗😗😗😗😗😗😗", "Esta fue la última gran canción de rosalía, ahora canta pura mierda.", "Rosalía mi amor mi vida mi todo pero i esas uñas Jajajaja pero lo que sí me encantó fue la cansion", "🤮🤮🤮", "💔", "@🇱@Ny@ວົງຄຳສານເຊກະໝານໃຕ້ແຂວງອັດຕະປື,ສ,ສ,ປ,ລ,ລາວ🇱🤩🤔🤩😇😇😜🤔🤩😁💮😁😄😔💮😂😄😑😚😚😚😂🥳😶🥳😑🥳😐😭🤫😅😅🤣🤣😑🌺😅🌺😅🌺😅🌺🌺😑🇱🙆🙆🙅🤷🏾‍♀", "Hace un año y sigo escuchando el tema,buen tema", "Wow llevo un largo tiempo sin ella\npero todavía aún sigo pensando\nen la noche de anoche", "Bad bunny y rosali parecen hermanos", "por que la rosalia parece frida kahlo?", "Eyyyyy", "temazoo benito", "Si escucharás a este tío sin el auto-tune otro gallo cantaría hoy día cualquiera se hace cantante👻🤦", "sejotas", "A", "Literally can’t speak Spanish, but listen to Bad Bunny frequently", "las cejas XD", "Activó bendiciones brother 💯⚾😇", "QUE TALENTOOOO EL DE ROSALIAAAA HAGAN MAS MUSICA JUNTOS POR FAVOR", "https://youtu.be/yIn6wZ58voE", "Me encantas porque posando somos únicos 🐰🐰🐰💘🔥🔥🔥", "👑👑👑🥰🥰🥰😇😇♥️💙imperio sino es todo pues lo que sea pero te adoro ,me encanta tu picardía ♥️💘🔥🔥", "A veces me da satisfacción que  la gente que habita hoy el planeta tenga lo que merece, está será la generación basura, que consumía basura, hecha de basura.", "💔", "Es cierto o no que lo de anoche anoche fue respondanme😎😎", "Esta canción  nunca pasará de moda", "Very good", "Uf....", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "hola guapo", "Siga la música de requero", "Lo salva la voz de la gallega", "Rosalia uff 😍😍😍😍😍😍😍🥰🥰", "😍😍😍😍😍XD", "Hola bella  20201", "😭", "Sinceramente la ROSALÍA es bien hermosa,,, esa carita,,,", "Hubiera deseado ver el beso", "♥", "ando un imperio\r\nEso' ojito' tienen un misterio\r\nPero al final na' 'e lo nuestro fue en serio\r\n\r\n[Pre-Coro: Bad Bunny]\r\nY ya me ha pasa'o que me han ilusiona'o\r\nY ya me ha pasa'o que me han abandona'o\r\nY ya me ha pasa'o que no está' a mi la'o\r\nY ya me ha pasa'o\r\n\r\n[Coro: Bad Bunny & ROSALÍA]\r\nPorque la noche de anoche fue (Eh-eh)\r\nAlgo que yo no puedo explicar (Eh-eh)\r\nEso era dando y dándole sin parar (Eh-eh)\r\nTú encima de mí, yo encima de ti (Oh-oh)\r\nPorque la noche de anoche fue (Eh-eh)\r\nAlgo que yo no puedo explicar (Eh-eh)\r\nEso era dando y dándole sin parar (Eh-eh)\r\nYo encima de ti, tú encima de mí (Oh-oh)\r\n\r\n[Verso 2: ROSALÍA]\r\nQue yo me iría otra vez pa' Japón (Hey)\r\nPapi, qué penita tú, qué maldición (Mmm)\r\nLa paleta es dulce, azúcar de algodón (Yeh)\r\nY es la única que me llega hasta al corazón\r\nYo no me olvido, la suerte está echada (Bum)\r\nSe me enredaba el pelo en la pantalla\r\nSabe' que solo lo hago de leyenda (¡Wuh!)\r\nLo subo al cielo, yo soy su Messiah\r\nEl Benito es un diablillo y es un ángel\r\nLo tengo juquea'o como si fuera tote\r\nBaby, entre nosotro' nunca competimos\r\nSi preguntan dice: \"Ella to' los récords bate\"\r\n\r\n[Pre-Coro: ROSALÍA]\r\nY ya me ha pasa'o que me han ilusiona'o\r\nY ya me ha pasa'o que me han abandona'o\r\nY ya me ha pasa'o que no está' a mi la'o\r\nY ya me ha pasa'o\r\n\r\n[Coro: Bad Bunny & ROSALÍA, Bad Bunny]\r\nPorque la noche de anoche fue (Eh-eh)\r\nAlgo que yo no puedo explicar (Eh-eh)\r\n (Eh-eh)\r\nTú encima de mí, yo encima de ti (Oh-oh)\r\nPorque la noche de anoche fue (Eh-eh)\r\nAlgo que yo no puedo explicar (Eh-eh)\r\nEso era dando, dándole sin parar (Eh-eh)\r\nTú encima de mí, yo encima de ti (Oh-oh)\r\n\r\n[Outro: ROSALÍA]\r\nMmm-jum\r\nMmm-jum\r\nMmm-jum", "Buena música.", "Me encanta tu voz", "Como se supera esta canción?", "Mi sueño es llegar a 100k de subscriptores me ayudas ♥️", "Rosalia and the weeknd, blinding lights? God awful. Absolutely horrific. \n\nRosalia and Bad Bunny? Best song ever heard. Sky high.\n\nAnd you expect anyone to respect your opinion? You're less than absolutely nothing. Laughable.\n\n\nRosalía y The Weeknd, Blinding Lights? Dios mio, espantoso. Absolutamente horrible.\n\n Rosalía y Bad Bunny? La mejor canción jamás escuchada. Cielo alto. ¿Y esperas que alguien respete tu opinión? Eres menos que absolutamente nada. Cómico.", "Ya te consientan o si no te consientan o si princesa 😍 y te 5and may God continue to bless the family, welcome to my life, amen, and continue to bless it and", "yaaa ☹️", "Vengo del futuro y no, ellos no son pareja como muchos creímos con este video 😪😪", "Esta canción i justo make me callo shorty AND cudle AND say sorry babe", "Muy bonita canción por parte de los dos, Excelente talento.", "This song bless my soul😇❤️🙏", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "Me dejaste el corazón frío invierno", "Rosalía sin sentido como siempre xd", "I Love You Bad Bunny My Boy And That Other  Person Too You sang Beautiful I’m just Here for El Manlo Conejo 420 & & Cheers Everybody", "En una peda inició lo nuestro y en una peda murió lo nuestro.💔✨", "que bonita muisca bad prrr", "*escucho todas las canciones de Bab bunny*.\nyo: TEMAZO\njkasja si soyy", "Ok", "Lo más lindo es que así van arder cuando venga el atrevimiento 😍👌", "hm", "💃🥇🏆🙏🏼😍😎", "https://youtu.be/btgfZhPyBds", "💙🤍❤️💙🤍", "Espero otro tema juntos 🔥🔥", "💔🤕", "Raul Alejandro viendo esto: 👁️👄👁️", "💕💕👍", "la rosalia y bab bunny se ven tan bonitos juntos", "26/03/22\n17 años nunca tuve novia \nApenas di mi primer beso y soy re virgen xd\n\nAndo bien enculado de una pelada y nada cuando salgo a una confrat ( fiesta) siempre me acuerdo de ella pero aún no me le declaró\nSólo quiero dejar este mensaje entre tantas :) volveré en el futuro algún día 🤙🏻", "La noche fue y será ❤😎", "Lo mejor❤", "🌻🤩😘", "es buena pareja eh rosalia y bad bunny", "Mi historia 😭", "I’m from Detroit where Frida Kahlo and her husband Diego Ramirez influenced our art and culture so much. Rosalía reminds of the beautiful, artistic, prosperous and independent Frida. This song reminds me of the love she shared with Diego Ramirez.", "Top", "💔💔💔💔💔💔😓😓😓💔💔😓😭😭😭😭😭😭😭", "Iloveyou", "SAOKO PAPI SAOKO", "Esa vos del conejo malo me ha dado unas ganas de vomitar es como el mal aliento en la mañana que sacó", "I’m Totally in love with this song", "Aquí estamos", "soy yo o tiene mucha seja la rosalia xd", "Rosa lía ❤ 🖤 🤍 💚", "Bad Bunny x Rosalía - La Noche De Anoche [Official Video]", "Soifeliz.llorando", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "Brasil te amaaa! 💚💚💚", "VOLVÍO PAULO LPM :') 🇦🇷🇦🇷", "Por que no hace nada el que graba AYUDENLOOOOOOOOOOOOOOOOOO!", "Muy Buenos 😝😘", "rosalia con esas cejas tiene cara de hombre xd", "On", "Eya y babony casi se besan siii", "Babony el mejor parami un 1.00000 de un 1.00000", "U", "Extrañamente está es la única canción de Bad bunny a la que le entiendo la letra.", "sigamos disfrutando este temazoo", "Disfrutando tus canciones ❤❤😍", "Primera vez viendo esto.. como no lo habia visto hahaah buenisímo BadBunny tumbale el negocio a Balvin", "Me encanta Bad Bunny", "La letra de Rosalia no tiene ni puto sentido!!!", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "Cuando aún se le entendía a Rosalia lo que cantaba!! 😑😑", "Hey qqqqq", "Rosalía 😌", "Hola🥰🥰😊😊🥺🥺😭😭😱😱", "They need to make more music together ❤️‍🔥❤️‍🔥", "El palo más grande de la Rosalía sin duda con el Bad Bunny🔥🔥🔥🔥🔥🇵🇷💪🏼", "la única canción donde tiene logica lo que habla Rosalía", "95,900 comentarios\nBad Bunny nunca pasa de moda\n😮‍💨", "Igual igual💔", "🔂🔂🔂🔂🔂", "Rosalía, solo espero que hayas despedido al maquillador que te hizo esas cejas por Dios!!!", "Rosalia canta bien feo", "Rosalía se parece a Bad buny pero en su versión mujer, no solo por su estilo musical si no por su aspecto físico...", "Yolanda daré\nZoser\n\nEryñosare", "NicoL", "NicoL 10", "Te amo benitoo!", "1:08 la mejor parte empieza🤪🥰🥰🥰😍", "I still ship them…", "Bad Bunny tu patron", "Reporten los que quieren a benito y a rosa juntos", "Aquí los que escuchan esta canción el 19 de marzo.", "Hay yo si voy a ir me porque no no ya no aguanto😂", "Una porquería de canción", "NIKI RAPROE", "👁️🌌🌌💯🎤🎼🎼🎼🎼🎼🎼🎼🎼🌌🌌🌌🌌🌌🌌🌌🌌🌌💸💸💸💸💸💸💸💸💸💸💸💸💸💸💸💸💸", "This is so imbalanced .....the female character is chasing after the male per usual", "u ain't lying", "INCREÍBLE ♡♡", "💔", "🖤🥲", "Quen mas cree que bad bunny y rosalia se gustaban 😪\nY hacia mejor pareja con bad bunny que con rauwl", "Ay ke rikeraaaa", "Puta ... q mierda de música", "❤️❤️❤️❤️❤️", "👉 https://youtu.be/FyJFw69eIk8", "de tus canciones mi querido ilumina ti, fiel sirviente del señor oscuro y ayudante de los reptilianos y mas teorías de conspiración esta es de las mejores.", "🥺🥺🥺🥺😻😻😻😻😻😻😻😻", "Mi canción favorita en el universo", "Yo sé que esto no volverá a pasar\nPero si volviera a pasar\nSé que sería tu debilidad\n\nPorque la noche de anoche fue (-ue)\nAlgo que yo no puedo explicar\nSola, dando y dándole sin parar (-rar)\nTú me decías que morías por mí\n\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nEso era dando y dándole sin parar\nTú encima de mí, yo encima de ti (oh oh)\nEh, eh\n\nTú me dejaste el cuerpo caliente, infierno\nPero me dejaste el corazón frío, invierno\nSoñando que contigo es que duermo (duermo)\nDime, papi\nDime, mami\n¿Esa noche quién la borra?\nTú me besaste y se me cayó la gorra\nSin mucha labia, sin mucha cotorra\nCuando estoy contigo dejo que la vibra corra\nY que la luna nos supervise\nCon esa boquita suena rico todo lo que tú me dices\nHicimos poses que yo más nunca hice\nTú te mojaste pa que yo me bautice\nY me ponga serio, serio\nTú y yo juntos creando un imperio\nEsos ojitos tienen un misterio\nPero al final nada de lo nuestro fue en serio\n\nY ya me ha pasao que me han ilusionao\nY ya me ha pasao que me han abandonao\nY ya me ha pasao que no estás a mi lao\nY ya me ha pasao\n\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nEso era dando y dándole sin parar (eh eh)\nTú encima de mí, yo encima de ti (oh oh)\n\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nSola, dando y dándole sin parar (eh eh)\nYo encima de ti, tú encima de mí (oh oh)\n\nQue yo me iría otra vez pa Japón (hey)\nPapi, qué penita tú, qué maldición (mmm)\nLa paleta es dulce, azúcar de algodón (yeh)\nY es la única que me llega hasta al corazón\nYo no me olvido, la suerte está echada (bum)\nSe me enredaba el pelo en la pantalla\nSabes que solo lo hago de leyenda (¡wuh!)\nLo subo al cielo, yo soy su messiah\nEl benito es un diablillo, ella es un ángel\nLo tengo juqueao como si fuera tote\nBaby, entre nosotros nunca competimos\nSi preguntan dice, \"ella todos los récords bate\"\n\nY ya me ha pasao que me han ilusionao\nY ya me ha pasao que me han abandonao\nY ya me ha pasao que no estás a mi lao\nY ya me ha pasao\n\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nEso era dando y dándole sin parar (eh eh)\nTú encima de mí, yo encima de ti (oh oh)\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nEso era dando, dándole sin parar (eh eh)\nTú encima de mí, yo encima de ti (oh oh)\n\nMmm jum\nMmm\nMmm, jum\n\n... ♡ ...", "💔Dreamin about u💫........", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "😍😍😍esvonita  la prensa", "Hola bad. Bunny", "Automática mente yo y mi corazón yo 😭😭😭😭 mi corazón 💔💔💔💔", "Dura dura!", "🥰🥰🥰🥰🥰🥰", "Escucha esto!😳\nhttps://youtu.be/wHOFramVAs0", "🤝🔥", "Mi religión 🛐", "🌹🌹🌹🌹🌹 I ❤ IOVE YOU BAD BUNNY!!! 🔥🔥🔥🔥", "❤️", "pacman", "Repegadiza esa canción,como olvidarla xD", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "Quien escuchándola hoy 18 de marzo , Dios los bendiga", "Listo", "Re fieroooo el temaaa un asco", "Grata 😃", "Y ya me apasao", "Pero Rosalía  arréglate  esas ejas dios.   mio q grandes", "1:57 ahora entiendo xq el Bad viajaría hasta Yonaguni ✈️", "Algo que no poder espilcal", "Está rola va por los 500 míllones 💔🔥", "Las letras de este hombre son como el vino, mientras más tiempo pasa, más buena están. Jugando en las grandes ligas el Biza, rap del real 🤙🏻", "Admiro su trabajo, Mi sueño es vivir de la música como ustedes  trabajo de 7am a 8pm y invierto mi dinero a la música y algún día grabar con grandes artistas, he trabajado pase lo que pase por lograrlo y confio en Dios que tarde o temprano mi sueño será realidad, mientras tanto te felicito y yo seguiré luchando  🙌🏻", "❤️❤️❤️❤️❤️ MEGUSTA LA MUSICA", "Alguien más vino por Strange de Alex Mirez \nCuando Nolan lo canta por Mack y Ax\nAjajjajajaja", "13:55 Hermosa elección  XTINDER.Uno _de los mejores conciertos_  \n\n13:23 Senada: ''Hermoso''\n13:23 Megan: ''Hotter''\n13:23 Hopi: ''Sweeter''\n13:23 Joonie: ''Cooler''\n13:23 Yoongi: ''Butter''\n13:23 Amor: ''Momentos''\n13:23 Alfiora: ''Preety''\n13:23 Alana: ''Awesome''  \n\n21:55 Son unos de los mejores conciertos, no puede ir pero de tan solo verlos desde pantalla, se que estuvo sorprendente.\n\n00:04", "Bmomo Buyuy x Buscar Buscar FIGURÓ Ft Nche BeyeyeyG  eyeyeyeyeyen Dyyyyyyeeeeee Nuyuy monito \nFranco y Don Quijote", "💋💋😘💋💋😘😘😘💋", "Espero con ansias la version en sspañol", "teamo", "siempre que oygo esta musica  me enamoro mas pero bad bunny tu eres el prinsipal eres mi compositor numuro 1", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "Bad Bunny la rosalia esta tiernaaaaa", "Pretty", "Me encanta 🥰", "The like finger sequently part because emery chemically shave with a vivacious particle. exultant, silky llama", "Rosalia canta bien feo.", "Bad. Bunni", "Rosalía. Linda. Bad. Voni", "a por los 500 millones", "LOS AMOOOOOOOOOOOOOO", "Vos te servis de ella,     me enoja, pero la fama es fama", "BAD BUNNY Es de DIOS\r\nYa Lo Veras", "¡Mi Gente Linda, Mi Gente Bella! Nuevo VÍDEO 😀vayan a verlo 🎼\nhttps://youtu.be/CF90IJHhZzc", "Frida kahlo 👍🥃🎶🎵", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "Pinche tema bien culero 😖", "Kom maar", "Ve nomás que mierda componen ahora pinchis canciones hablan como niños xhikiaros bien poéticas las letras  no mames el que compuso está mierda no ha escuchado jazz clásico rock", "La música se empezó a degradar desque que murió Javier Solis", "🖤", "Hermosa Rosalía con ese look de Frida Khalo", "Esto es mierda pura, TODOS ESTAN ENFERMOS ¡¡¡¡", "😍", "Bad bunny, agradezco que tus canciones estén en muchas fases de mi vida, esta canción me hace recordar algo Majestuoso que viví. Dios te bendiga, conejo.", "Llevo 3 años haciendo música mi sueño es vivir de ella, trabajo de 7 a.m. A 7p.m., y el dinero que me gano lo invierto en la música. Me estoy forzando demasiado y con Dios todo se cumplirá 🙌", "Marzo 2022", "BUENO", "🚨ÚLTIMOS DÍAS🚨 ¡Estamos REGALANDO dos boletos para ir al concierto de Bad Bunny en Monterrey, México! Les dejamos el link de nuestra página web para que puedan participar... GIVEAWAY https://kaffeedehigo.com/brrr/", "ethereal", "The needless relation superficially welcome because substance focally stay round a expensive tray. joyous, fine yacht", "The bloody europe hisologically hammer because supply electronmicroscopically end toward a productive british. sassy, ratty fifth", "Ya me a pasado.... ⚘💔", "pero al final na' de lo nuestro fue enserio :(", "https://www.youtube.com/watch?v=GZtwThmUMt0 \"Cura\" Es un tema de reggaeton romantico dedicada a todas esas chicas que son muy especial en la vida de una persona, aquellas chicas que con solo una sonrisa pueden cambiarlo todo,", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "Claudia Hilario", "Himno mundial", "🇲🇽🇲🇽🇲🇽🇲🇽👍", "Un regalito de un tema de badbunny 🐇👁que no han escuchau \n\nhttps://youtu.be/zyZJZ4VgaoI", "Mmm", "Wuespa", "🔥💔", "🐰🐰🐰🐰🐇🐇🐇 este tema no lo supero", "Yo sé que esto no volverá a pasar\nPero si volviera a pasar\nSé que sería tu debilidad\n\nPorque la noche de anoche fue (-ue)\nAlgo que yo no puedo explicar\nSola, dando y dándole sin parar (-rar)\nTú me decías que morías por mí\n\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nEso era dando y dándole sin parar\nTú encima de mí, yo encima de ti (oh oh)\nEh, eh\n\nTú me dejaste el cuerpo caliente, infierno\nPero me dejaste el corazón frío, invierno\nSoñando que contigo es que duermo (duermo)\nDime, papi\nDime, mami\n¿Esa noche quién la borra?\nTú me besaste y se me cayó la gorra\nSin mucha labia, sin mucha cotorra\nCuando estoy contigo dejo que la vibra corra\nY que la luna nos supervise\nCon esa boquita suena rico todo lo que tú me dices\nHicimos poses que yo más nunca hice\nTú te mojaste pa que yo me bautice\nY me ponga serio, serio\nTú y yo juntos creando un imperio\nEsos ojitos tienen un misterio\nPero al final nada de lo nuestro fue en serio\n\nY ya me ha pasao que me han ilusionao\nY ya me ha pasao que me han abandonao\nY ya me ha pasao que no estás a mi lao\nY ya me ha pasao\n\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nEso era dando y dándole sin parar (eh eh)\nTú encima de mí, yo encima de ti (oh oh)\n\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nSola, dando y dándole sin parar (eh eh)\nYo encima de ti, tú encima de mí (oh oh)\n\nQue yo me iría otra vez pa Japón (hey)\nPapi, qué penita tú, qué maldición (mmm)\nLa paleta es dulce, azúcar de algodón (yeh)\nY es la única que me llega hasta al corazón\nYo no me olvido, la suerte está echada (bum)\nSe me enredaba el pelo en la pantalla\nSabes que solo lo hago de leyenda (¡wuh!)\nLo subo al cielo, yo soy su messiah\nEl benito es un diablillo, ella es un ángel\nLo tengo juqueao como si fuera tote\nBaby, entre nosotros nunca competimos\nSi preguntan dice, \"ella todos los récords bate\"\n\nY ya me ha pasao que me han ilusionao\nY ya me ha pasao que me han abandonao\nY ya me ha pasao que no estás a mi lao\nY ya me ha pasao\n\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nEso era dando y dándole sin parar (eh eh)\nTú encima de mí, yo encima de ti (oh oh)\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nEso era dando, dándole sin parar (eh eh)\nTú encima de mí, yo encima de ti (oh oh)\n\nMmm jum\nMmm\nMmm, jum", "¹1¹¹¹\n1b", "Yo decía que hacía basura de música pero  a la vez  te hace extrañar a alguien que ni has conocido respeto", "Un año después me doy cuenta que existe está canción 👀", "💔", "The obsolete passenger conspicuously trot because aluminium quantitatively travel failing a little sentence. efficient, ugliest umbrella", "Bad Bunny ya tiene 38 millones", "que turbia canción pero esta chida", "recomendado Men Without Hats - The Safety Dance HQ (Music Video) (1982) - YouTube", "temazoo leyenda", "Estilista a Rosalía : cuanta ceja quieres\nRosalía : si", "From india❤❤🇮🇳🇮🇳", "ya me pasao", "Bad Buni te amo", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "😂😂😂😂😂", "🇪🇨Oriana", "https://youtu.be/0SkxBtPXH_U esta también está buena de Isabela Merced❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️es una combinación de Becky G x Camila Cabello", "Lindo video y linda música, sus voces magitral, la letra un poquito fuertecita, pero en general me encantó el dúo", "bad", "💔💔", "Temazo", "I can't speak Spanish but have listened to so many of Rosalia's songs! 🤩🤩", "Y soy niño", "Me encanta todas tus casionea", ":))!!", "💜", "Magui", "Alguien en 2022?", "Rojo Siempre", "❤️‍🩹", "Es la primera vez que veo el video y me doy cuenta porque se estan prendiendo fuego 😂😂", "2022", "0:41 la mejor parte", "Tengo 33 años y veo como la rompen estos niños", "Jjj", "Dj", "Mentira", "Que fea rosalia", "Exelente", "Que canción más fofa", "ntan dice ella to´ los recors bate", "Me gusta muchísimo esta canción 😍😍🥰", "A mi mamá le gusta esa canción", "La canción hermosa 😍", "esta es mi cancion favorta de Bad bunny  saludos desde republica Dominicana  la mejor cancion de mi vida  teamo con todo mi corazon Bad bunny", "exelente cancion Bad bunny eres el mejor", "Still the best song since 2021 Feb 15th.", "Yo amo España🇪🇸❤️🌹", "https://youtu.be/C49Ndiinles", "This is how you know bad bunny is a narcissist. He picked a girl that looks exactly like him 😂 good song tho", "https://youtu.be/SRt0KAMCI4Q", "❤️🥰Rosalia🎤😍  +Bad Bunny 🎼Linda canción 🎧 escuchando 20/03/22 Miami 🇺🇸❤️-🇬🇹🤍", "3:08 Ese momento hubiera sido EPIQUISIMO ♥♥", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "F", "Rompé", "https://youtube.com/channel/UCBxCyfuLx2xEdVkPd13sDUg", "It's all about twin flames ✨", "Duele 😞", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "No me canso de escucharla😁", "himno mundial", "Que buenas cejas d AZOTADOR..Yyupiiiii...esa  cejas le hicieron cosquillas en la cotorra..de bad", "Está chida la canción que nostalgia 😢❤️", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "GG muchachos nos rompieron todo incluyendo el corazón, R por que nunca me valoras", "Sabes que solo lo hago de leyenda.. ❤️‍🔥", "Rosalia,soy tu más grande fan,te adoro y te amo😍😍😍😍😍😚😚😚😚😚✌✌✌👏👏👏👏👏👏👏👏👏👏👏👍", "EXPLICAL??....... paso palabra", "💔💔💔", "Yo y ela", "💔💔", "2022 e yo aqui", "Meus bebés", "🤦‍♂️💔", "La letra💓\n\nYo sé que esto no volverá a pasar\nPero si volviera a pasar\nSé que sería tu debilidad\n\nPorque la noche de anoche fue (-ue)\nAlgo que yo no puedo explicar\nSola, dando y dándole sin parar (-rar)\nTú me decías que morías por mí\n\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nEso era dando y dándole sin parar\nTú encima de mí, yo encima de ti (oh oh)\nEh, eh\n\nTú me dejaste el cuerpo caliente, infierno\nPero me dejaste el corazón frío, invierno\nSoñando que contigo es que duermo (duermo)\nDime, papi\nDime, mami\n¿Esa noche quién la borra?\nTú me besaste y se me cayó la gorra\nSin mucha labia, sin mucha cotorra\nCuando estoy contigo dejo que la vibra corra\nY que la luna nos supervise\nCon esa boquita suena rico todo lo que tú me dices\nHicimos poses que yo más nunca hice\nTú te mojaste pa que yo me bautice\nY me ponga serio, serio\nTú y yo juntos creando un imperio\nEsos ojitos tienen un misterio\nPero al final nada de lo nuestro fue en serio\n\nY ya me ha pasao que me han ilusionao\nY ya me ha pasao que me han abandonao\nY ya me ha pasao que no estás a mi lao\nY ya me ha pasao\n\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nEso era dando y dándole sin parar (eh eh)\nTú encima de mí, yo encima de ti (oh oh)\n\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nSola, dando y dándole sin parar (eh eh)\nYo encima de ti, tú encima de mí (oh oh)\n\nQue yo me iría otra vez pa Japón (hey)\nPapi, qué penita tú, qué maldición (mmm)\nLa paleta es dulce, azúcar de algodón (yeh)\nY es la única que me llega hasta al corazón\nYo no me olvido, la suerte está echada (bum)\nSe me enredaba el pelo en la pantalla\nSabes que solo lo hago de leyenda (¡wuh!)\nLo subo al cielo, yo soy su messiah\nEl benito es un diablillo, ella es un ángel\nLo tengo juqueao como si fuera tote\nBaby, entre nosotros nunca competimos\nSi preguntan dice, \"ella todos los récords bate\"\n\nY ya me ha pasao que me han ilusionao\nY ya me ha pasao que me han abandonao\nY ya me ha pasao que no estás a mi lao\nY ya me ha pasao\n\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nEso era dando y dándole sin parar (eh eh)\nTú encima de mí, yo encima de ti (oh oh)\nPorque la noche de anoche fue (eh eh)\nAlgo que yo no puedo explicar (eh eh)\nEso era dando, dándole sin parar (eh eh)\nTú encima de mí, yo encima de ti (oh oh)\n\nMmm jum", "why don't they kiss... what's the point thn doing a video with BB", "La tocaya se mi amiga Rosalinda", "Im no", "💔💔💔💔💔", "uwu", "R", "la Música del joven exitoso Bad Bunny es pegadiza un tanto no mucho y con buen sonido editado pero igual no me gusta por razones que a otros tampoco les gusta. Ah.. y en los comentarios en su gran mayoría veo adolescentes y jóvenes. Eso me dice muchas cosas de la generación futura por la música. Psdta:  Aia", "Quien 2022 como yo 🧸💎👑", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "0:48 himno total", "disfrutemos este temazoo y vamos a por los 500 millones", "ur song are amazing", "Ya yo me imagino cantando esta cancion a todo pulmon 🍅", "meencanta", "Wey es tu hermana? 😶", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "pana, me acorde de la de paillaco 😭😭", "💔", "bab me saludas ya casi es mi cumple y es mi sueño plis me llamo Dayanara", "SE SUPONE Q ES UNA CANCION?", "El raw alejandro viendo esto:hoy duerme en el patio", "vamos a por los 500 millones de este temazoo", "te llega al corazon", "mi ex me la dedico ayer :C", "aber cojan", "Oigan, quien la maquillo :s jajaja", "Finding your soulmate must be a beautiful feeling", "La mejor pareja😍\nMe pregunto xq no estan juntos:((", "Les vengo a hacer una encuesta pa ustedes cuales son 5 canciones favoritas del conejo malo denjelo aqui? \n1.??\n2.??\n3.??\n4.??\n5.?? \n\nAmi me gustan todas pero cuales son sus preferencias comenten....", "Quien sigue escuchando este temon \n👉👈💥", "Pobre Rauw Xd", "ERES UN DURO DEPARTE DOMINICANO TE QUIERO BAD BUNNY 😘😘😘", "😭", "Serían una buena pareja", "🔥 🔥 🔥 🔥", "Bar bonny™", "😧😳", "😂😂", "Estoy muy sad😔😔🥺🤧", "Todo me recuerda a ella 💔😔", "Esooooo", "Rosalía tiene el mismo estilo de cantar que bad bunny, encajan bien, en la expresión de los labios.", "✨SOLO VENGO POR STRANGE ✨", "😭😭😭😭😭😭😭😭😭😭", "Explical ? vocaliza nene", "bad bunny, que vrg te pasa a ti, que no nos diste entradas para tu concierto :( mi novia esta triste por eso. cuando vengas a guatemala lo primero que vas a encontrar sera una verguiada asi que piensalo antes de venir. que tengas un buen dia :)", "Éxitos conejo malo sigue pa lante bendiciones papá 🙏🙏🤗🤗", "que desperdicio de talento de Rosalía con este tipo que ni sabe cantar vaya tono monotono e insipido.. en fin.. Rosalia tiene sufiente nivel de artista y sabe cantar no como este turro.", "On dirai just rihad !! 😭😭😭", "WOWWWWWWWWWWWWWWWWWWW AMEEEEEE 🤕🤕🤕🤕", "Que porquería jaaaaaaaaa", "No me gusta rrosalia es una buena uana copiona le copiaba akarol G", "¹¹", "los amooooooo0ooooooooooo", "Bad buny deberias mejor la actuación no te mueves mucho, la rosalía si le da enpeño :v", "Nos mintieron y la música del 14😔😔😔😂", "Esta Rosalia es un desastre,ha destropeado La cancion y hay tantas muy Buenas cantanteas🤦🏼‍♀️", "Y que opinas sobre esta?\nhttps://youtu.be/9uaX6nWOz6Q\nSeria un honor ver tu comentario ahí", "Mostra 😽😽🤗 Rosalía", "❤️", "0:41 que tierna te ves mi niña rosaliaa😍", "yo aquí llorando por mi ex q nunca tuve 😢😢 xd", "d", "Omg Daddy Bunny 😍🐰", "https://youtu.be/ZhIsAZO5gl0", "Cuando la Rosalía no cantaba mamadas", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "El matias cunado le deja su novia de roblox", "¡Estamos REGALANDO dos boletos para ir al concierto de Bad Bunny en Monterrey, México! Les dejamos el link de nuestra página web para que puedan participar... faltan pocos días para que acabe el GIVEAWAY https://kaffeedehigo.com/brrr/", "😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "No me gustan sus cejas, se parece a Frida Khalo", "Pregunte les si leen la Biblia", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "He sounds slow 👎🏼", "Makes sense that people now listen to this garbage! The public is dumbed down so much that they believe this garbage is music 👎🏼👎🏼👎🏼🤢", "hola", "💏🛏📞vzv", "la neta canta muy feo musica de hoy vale madre   musica como vicente fernadez  esa si es musica no estas babosadas", "que temardo", "https://youtube.com/shorts/se4laErD6eM?feature=share\n\nNo ver", "Pero al final na'a de nosostros fue enserio 😔", "🥰🥰🥰🥰🥰 Eslo mejor", "Esto es mejor que bts quien no ama a bag bonny esto es mejor", "Que Bien cantas con la Tia Buena de Rosalia 🎁📱", "So this https://youtu.be/dYtbK7hbfRw is what happened", "Alguien 2022?", "Con los amigos de #Achila  Lalay \"Por ti Guambrita\" junto a #EcuadorLlaktaKilla #carnaval2022 Saludos cordiales..                                                        https://www.youtube.com/watch?app=desktop&v=e0YwrLwf2uc", "Gegee i pensar que todas estas rolas las escuche en un juego llamado avakim i aora soy adicto aeste estilo de musica :) super abiente que se arma con este estilo de musica nn", "🤗", "The Spanish Drake, making us miss an ex you don’t have 😂", "😭😭😭😭", "it's crazy how many people come back to this everyday. this song is legendary", "“Tú y yo juntos creando un imperio* \nAl final me tocó a mí sólo terminar de construirlo.", "A perfect colaboration", "Zoe", "porque la noche de anoche", "Jh", "Jh", "chido", "Rosalia Human torch ......", "BAD BUNNY, ROSALÍA.. algún día grabaré con ustedes, ese es mi gran sueño.. voy a luchar y esforzarme al máximo.. por poder cumplirlo..!!", "💔Hola", "Can't understand a single word but love it 💫", "🔥🔥🔥", "Que cantan estos..rs una barbaridad si que molesta 🤔🤔🤔", "Voisi", "Bad bunny espero que puedas hacer otro video con la Rosalía", "https://youtu.be/SRt0KAMCI4Q  .", "Una conmigo CONEJO MALO una COLABORACIÓN  ...", "Una conmigo CONEJO MALO una COLABORACIÓN  ...", "Una conmigo CONEJO MALO una COLABORACIÓN  ...", "Jenn Jenn you giving Me A Smile that could Never End. Life Was Worth Fighting For. I've stood by your side through thick and thin. Soulmates I really thought.  We have changed.. still I'm In Love With You Bb.", "Pura mierda esta musica", "😭 X100Pre Serás Ésa Hermosa Casualidad Que Llegó Ami Vida E Creí De Nuevo En El Amor Y Nada De Lo Que Sentí Y Del Apoyo Que Hice Y Di Me Arrepiento Te Amo UN CHINGÓ RECUÉRDALO Por Siempre Las Noches Son Frias🙇🏻‍♂️ Te Extraño Mucho Cuando Dormíamos Abrazaditos o De Cucharita Y Nos Calentabamos o En Mi Pecho Recostadas Tu Cabeza y Tú Beso En La Frente 🥲 Te Amo Mucho Mi Chaparrita Preciosa 🥺😭 Cuídate Mi Dulce De Vainilla 😚🥰😋🤤 Mi Ojotes Preciosos", "Cuando estoy contigo dejó que la vibra corra🙂", "Me encanta este tema muy duro. Muchas letras y sentimiento,  bad Bunny, y Rosalía. Los mejores.💪👑💯💯😎🎤", "Mi conejo mi bad bunny 🐰🐰🐰🐰🐰🐰🐇🐇🐇 me diran lo que quieran pero lo amoooo"]