["Are u a noob scape step?", "Me crying when no \"YOu SeE I uSeD f5\"", "Cringe", "The reason they have things to escape is because it is meant", "i already play genshin best game ever", "But then, I had a very good idea, I used F5. You see, using F5 gave me a whole new perspective and I was able to see a chest I couldn't have seen before.", "You know what's funny is that I used that same boat trick and one of the same songs in my video THREE months ago:\nhttps://www.youtube.com/watch?v=ZC2hEL0EB4Y&t=607s\n\nEdit: Go near the end to watch me use the trick.", "yk to trap a warden you can literally just surround it with rails", "Just... break the netherite blocks", "Can't wait for that one guy to make a video roasting this \"prison escape\"\n\n(In a good way both videos are entertaining)", "RLC I exec crypto small token supply Partnered with Ibm, Intel Amazon, Microsoft, Nivida! Selling Idle computer power for Fortune 500 companies small cap small token supply can skyrocket at any time...", "TEDDY HAS BOATS DUMMY HE CAN GET OUT", "4:45  or you could just throw some iron into the pressure plate to activate it idk or the shears or something else", "\"But then I used F5, F5 GIVES ME A WHOLE NEW PERSPECTIVE OF IEXSMSKKDJXJXNXM\"", "Though I bet this was scripted it doesn't make it a bad video ya know", "Wait morning love you guys do have a fireplace right you know the mad well that thing where you can do now you can cook the chicken of the fireplace so do that but you need flint and steel tooth", "you could have saved a peace of wood ha ha noob", "watch this new gamming channel https://www.youtube.com/channel/UCuUYPcLJCHxoE_yBkN2RrQQ/videos", "s in the chart", "Wait he didn’t know the camp fire trick wow", "Oh shit its genshin impact", "Anything is possible. Like SeaWattgaming  getting a gf", "Wait couldn’t you have saved blocks by placing one plank and also couldn’t “teddy” get the boat himself", "you should have done this with wifies, he has some experience", "Nice! however at the beginning, couldn't you have just used the snowball on the item frame instead of blowing up", "For whosoever shall call upon the name of the Lord shall be saved. (Romans 10:13)\nKnow ye not that the unrighteous shall not inherit the kingdom of God? Be not deceived: neither fornicators, nor idolaters, nor adulterers, nor effeminate, nor abusers of themselves with mankind, Nor thieves, nor covetous, nor drunkards, nor revilers, nor extortioners, shall inherit the kingdom of God. (1 Corinthians 6:9-10)\nI tell you, Nay: but, except ye repent, ye shall all likewise perish. (Luke 13:5)", "🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️😰🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🅰️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️👿🌶️😰🌶️😰🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🤥🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️🌶️😂😂🌶️🌶️", "chess in mineraft im really good at chess\n\\", "Staged", "But then i Got a good idea i used f5", "producer: How fake do you want this to be? Him: yes", "You didn't know how campfires worked lol", "Weren’t you exposed?", "Yum yum yum", "high iq", "d", "why could he not just break the pumpkin and craft it into seeds", "I'm gonna have to find a way to open the netherite door Me: Break it", "5:09\nThere is a fonction call jump that allow you to keep that extra piece of wood.\nAnd also, campfire cook food\n\nStarting to think it's scripted :(", "So your saying this is impossible to escape, but you escaped?", "Hello kenadian someone is here with something worse. Legit sea watt it’s easy. Your just using new techqniques you found on tik Tok. You ignore the obvious answer. In the first 40 seconds. Teddy may crouch and jump at a timing to get the boat then boat out", "Do u guys even know what \"prison\"  means? 💀", "Gayshit", "Simply piano chord", "W", "My sister has Genshin Impact but she does not play it", "9:57 HOW DID YOU NOT KNOW THAT!?!?!?", "Ooooh we w", "5:10 “I was forced to use my two wooden blocks”\n\n*conserving resources go brrrr*\n\n\n\n\n(totally not kenadian reference)", "you see f5 gives me a hole ne-..", "You now Evbo right?", "You make amazing videos :).", "I know what to do you get the snow and throw on the fireplace and heat the chicken to get cooked but the think is there was no shovel", "SeaWatt: I asked Tedey \"calmly\" to help me\nAlso SeaWatt: TEDDY HELP", "So it's not impossible", "my fav character from genshin inpcact is arataki", "A", "9:53 man doesn’t even know what a campfire does bc all he does is escape prisons", "He has a boat on his head", "\"prison\"", "Who heard L theme in 13:57", "can next on be panda or evbo prison????????????????", "Teddy is a cute name🤭🤭", "one day he will say,  the police put me in prison and he took revenge", "what your doing is not a prison but an escape room", "9:47 burning snowball", "999IQ have been unlocked", "And that's when I had a great idea. I used f5. you see using f5 you get a whole new perspective and I could have got the wood a lot quicker", "Hi", "I wish I could play this map :D", "Could’ve saved your wooden block", "All his escape rooms are sooo fake he could save so much resources but he dosent", "i dont know why they say it was impossible to escape that they biult \nand still like yeah a couple of item wont be hurt too much", "#weneedaf5merch", "12:49 Bf5#!!", "Him: This prison is impossible\nAlso him:*Escapes *", "That's the power of teamwork 💪 👏", "I hate how he said he can't pick up the snowball  like bro use he hand", "but I have another idea, I used f5\n\n\nalso this isn't a prison and more like an escape room, fix ur video titles", "GENSHIN IMPACT LOOKS COOL BUT I HAVE TO SIGN IN MY PASSWORD TO DOWNLOAD IT BUT I DONT KNOW WHATS MY PASSWORD :(", "Kinda dumb he used 2 wood planks to break out considering he can jump.", "Yep that was awsseom", "Soo coool", "i mean teddy could of just dropped the seeds on the pressure plate tho...", "1: you can break netherite blocks 2: you can jump then log out then log in again then jump after jumping 2 blocks 3: CONSERVE RESOURCES 4: if You didn’t spawn in the warden you could have just died than respawned outside 4: didn’t you say you this was impossible? 5: so who is white because they set white to 3 year old who has only played a few matches. There are so many more ways to solve these issues it’s annoying.", "it's like SAW", "14:17 imagine that drop was 49 blocks😂", "But I thought it was impossible…", "Give me ur eye", "Bruh you said you heard a piston move but one problem is that pistons can not move bedrock\n\n\n\n\nYou broke a minecraft rule xD", "the fact of how fake these tho", "Teamwork💪", "It's kind of weird how the screen went black for the second", "can you just stop making this stupid videos T_T", "Wait 3:21 couldn’t you just snowball the item frame?🤔", "genchine is one of my favorite games i have", "that warden prison looks insane though no cap", "With 4 planks at the start you could have made a slab and shifted out of there.\n\nEdit:If the walls isn't two blocks wide you could of have used the boat to get out.\n\n\nEdit 2: Couldn't you have just used 1 block to get up?", "IT'S POSSIBLE IF YOU DIDN'T BEAT IT IT'S HAS IMPOSSIBLE NOT POSSIBLE OH MY GOD STOP BEING A", "Calmly", "time for kenadian to debunk this", "Wow dud wow 😀", "imagine a hopper inside a hopper inside a hopper inside a hopper inside a hopper inside a hopper inside a hopper inside a hopper", "This must be fake he use two blocks of wood when he could have use on and jumped up instead of using two unless… he’s dumb", "So first off he didn't need to use both his wood to get up, wasting a block, second he could have grabbed the item frames, third I'm pretty sure if you pick up a campfire then place it back down it goes lights again. Correct me if I'm wrong.", "all these prison videos are fake... you say its impossible but EVERY time you beat it. it feels like you script these", "How can I try to pass this challenge", "Bro that was way over 12 block drop and the boat didn't break", "200İQ prison 👏👏👏 that's how the teamwork works >;3", "6:16 is where the genshin impact ad is done", "5:13 well couldn't you have just, oh I dont know...\nUSED ONLY 1 BLOCK TO GET UP THERE?!\nSAVE. YOUR. RESOUCRES!!!", "Vibes to the L theam", "So fake", "5:15 but you didn't need to use both logs... the wall was only two blocks high...", "the whole block thing could've been avoided if you just used 1 plank, or went back to collect it after accidentally placing the last one", "but by pressing f5-", "fake escape prison\n\n\n\nCRINGE", "The prison really does look hard to escape", "Genshit", "he could have thrown an item on the preasure plate LOL", "Bruh cant you just break the netherite blocks", "You can tell this is fake at 5:11 because he used two wood planks instead of one which is almost as if he knew he wouldn't need it but ah what the heck", "4:09 bruh just hide under the stairs", "i know these prison videos are fake but hey atleast its entertaining", "10:29 don’t question it", "GENSHIN IMPACT IS SUCH A SIMP", "CLICKBATE", "5:12 He could just use 1 block", "13:41 song name?", "Fake", "This is like a portal puzzles", "5:10 you could have just used 1 wood plank", "literally couldve just dropped a block on the pressure plate instead of taking a long time to get the chicken in the hole", "Not even a real prison,has everything you need to escape.", "fake", "13:28 whats the song", "4:03 Ah yes *Calmly*", "i wish they stop saying IMPOSSINLE even though it is always possible-", "It would've been an awesome plot twist if the last drop to freedom was 49 blocks and they both died lol", "ئئ", "Could made slabs to get out at start and would of had one extra wood and extra planks", "But then I had a very good idea.\nI used F5. \nSee, using F5 allows me to have a whole new perspective that allows me to see a chest that I could have never seen before.", "Fake and Linking a scam\nWhat a joke", "You should do a prison with a randomizer boost every minute", "why is your kbps is soo low", "MAKE BLOCKS TO GET OUT GAMING", "Hey @SeaWattgaming can u upload the world?", "evry one knows u can cook with a campfire lol", "i saw the boat on his thing nob", "Yooo! Sup seaWatt, i saw you like when you were hm.... i think 455K? i think\n742K!", "When u built up from the lava escape by teddy u could of only used 1 block", "Why don’t you just ask the prison warden", "Seawatt: kalmly explained\nalso seawatt: TEDDY HURRY UP IM GONNA DIEEEEEEE", "This is gonna\nOh nevermind\nI thought they will never escape lol", "3:30, shouldn’t you just could’ve hit the item frame with the snowball instead :l", "boat is master key. you can escape this just by putting the boat on a wall.", "escape room*", "Nice! however at the beginning, couldn't you have just used the snowball on the item frame instead of blowing up", "My man didn’t have to have the tnt he could have just thrown the snowball at the item frame", "\"my friends trapped me\"", "no one like GENSHIN IMPACT", "You take the items sometimes and don't sometimes, this clearly shows that you adlrdy know about these prisons and their solutions", "why did the 2 clay balls got me?", "Fake", "5:08 why the heck 2 blocks?", "Teddy is my dogs name", "SeaWattgaming to smart with teddy", "0:26 \nBut then i had an idea. i used F5, you see using F5 gave me a whole new pre-", "How to make an ACTUAL inescapable prison \n\n1. Make a box out of bedrock\n\n2. Prison", "LMFAO Its so fake 😂", "Ah yes I do not see the boat", "UR AMAZING SEAAAAAA  :)))))))) :333333333333", "How do u play genshin impact?", "you could have just hit the item frame with the snowball", "D", "you can use items to activate presure plates", "Fake but fun to watch", "“And I very calmly explained to teddy lava was above me”\n\n\n\n\n\n\n*TEDDY HELPPP THERES LAVA GO QUICK!!!!!*", "The game is nothing like that as I have it it’s better", "One of Minecraft’s dumbest escapists", "There is a place called heaven and hell. Heaven is a beautiful place we can go after we die, but hell is a place of endless suffering to punish people who have sinned sin, anything we think, say, or do that breaks Gods law, but Father God loved us all, and didn’t want us to parish so he sent his Son, Jesus Christ, and died on the cross for us and whoever excepts him into their heart and believes he rose the 3rd day will be saved from sin and live forever with him in heaven.\n\nEven a man who has killed many people, commited 1,000,000+ sins, if that man accepts Jesus Christ as his Lord and Savior he would be saved and be in heaven.\n\nPraise Jesus; glory to the Lord! Repent of your sin, anything you think say or do that breaks God’s commandments, and accept Jesus Christ, the son of God, as you’re personal Lord and Savior or face the wrath of God and burn in hell for eternity!", "worst ive ever seen they both have blocks in second room but they waste em and dont use them", "SOME MUCH OBVIOUS SOLUTIONS!!!!!!!", "wth the first like 3 minutes of the video aren't even needed if you are able to get the blocks on the side that are above you than teddy is to :/", "This is the best prison escape ever, keep up the good work!!", "Fake", "10:06 - break the campfire and place it back again, it lights the fire", "12:31 You could've used the redstone torch...", "secret word : Hey! wake up...", "1:33 He could've saved his friend by jumping off the ledge, placing the boat on his friend's side, and getting in the boat to safely make it across. But good video still!", "seawatt \nyou could have saved that one wooden plank if u just jumped up so u could escape on 9:04", "can everyone start calling them escape rooms because if the builders built a way out and gave you every item you need its an escape room not a prison, prisons are supposed to keep you in not give you the items to escape. also is no one going to talk about how the boat flew at the end i dont mean when it was falling i mean the very end when it started floating up?", "This so fake lol", "Ever heard of lava boat jumping", "Prison? I think it's an escape room.", ",,Entirely Bedrock''\n**MEANWHILE HE BEATS THE PRSION FOR THE 50TH TIME**", "Imagine if that warden prison started to chase them", "Fake 🤡", "im subscribed", "You didn't have to use both planks. Try to think next time.", "why did the boat jump at the end of the video? lol", "Cool but if the prison dont give any tools and items u cnt escape", "Thats a Escape Room Not a prison", "What rating in chess do you have", "If you really play minecraft you would know that netherite,dispenser,dropper are vreakable. You could break the first netherite block so your friend don't have to rush a chicken part, You must break erery block posible it might become usefull in next room, byt at the end of the day you still can escape from that ugly prison", "_Teamwork power_", "Dumbfuck its an escape room not a prison, +it is staged smh", "Kenidion we need a debunk", "but then I had a very good idea, I used f5 see using f5 I gained a whole new perspective I give up", "11:43 \"found a hopper inside of this hopper\"", "why not ask them to make a 4 player prison?", "6:15 sponsor end.", "@kenadian", "This is how power of teamwork works", "Using iron make shear. And shear the pumkin to get seeds and lure the chicken to free seawatt", "I very calmly explained to teddy that lava was falling.\n\nAlso him: Teddy HeLp iM GoNnA DiE\n\n3:57", "Aww man i cant download genshin impacttt", "bruh lol imagine making fake videos", "Why is see genshin impact everywhere", "4:02 loved the harry potter reference said calmly", "Is this fake ? Pls tell i am dying to know", "no hate but I debunked it with my friend", "It's funny cuz Kenadian did a debunk on you but he helped built the maze:p", "you forgot the vilager  subscribe", "Bro u gonna get debunk u should get the sign and didnt waste the 1 wooden plank", "\"found a hopper inside of a hopper\"\nSeaWattGaming Apr 25, 2022.", "You can Just snowball the itemframe (3:10)... and you can Just use one Wood to go up (5:09) and then you can Just drop the one Wood instead of the shovel (6:21)...", "That's the entire fucking point of a campfire??\nTo cook food!!", "bruh just throw one pumpkin seeds to the activator it will activite", "Imagine making fake Minecraft videos for YouTube", "The part that they get to see eachother is I think it is a reference from moon Knight episode 4", "I love how he said:There was a feature that if you click on the campfire while holding the chicken it will place on the corner and be cooked", "#botw better than genshin impact", "You said it’s impossible but you did it So it’s not impossible But it would be possible but it wouldn’t so it’s possible if you’re smart", "It’s not surprising because some YouTubers like you Wouldn’t even know this existed until now.(That’s was about the food in campfire)", "https://youtu.be/C3eqZw-Rly8 how to break bedrock", "Wouldn’t the boat come out the item frame when you hit it with a snowball?", "*Prison Facts* or *Prison Rooms* not Impossible minecraft prisons", "Also food cooks 3 seconds faster with a soul campfire, because it’s hotter.", "Did you realize that with the lava pouring down on the first room, the entry way is where he could have just crouched to avoid being burned?", "1:06\nInstead of took a long time to get item from item frame, just use f3+b and then position the mouse on item frame's hitbox\n\nEdit: Why this comment is getting likes so quickly?", "This triggers me you can use 1 block for 2 blocks high", "6:32 Yeah You Can Move Bedrock With Pistons :/", "Hmmm…The title of the video seems contradictory to the contents of the video.", "Imagine if the final fall in the boat was 49 blocks", "Uhh why didnt you use the lava to climb the wall you wasted the wood", "As a content creator myself.. I can really appreciate the amount of work you put into your videos!! Respect dude!! 👊🔥", "Seawatt: I told him very calmly...\nSeawatt 2 seconds later: TEDDY HELP HELP IM GONNA DIE HELP!", "Y'all have 1million iq", "wow. throws the snowball at the tnt not directly at the boat so he could collect the tnt", "Why is it so blurry I can barely see anything", "Where did that lava source come from!?!?!??!??!?", "Rfsed", "imagine not being subbed to seawatt\n\nimagine", "Kenadian", "People: JUST BREAK THE (@*#&# NETHERITE BLOCK!!\nThe script for entertainment: i feel useless...", "bro at 5:09 you could have saved one of those wood blocks???????????????????????????????", "You can just throw a snowball at the item frame and the item will pop out", "idrc its staged", "Yoooooo this is cool", "Thats not a prison its a escape room", "Regały that's scary", "thing's he could have done better:\n\njust throw an item frame at the pressure plate 4:25\n\ncould just use 1 wood 5:06", "bruh you got exposed by a YouTuber and you are still doing prison escapes", "It would've been funny if the boat broke at the end", "Romans 3:23 states: \"For all have sinned, and come short of the glory of God;\". We are all sinners, that have committed at least one sin in our lives, which earns us an eternal punishment in Hell. Revelation states 21:8 \"But the fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone: which is the second death.\". God sent his Son, Jesus, to Earth as a perfect sinless sacrifice. To take on all the sins of the world; both past, present, and future sins. Shedding his blood on the cross as a blood atonement for all sins. After dying on the cross, he rose from the dead on the 3rd day and rose to Heaven. To show life after death. To show everlasting life through Jesus's sacrifice. John 14:6 states: \"Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me.\". Romans 10:13 states \"For whosoever shall call upon the name of the Lord shall be saved.\". \r\n\r\n   Eternal life in heaven is just one prayer away. All you have to do is believe that Jesus Christ, the Son of God, died on the cross for your sins. As an atonement for your sins. And rose from the grave on the 3rd day. Ask Jesus to save you of your sins and give you eternal life in Heaven. Salvation is a free and everlasting gift from God. Please don't let pride drag you into eternal punishment in Hell, but ask Jesus to give you eternal life in Heaven. If you're getting a strong feeling of resistance while reading this, it's because Satan doesn't want you to get saved. He wants you to resist, and think it's not real. He wants you in Hell for all eternity with him. Hell is not a fun place, like worldly people like to imagine. It's everlasting torture with no relief. I'm only taking the time to text this, because I want to get the message out. There are so many distractions in life keeping people from witnessing to other people. Keeping you from thinking about salvation. Keeping you from thinking about life after death. Please, ask Jesus into your hearts to save you of your sins and cleanse you from all unrighteousness. Ask him for a place in Heaven, and he will save you from eternal damnation in Hell.", "Mhhh, interesting. Maybe Kanadian will debunk you again, and as far as I know, you know that he did so.\nBut I think the newer ones aren't fake, they seem more real.", "He should of get the crafting table at the start", "6:16 You guys didn't break the signs nor taking the item frames in the first room.", "YEAAA GENSHIN", "I use F5", "this is fake don't  see", "whyd u use the 2 wooden blocks to get up a 2 blocks high u could have used only 1", "U mean escape room its not a prison", "Poor ted got lied to seawatt can perfectly see a boat ted could reach but seawatt said he has nothing", "I. dont. hav.  minecraf.  so. I. watsh.   your.   vedyos😀😁", "couldnt he have just hit the item frame with the snowball?", "AHAHHAHAHAHAHHAHAHHAHHAHAHAHAHAHA the tittle is so funnny omg i cant he starts every video the same -__-", "4:43 I'm gonna be kanadian is it spelled right IDK but you could just easily pick the pumpkin and craft it to seed without waiting time\n\n5:10 you could have use just one block and you sign said just you wooden shovel is the thing to drop sooooooooooooooooo", "6:55 Who .. *happened* to be named subscribe", "Genshin impact", "Ah I can't wait for Kenadian to react to this video", "5:11 you sure you can't just use one", "Netherite can be broken with your hands. Takes a while, but not impossible", "Bruh why didn't you hit the item frame with the snow ball i would have saved resources", "When u didnt have to use both planks to get up... But still used both...", "u dont know that feature huh? i know that feature.", "One word fake", "Why do you keep on saying seemed impossible?", "i know this is all cool trivia and stuff, but you shouldn't make so many less complicated ways to do things. ofc theres F5 mode, but also the snowball and the boat. simple solution for that, put the boat on the back of the cage on ted's side instead.\nThe netherite blocks as well, those can be broken. Simple solution: replace it with some kind of unbreakable block (bedrock, barriers, etc.) decent vid though, i learned smth about chess today.", "Why didn’t you get that one wood that you used for building up by the lava?", "an escape room not a prison i mutter to myself. *CLEARS MY THROAT* I mean omg amazing prison 👍", "why did the boat float at 14:24", "lets gooo if he does more then kenadian debunk part 2 maybe", "*sponsored by genshin impact *plays nintendo music", "Fun fact this comment is pinned or harted", "How later in the level the lava poring down on seawatt  gaming was gone", "EEAS Official: Human Rights Is a Must, not Optional\r\n\r\nDominic Porter from EEAS called in to the meeting online.\r\n\r\nDominic Porter from the European External Action Service (EEAS), an agency connected with the foreign and defense ministry of the EU, also called in to the meeting online. As head of the division responsible for China, Hong Kong, Macao, Taiwan, and Mongolia, he said the EEAS is seriously concerned about the organ harvesting in China.\r\n\r\nPorter noted that the hearing attendees had heard many findings from various investigations, including disturbing allegations ranging from sexual abuse, torture, DNA testing, and illegal detention to organ harvesting in China. More and more evidence collected has shown that Falun Gong practitioners, minority ethnic groups, and faith groups in China are being persecuted in China.\r\n\r\nPorter also said that the EU strongly condemned the crime of organ harvesting in China because it is inhumane and immoral. Respect for human rights is not optional, it is a basic requirement that we should all follow, including in the field of organ donation and organ transplantation. He emphasized that human rights conditions will continue to be a focal point at multilateral forums for EU human rights actions.", "But then I pressed f5 and got a entirely different perspective…", "I feel like this was scripted, he used both pieces of wood at 5:11 while only needing to use 1 yet by coincidence it was like the builders expected that to happen.", "The snowball itself is a projectile, so it can make the boat pop out of the item frame without the tnt.", "5:11 bruh he wasted wood, he only needed 1", "Seawattgameing    cray   to   eacker", "Can you plz make a enderdragon fight Steve Alex plz", "in 5:00 couldn`t of he had trowned an item on the pressure plate", "Pretty sure you can boat clutch to the other side in the first room", "Bot bit pro cot caught", "Near the beginning I thought he should make a button and explode the tnt.", "You should do a 3 player prison!", "Fake", "Love you seawatt keep up the good work i have been wacthing your videos for months now and i cant stop watching", "But then i had an idea, Using F5 gave me a whole new perspective on things, so I could reach the chest.", "These are escape rooms. Prisons shouldn't be able to be broken out of.", "Yes great vid", "Ooh", "Thumbnail: this prison is ImpPossIBLe  \n14 min later\nand then we ride to freedom on a boat", "why is evry1 sponsored by genshin bruh", "What is the music", "The snowball with the lava is not taking fire  in the java edition", "Aren't kenadian exposed toy the other day? Is something happend that I didn't know ?", "New vid yesir", "Instead  of wasting your shove u can break the sign and throw it in it would trigger it\n\nAnd instead of using  2 wood maybe try using one???", "Sus faker", "Sus faker", "Super cool", "Need more video", "ayy kenadian made this puzzle", "I think that it would be better if it was like a real inescapable prison. You should maybe start calling them \"escape rooms\" instead?", "isn't this a rip off version of the chess prison lololololololololololololol", "another day for Kanadian to roast this guy", "What a legend seawatt keep up the excellent work \n\nVid idea do a massive mangrove tree prison with teddy again", "If you like genshin impact you are a simp", "Repent and do good deeds because the lord jesus christ is coming.", "U are bad", "1:40 Don't grab Item Frames since they might become handy later.\n1:49 It take only 4 minutes to break Netherite Block.\n5:10 Why not just use 1??", "BuT tHen I hAD a VeRy gOod ideA, I uSed F5. SeE uSinG F5 GavE mE A WhOLE nEW pERspeCTivE WhICh AlLowEd mE tO SeE A cHEst I COUldnT hAve sEEn BeFOrE", "Fake", "Can You do a potion prison?", "your fake lolololoolololloolo", "It pained me to see them waste those blocks on getting up there when they could have lit them self on fire and did the fire jump 2 blocke", "You say every priston is impssable", "3:56 \"I very calmly explained to teddy that lava was falling on me and he had to move fast\"\n\n😹😹\n\n5:06 \"I was forced to use my 2 blocks\" \n\nYou only had to use one-\n\nAnd by the way, Kenadian makes vids on how to fix your prison things tho? And even called you fake but ig that's kind of mostly how he gets it or he's fooling around? Idk", "you bad at game", "This is just time wasting you can beat this without doing some of the stuff that he did in the vid bruh", "But then I had a really good idea, I used F5, see, using F5 gave me a whole new perspective...", "Seawat: i used F5\n\nLike if you agree", "\"I used f5\"", "you forgot to say apple and rhis is basically a zelda ripp of", "Teamwork", "13:03 this is a reference to you having a very good idea", "im good at chest", "3:57 \"Very calmly\" Yes  calmly lmao...", "Bruh if you could get a would to the top of your cell, then you could just tell em to grab the boat", "I have 1 question how can that pistons pull those bedrocks????", "Just why genshin impact", "Fun fact: bedrock has a  skill on its own block", "Y’all she makes my day better and it’s also my birthday", "nice my guy", "nice", "Y’all she makes my day better and it’s also my birthday", "Idk why is there death note music at the end but its great especially i just started watching death note", "No way… a couple days ago I loved ur escape room so I made one for my friend and I kept making him some until 1 day I made it but there was a catch, I helped him get out of the prison too so it was a 2 player prison and I was hoping you would  eventually Also do a 2 player prison and YOU DID! thank you so much! Maybe do 3 players next!", "Anybody think Teddy is is a Ulta count", "You always find a way to exit random prisons and stuff. It is very cool ngl.", "I already know how chess works", "Turtle man!", "Hello. I love the Warden.", "why is so low res even at 1080p", "wow so impossible", "100% fake", "Excuse me, do you mind providing a download link to this prison? Me and my friend would love to try it out.", "S", "How did you get arrow .", "You want me to subscribe.", "How did he see all the plank.", "No evil.", "Sorry 😐.", "Hmmmm what by chances this gets debunked", "I'm still waiting for 1.19", "Bedrock we get it…", "30 minute kenadian video coming out: Seawatt, you’re DONE.", "what made me more mind blowing is that they don't know some of the feature that already been in the game since introduce.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(I know that they already know about those feature and they did that for dramatic effect, pretty convincing)", "Doni bobes you no him right?", "Most impossible prison: /ban", "Would have been awesome if the final drop with the boat was one of the drops that breaks it lol", "u should make a vid with evbo", "staged", "we can get to freedom boat brakes and they die", "My sis is good at it", "Kind djd", "Hey a have a Plush turtle  and I does sleep with it at night", "Y’all she makes my day better and it’s also my birthday", "😎🤔\nKjskjsi", "I love chickens", "NOOOOOOOOO", "Lol fake", "its so fake", "This is my favourite prison video so far yet!", "“And I very calmly explained to him that he needed to get me out of there fast.”\nMeanwhile\n“TEDDY HELP IM GONNA DIE IM GONNA DIE!", "It’s impossible because you need a friend to do it", "Love the vids", "No hate but what is the last word of the title and did he escape? \n\n\n\n\nYes, so it is possible.", "Do that chicken prison from joofy loofy video", "Y’all she makes my day better and it’s also my birthday", "When you escaped with the wood blocks you only needed 1 wood meaning you could keep 1 wood", "Some weird things. FAKE VIDEO before you disagree pls read\nat beginning if he used f5 he wouldn't have to look at all\r\nbut I guess he doesn't want to get memed ok\r\ndoesn't collect item frames\r\nnetherite door why not break it?\r\ndoesn't know how to boat glitch\r\nuses obscure mechanic\r\ndoesn't kys in lava\n\n2 block high jump uses both instead of one\r\nvillager named subscribe\r\nassumes abscure answer\r\nhas an idea that might not work and doesn't test it in single player world\r\ngoes on talking for 2 mins about nothing important\r\ndoesn't know that campfires cook food\ndoesn't break dropper near end\nthe answer to some of these things only ONE OF THEM KNOW even though it's easy\n\r\nBruh what is this clown doing", "Using F5 gives me a whole new perspective", "Again again You are cheating as a totally I mode because I saw that you guys were cheating that me you probably do the video again could there videos old video I because I don't know", "I already knew that you can put things on the campfire", "14:24 boat:ima go now", "kenadian: yes, time to get monetized", "You got your pretty dumb the door is not locked it's to You got your pretty dumb the door is not locked it's 2 doors that me and the love what very close you can clutch To go in the door that the bedrock but the 1 is open Did you not see that this is not a movie", "Hello, Seawattgaming viewers. I want to convey something to you, but this video does it perfectly. Hopefully you get it. \n\nhttps://m.youtube.com/watch?v=1XeMlU9fMCo", "I wish I had the warden 😭😭😭", "WHAT WHAT THE BOAT BREAKS WHY DID MINE NOT BREAK", "I love how SeaWatt knows how to light things on fire and activate different types of redstone contraptions, but didn't know campfires cook food", "Couldn’t u just snow ball the item frame?", "Not a long time until it gets debunked", "how did they know that crafted those items that they had to drop at 6:25", "10:35 debunk, try to break obby!", "8:05 debunk nothing you can do? You can break the dropper... how do you know there isn't a command block below it?", "5:10debunk you only needed to place 1 wood block this is fake escape", "How you said the lava is falling fast calmly but in the clip You screamed it 😂😂😂🤣🤣😂🤣😂😂🤣", "13:29 the music started of camman18", "Do a three player one", "You know what they say teamwork makes the dream work", "Why did you used 2 oak planks du build up. You needed only 1. You could use the other plank to build up with it instead of trading with the villager", "Idk why u put impossible in the title if u beat it but nice", "The beginning is the perfect moment for this quote “but then I used f5 it’s f5 I entered a new perfected allowing me to see a chest”", "Imagine making a prison this hard", "Respect to whoever makes these prisons", "Can't you just target item frames with snowballs and why waist 1 extra wood piece of I'm correct they both could have had 1 extra block", "Fun fact: water is just thick air", "Not impossible it seems", "Fun fact: you time travel every second", "Petition for more two player prisons", "We need more two player prisons", "I love these videos,keep it up!", "You were sneaking when right clicking bruh", "just break the netherite blocks how much patience do you have", "I am really good at chess!", "everytime you say the word impossible for no reason", "12:10  “we had no idea where to look and we are stuck oh nevermind”", "Just throw the snowball in the item frame and save a piece of tnt", "Bruh u can jump 2 blocks with fire aka lava and campfire", "Omg get good mythrodak could escape with out thinking", "I must be super unlucky, I was rowing off a cliff once with a boat, and I died when I hit the bottom, I was super confused. It turns out I landed at one of those numbers ._.", "The arrow can hit the hen so it is a good thing", "I honestly love this that there 2 people in a escape room. It makes it more fun for us to watch!", "wow this  was such a \"teriffiying\" build", "imagine if this was in real life\n the designer must have been like: yes we have to give the prisoners a chance to escape by working together and making their friendship stronger\nthe goverment: but we dont want to give them a chance to escape\ndesigner: denied", "I love these videos", "Just realise how hard the edeter is working", "Let's go Kenadian!", "Imagine if it was 49 blocks...", "throq seeds to prechur", "i like the death note song in the backround in the chess and grid room", "5:10 one block is enough", "technically this isnt a prison, but an escape room.", "You should do a villager prison", "Your videos are so enjoyable.", "This is awsome", "dan", "''very camly''", "do not click this https://www.youtube.com/watch?v=6Gdg2D7upGQ", "teddy casualy flying away at the end", "Fake why can Teddy not reach the item frame but sea watt can sub to mythrodak hes better", "What kind of friends lock you in a prison 😆", "im not your boss but thats a escape room", "S", "U", "B", "S", "And that's when I had a great idea. I used f5. you see using  f5 you get a whole new perspective and I could have got the wood a lot quicker", "B", "E", "noice", "Genshin impact?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nmore like ANIME IMPACT", "Another great video 👍", "Jqjqja", "Plot twist: the boat fell from one of those heights and broke", "Bruh I Knew About The Secret Of a Minecraft Java Edition That Kinda Pice Of a Cake I Think 🤔 just use big Brian It Can Helped you Out👏\n#HBA03 #HerobrineA03", "THAT'S A FUCKING ESCAPE ROOM NOT A FUCKING PRISON", "3:10 - you could just use the snowball to break the item frame, it's easier", "can we just appreciate his videos.", "Debunking:\n1: he could break the netherite blocks\n\n2: he could have stayed close to them because of the little roof to avoid the falling lava\n\n3: how convinient that the builders knew he had a shovel (that made the prison)\n\n4: he could have give his friend the bow and the arrow he traded so he could hit the target\n\n5: it would take long but he could have broke the obsidian in the room he placed the dirt to check any chests hoppers or stuff like that\n\n6: (i forgot the start) he could have used f5 instead of looking for wood\n\n7: the chat never said \"set respawn point\" and he said his friends trapped him, so he could have jumped in the lava and die to respawn out of the prison", "Now we wait, for you know who to slam on your front door", "7/10", "You are master escape", "I know how to play chess too😄", "For me genshin impact is the best", "But then i used f5 u see f5 gives me a whole new perspective and i saw a chest i could not see before", "7:34", "also ik about chess lolll sry i might be bragging", "Gayshit impact", "i knew about the campfire but very good vid!", "I cant belive he placed 2 blocks but he neded to place 1 block and wen he got to the next rom with the wather he could place the other wooden block😌", "Why do you call a puzzle room a prison", "Why dont you tell teddy that there is a boat lol\n.\n.\n.\n.\n.\n.\n.\n.\nNo brain?", "You could throw the snowball at the item frame", "Lol i LOVE genshin", "Literally a boat on teddy's bedrock box on the upside", "It’s more impossible for me because I don’t have any friends lol", "that sounded sussss in 10:29", "So it's got bedrock so they can physically not escape because that's the only way to make it impossible or throw them in the middle of the void with no way to get out that could work or strand them at the top of the nether there's nothing that they can do up there or trap them in a box with mining fatigue and a piston system that ticks off every once in a while that pushes them breaking their current focus on the item that they're looking at so that way they physically cannot break out and it can be glass so that way you can just stand there and stare at them that's how you can't get out of place because the piston keeps on moving you so that way you can never have the proper angle and if the person thinks that I'll just be smart and hit it blocked the piston is pushing me at you have a backup piston that pushes another Block in front of that one and quickly goes away whenever the first piston goes off", "this is a escape room not prison", "Seawat could of use the snow ball to break the item frame", "Oh its actually impossible to Eacape 🤪🤪🤣🤣", "I HAVE A DREAM THAT ONE-DAY MY  FAMILY WILL UNDERSTAND I WILL \r\nSUCCESS IN YOUTUBE🥺 AND I WILL MAKE THEM PROUD😉", "Idk why,but i think that 2 player prison is much more awesome", "This is for team work", "When teddy had to put the chicken in the hole he could of just threw in an item", "1:46 he just have boat on top of him nice", "Use the snow ball and throw it to the lava and it wi light up the fire place and get the chicken and then put it on the camp fire and then kook the chicken", "Ted got with u seawatt?😐😑😕", "lets go", "How do you didn't know you can cook food on a campfire!! I guess you are more like a minecraft veteran!!", "You are a faker! you can literally break the nether rite block use f3 +t", "So the tital of the vid is clickbate, alright", "nice escape and prison but it would of been like 30 second quicker to use 1 wood block to build up", "Hey man I made this and I’m not ur friend", "No pls dont break my life I have heardbest of genshin impact that can break life I think jkjkjk", "Also why does he place both of his oak planks when he could have used just one", "seawatt could have hit the item frame with the snowball instead of blowing up tnt thats close to his friend", "this isnt a prision its a escape room", "The creator of this prison also creates actualy inecapeable prisons", "14:20 the boat doesn't break to plank and stick.boat become nokia", "Fortnite is good and great", "Deja vu", "\"tHIs PRiSon iS iMpOsSiBlE\"\nProceeds to complete the escape room", "THISE IS SO FAKE", "FAKE", "good friends you have there", "Wow", "Hi", "there are just becoming escape rooms but call them as you wish", "E", "Cool", "I love your videos", "fun fact: f5 gives you a whole new perspective", "Dud IT is fake", "These prisons seem easy compared to Wifies ones", "gayshit imoact", "U could've set ur self on fire to get up :/", "I mean u could have just dropped an item on the plate but whatever works ig", "Beesechurger what are you doing herr", "30 seconds in- \"bUt ThEn I hAd A vErY gOoD iDeA, I uSeD f5 WhIcH gAvE mE a WhOlE nEw PeRsPeCtIvE\"\nhttps://www.youtube.com/watch?v=1XeMlU9fMCo", "YESSS I WAS WAITNG FOR A NEW UPLOAD", "They can just die, because they aren’t in hardcore, but if their spawn point was set , they couldn’t, but it it wasn’t, they would escape easily. Same for the rest of the prisons", "SeaWattgaming: This prison is impossible\nMe: Didn't you just clear it? lol", "What is chess opening you played the most?", "the solo prisons are better :|", "❤️❤️❤️❤️", "The sponsor is basically a rip off of zelda breath of the wild", "Bro I closed genshin and I was thinking of playing again and then BOOM THE SPONSER and it scared me", "Keep up the good work", "Honestly this was one of the coolest prisons ever, the two player idea is insane! Also I love how it’s shaped as a warden! Amazing video. Next in my watch later playlist!", "GG", "There was literal boat on top of teddy at the start", "Eyy genshin nice bro and u can play with player u need to be level 15", "Seawatt: he showed me a feature I didn't even know was in the game\n\nMe: campfire can cook irl you've been playing mc for 1 year and it only play like 1 year too or 2 (lol)", "You could have just thrown the snowball at the item frame so he could save the tnt block to use later", "You didn‘t need to use both planks to stack up, so you didn‘t need the dirt later on. Still nice vid.", "Somehow u managed to get viwes than @mythrodak, just by simply faking your video  what a sad moment to see", "Wow you can use 1 wood but you use 2 5:11", "I already know you guys will escape you guys are really smart", "Can you do an Ender dragon prison", "0:51 then i had a good idea I uesed f5 see with f5 I got a whole new perspective", "8:37 Seawatt BRUH the campfire feature was old", "The escape is fake", "Couldn't teddy have thrown an item on the weighted pressure plate instead of leading the chicken there?", "Funny Things on this video the villager was scammer", "I 😍 u", "Sick", "1:36 Converting resources go brrr 1\n (Didn't pick up the item frame)\n5:09 Converting resources go brrr 2 \n(Why use 2 oak plank?)\n6:30 Converting resources go brrr 3\n(JUST BREAK THE SIGN)\nBonus\n(U can just use the oak plank that u didn't break in 1:36 )\n12:20 Funny bonus\n(Just Bruh)", "5:18 Mmmm-mid", "het seawatttgaming i played genshin since version 1.2 im adventure rank 47", "Ur A 5 Min Craft But Minecraft", "Idk why teddy did not just throw the seed there lol😂", "Seawatt you could make a trap door then put it on the bedrock and crawl", "Let's take the moment to appreciate how much effort he puts into his content for us.", "But then i had a very good idea. I used f5. See f5 gives a whole new perspective and i saw a chest that i could have not seen🤣", "I love the game genshi impact i play it for a couple of months and love it found it beacase of a friend", "You:This Minecraft's Prison is IMPOSSIBLE You: Solves it", "My name is teddy too haha", "Then I had a very good idea, I used F5, see using F5 gave me a whole new perspective. . .", "Wait", "Omg", "Lol sooo fake", "is it just me or did the boat begin to fly at the end", "why didnt he just throw seeds on the pressure plate", "BRO U ARE SMARTER THAN EINSTEIN", "Just mine netherite! Only takes like 5 minutes", "Prisons are ment to held a prisoner while an escape room is ment to be escaped, if you call your vids escape rooms instead of prisons, it will add uniqueness than a thousand other \"prisons\" :)", "lez go", "Can't i play in phone", "Very nice video!!", "6:16 click blue writing to skip sponser"]