["Rektway when someone use hacks/admin abuse: so you have chosen death...", "My is yuzi", "Now the dragon kit has been buffed now what does it do use it", "My favourite kit is miner metal beekeeper shielded all but not lassy Davy not bad kits I hate bad kits I love best kits", "you still do damage with rocket launcher but not with a bow", "Yuzi can you gime me yes or no no is ok:)", "Yo that girl is a Percy Jackson fan", "Rektway", "It’s funny", "yuzi", "I love your videos", "Barbian because u don't have to buy it you only buy it with kills", "Aery anf yuzi bit i dont have aery", "Mine is sheep herder", "my fav is purple aery", "yuzi", "Bruh im tired of rekt way just role playing in lobby", "‌", "Are u girl or boy Idk", "i laughed at that part where u say \"because i want t be her\" fr sme reasn", "Bro rektway roast is on another level\nWay beyond\nKinda funny LOL", "my fav kit is metal detector", "I love you and bedwar", "???????? dream have 1m likes then you he speed run in minecraft but i am a noob at bed wars:(", "Crocowolf", "My fav kit is nyx mybe", "fulkan but i dont have it", "Hi", "Crocowolf", "I dont know rektway", "new players be like 3:06", "My favorite kit is sheild er cuz it got buffed to the max", "When they said your cheating so says you girrll", "Press the button? You turn into a kid, but, you touch grass. Edit: you keep your mindset", "that happened because maybe when someone hits the head with the kit dose nothing", "Rektway said to the girl why is your so bad then the girl said I'm not bad you're just cheating how is Rektway cheating when the girl is spawning stuff in like rage blade robbly balls rocket launcher how is Rektway the one cheated when she's spawning all that stuff in", "That's what I call reflection", "The shield probably has better aim then her lol", "We would never bulky u rekt way ur the best", "Its realy rare to see someone who doesn,t know about a magical sheild", "She is realy dumb for not reading the updates and doesn,t even see the logic about a magical sheikd that reflects.what she says hes bad but then hes bad he said chasing me what a loser then said touch grass he doesn,t know the point of the game your so good at making people luagh", "None:\nMe:Uno reserve?", "My fav kit is shielder", "*SIMP*", "i think i need yuzy", "REKT GET REKT", "can u help me defeat my bully?", "I don’t donate to charity cause I’m broke i have 34 dollars in my BANK ACCOUNT", "speaking about fav thing ur my fav ytuber", "my fav kit is barbarian yuzi or eldertree", "Rektway: just like demon’s mo- nah just kidding\nRektway editing: I’m not kidding", "this girl just said ur lying\neven tho u have ur kit skin", "I love he said he’s chat will say simp\n Hahaha", "4:04 but she doesn't have one", "You sussy now", "Grimm", "True The skin is fire", "Rektway if someone says time to die loser say Time to die chick monk", "Clickbaits", "and infernal shielder", "jade", "I did not know sheilder got buffed", "My fav kit is yuzi", "Bobby man", "Bobux", "shiled too", "Yuzi", "Areys", "The girl is use he's phone XD", "Also my favorite kid is the metal detector", "I love your vids I like every vid and I’m subbed keep up the good work Rektway", "Man infernal shielder op now", "LOL NOOBIE ADISON", "simp", "Lol this is abused in this video", "Lol guys everyone agree with me that stupid scam bot took the L their comment got deleted don’t fall for these they auto copy a random comment then after just use bots to get likes to be on top to scam", "Some random guy: Ur bad\nRektway: And I took that personally", "I didn’t know that kit worked with robbery balls", "my fav kit is grim and good vid you should keep it up you my fav bedwars youtuber", "Seems like she got rekt", "where is ur girl", "It’s because she damaged you with rocket because she’s aiming at the floor to use make it not work", "under 2 minutes into this video and can tell this is pain", "Rekt why are you always in a private server", "she was just a loser", "WELL I GOT 24 KILLS IN           8 MINSSSSSSSS", "Pls friend me rektway my nam: xavier125675", "account created 2022,last online 1 day ago 0 friends 5 followers thats sus if u ask me", "Sorry but you jinxed you’re self you simp", "It’s yuzi", "haha", "my fav kit is yuzi and grim", "Idk why im commenting but for real i found no damage no knockback hacker and he can normally damage me with fire enchant his name is LoLeo", "You are a paid player if u think u are nice player 1v1 i don't use robux or commands or cheats i play fair u paid player \nName: Dizoozaplays\nIf I win i want one kit \nKit: Yuzi \nIf u dare 1v1 noob if u don't accept u are a paid player u can't do anything without kit L", "I got scammed today for yuzi kit and he cheated to win \nBut ur vids are making my day a little bit better🤟🏻👍🏻", "yuzi", "You got damaged because of the AOE damage the rocket launcher produces", "In about 8mins I had 13 kills\nAlso can I 1v1 u", "simp", "Lol she is so bad", "Your kit", "Rektway is a legend", "fun fact: infernal shielder can't deflect splash damage like fireballs or the RPG when it hits the ground causing you to take damage or even fall", "The one u used cuz ur my favorite youtuber", "Fun fact:the girl is stupid to not get ind hp ;-; by wasting her time", "The kit Is working but what dosent work is an explosion from the bottom so bc the rocket launcher hit the ground it also did damage bc it isn’t a direct hit", "She disabled your kit I think", "she lost brian cells by getting brian cells", "fun fact: infernal shielder can't deflect splash damage like fireballs or the RPG when it hits the ground causing you to take damage or even fall", "Rektway is my favourite kit", "Jade kt", "simp lol", "Ayo sus \"just like demons mom\" i am kinding  i am not kinding sussssssss", "Comment if u realised that he had inf irons randomly", "hey rekt are u going to take revenge on chadmc?", "Imagine saying ugly when ur more ugly lol", "She is a  L bozo", "Rektway I watched so many of your videos at the point that I dreamed about you playing bedwars and instead of you fighting some toxic people you were doing a movie making contest.\n\nedit: That was the dream I had today. d", "someone say ur hacking?", "i don't think i touched grass before", "My fave kit is grim reaper", "i bet wizard kit will get a buff next update 100%", "I can't believe that the most trash kit got good by a buff that can reverse attacks and it's op now like snicktrix use a update useful like buff a lit that is decent and nerf a kid that's decent", "I want shielder \nkit bc my friend have aim bot plssssss give shielded kit too me my name is Tap_liu", "WHAT HAPPEND IF 2 INFERNAL SHIELDER IS REFLETING THE ATTACK", "4:39 Totally agree with Rektway👍👍", "fun fact: infernal shielder can't deflect splash damage like fireballs or the RPG when it hits the ground causing you to take damage or even fall", "My fav kit is your wearing that kit or grim", "Your not nice your toxic", "missile", "Idk why I haven't get any Heart To my comment anymore I did get before.\nAm I forgotten? While the other getting", "Does Rektway own Bounty Hunter kit?\nI wanna see he use it", "yuzy kit", "Pls roast the toxic people in your chat so they will know they were the one who cheated then they will say “  …. “ litteraly they will be embarrassed bc they use cheats but your using your own kit like they suck like punks who got left by their father but their mother will just hit them with slippers lel L for the toxic players", "Cringe", "whats ur favorite kit?", "It’s the fact that’s a paid actor for that", "The moment rektway doing a 1v1 he use his 0.0000001% of his skills 👌", "big simp", "Plot twist: them in a private server", "Infernal shilder is bugged it can't. Deflect missiles", "The thing is shielder kit is a uno reverse card kit", "Infernal shielder looks like xdemons dad", "that kit", "Simp stands for super intense minecraft player", "A", "If your the owner of the lobby you have admin commands", "HER: I hate seeing your name in the chat\n\nMe:I love seeing you die by your own weapons L", "When she say:\nGOD I HATE U\nIs she talk about GOD???", "fun fact: infernal shielder can't deflect splash damage like fireballs or the RPG when it hits the ground causing you to take damage or even fall", "I tink the shield one thats fun to trolling the tryhard", "I got 700 kills in bedwars sheeeeeesh and a I won the game", "whats ur favorite kit?", "if you guys did not now why the rageblade is named rage blade is bc its a blade that makes people rage quit", "bruh why didnt you break the bed", "my favorite kit is nyx", "I like arey And the best and favourite kit I love love is REKTWAY", "My fav is sheep and the shield kit", "Were gucci bois got me ded crying 💀💀💀", "I litterly know her She is so mean irl 😳 she is 8 lol", "thats an insult to x demons mom that boy skin thats his dad", "the only thing she needs to touch is some brain cells", "My favourite kit is buff tree", "U guys know all of this is planed because he invites the people to his private server", "My favourite is shield", "Rektqay don't say that you're a simp you're a Chad like a man", "Like demons mo- nah I am kidding(literally not kidding lol)", "Ifernel shielder", "aha somehow in a private server so real", "Finally the buff of shielder", "it reflects arrows", "69k like XD", "E", "Rektway saying why is my “rocket launcher” not working when rektway using a shield", "It's a private server so it's planned but like ur vids!", "l", "abuse", "I am better admin abus", "Am better lol", "LOL,script momento,make some legit videos L", "Rektway i really like youre content keep it up!", "can any one give me grim riper kit please ?? it will mean the world if u do i beg you. my user name is JaydenPro_321OMG", "MAKE SURE TO DONATE TO CHARITY", "Demons mom huh? 😑😑😑😑", "All these people want to win so they cheat but they use super bad commands all they have to do is set hp to inf(btw my fav kits are yuzi and elder", "UNO Reverse card in the thumbnail", "Simpway", "Finally she gained 1 braincell", "my favourite kit is yuzi", "addison is my dad name ;-;", "W", "W", "Shield boi", "This is a bio server and felt way is bad", "Rektway???????? How did you have telepearls and balloons while we only saw you buy armor like why would you cut that part out thats kinda sus \"among us emoji\" I couldnt find it", "The Good thing about rektway is he doesn't care about likes or subs", "AYO rektway is SUS In the thumbnail", "My fav kit is aery idk", "The bow in the thumbnail is so pissed off  because got reflected so the bow decided to shoot her balls", "Rektway, today is my brithday and you made my day!", "Casually in a private server", "Look at the first letters of the next words \n\nSarcasm \nIdiot \nMud\nPoop", "so she hate god?...", "Yuzi", "Trinity", "Der is one man dat has a YouTube channel end his name is dieway", "Rektway can u reveal ur face at 1m sub", "how do you get to these private servers. if they liked you then why they called you bad and ugly?", "Lol", "Bc of she said \"why are u here?\" Now i know that its your friends or... you can join people priv server", "My username is Currykechup", "CAN YOU GIVE ME BATTLEPAS", "OMG REKTWAY", "Rektway mini said you dint invite him in bedwars even you playing bedwars everyday", "It will work if it hit the sheild and if it hit the ground closer to you can damage to you not the arrows because do nothing if its hit the ground just do nothing.", "I met a worser admin abuser", "rektway chek my name shemicomb friend me because i want you to 1v1 me at my real laptop tomorow afternoon at 12:30 or 2:00", "i bet you dont heart", "Sheilder kitt", "UNO reverse card kit", "i like the infenal sheilder \nand metal detector and void regent", "im still watching this vid but i laugh when you said shes gonna go back to her mom lol also that she is mad that she has no bf lol im using my brothers laptop because they are uising my laptop hehe", "\"Robbery balls\"\nWhat?\nDid the devs change the name?", "Rekway voice  is cute", "idk", "Grim :)", "I wish I had it", "My fav kit is yuzi", "\"Just like Demons Mum!\"  🤣💀", "Rektway more like Savageway", "roblox will be seen this and he will be ban and he will not be an admin anymore", "Your one of my favorite yt", "i have a question\nwill shielder can deflect golden bow arrow?", "Builder put reverse card in it", "Im know how shielder reflect anything", "And they had 1111 Heath", "And they spawn rageblade and put my Heath to 99", "Bruh why dose eveyone I 1v1 they cheat but I win and a noob 1v1 me and they were at there base the hole time Ō_Ō", "OMG she hate god", "Sheep herder \n(I STILL CANT INSTALL ROBLOX TO PLAY BW) (BEDWARS)", "My favorite kit is yuzi and freia6", "Hi Rektway", "Yeah when I give co host I kill them they say U CHEATER I was like -_-", "Rektway I laughed when u sayed run away to ur moms house XD", "i think i met her before when i started playing bedwars", "my favorite kit is aery", "0:40 rekt why r u sus", "Banana kit", "Is cheat", "Rektways:just like demons mom\nXDemon:what did you say tp my mom!!!!", "I dont like rektway he is roasting but missile is a word", "The mines can actually kill you when you stack them and walk into them", "its yuzi", "you are heker", "Rektway u can just be toxic because this is what I tell my friend if u wanna be toxic u have to at least be good at the game", "Ok why are you not ceiling down", "He's not breaking the bed that means he's a simp", "how does someone not know about the infernal shielder buff 😂", "Rektway: haha projectile reflect go brrrrrrrrrrrr", "love ur vids keep up the amazing work", "Ay havent seen your vids for 1 years nostalgia and you are still good", "Hmmm I think he forgot to hide the inf iron in his inventory", "I thought it was rektway + xfurry not rektway + xfurry mom", "rektway can you do a stream", "y", "my name s subtotaqcr", "hey rektway i sub to you knew gimme roblox 10000 pils", "So ReAl ReKtWaY  but seriously STOP THE FAKENESS", "Crash", "everyone knows this by now but shield is now a uno reverse card-", "Vidoes", "Rektway can you do funky friday", "cheaters never win", "Simpway", "simp\n yes", "the \"worst kit\" became the \"best kit\"", "Also the girl who used admin to cheat I looked at her avatar and I thought that she was wearing a dipiar for a second also im just being honest.", "rektway", "Demons mom is my fave kit", "@rektway the girl is hitting the floor not you", "She can spawn anything", "But why you forgot a new item call bear claws", "Sorry for asking but why is your voice like gay", "Is crocowolf", "IF EVERY YTS HATE THAT KIT BEFORE AND NOW LOVE IT? IF EVERY YTS HATE THAT DONT USE IT", "My fav is INFERM jk arey but i dont have it", "Siiiiimmmmmpppp XDD", "SIMP ALL UR CHARACTERS IS GIRLS", "Demons mom is kinda fire tho 😳", "Metal detecter", "Rektway 1v1 me pls", "rektway i also donated 0.5$ to charity", "Rektway: She killed herself?\n\nAlso Rektway: LESS GO!", "Can you  make normal videos, im bored of everyone doing this stuff", "I've been figthed a 3girls and they use custom admin command to spawn a rageblade and tp me with a random guy and kill us and they talktrash to us\n\n\n\n\n\n\n\n\n\nI just wanted to say to people using admin command to win a 1v1 it's not fun at all and trashtalk isn't good", "Arey", "Addy", "simpway", "*SIMP.*", "I like turtles", "Rektway I’m asking you can u friend me and give me grim? My user is Kingdomofdr if u do it you gonna see loading that’s a display name and so can u friend me?", "my favorite kit is grim reaper \nand you are simp", "MY NAME nine_talefoxO", "MY FAV KIT IS YUZI CAN I HAVE YUZI PLS", "and simp", "My fav kit is jade and rek are you simp?", "Fact: even if you buy a lot of kits, you won’t be able to beat him cause he has skill", "I want yuzi", "The ghost hit her because shes gay and didnt hit rektway cause his not gay", "I like jade", "Aery", "Mine is yuzi kit i want it", "So, Rektway, I hope you remember me :D", "5:08 what", "Dang shielder is worth buting now XD", "Pls can I have Vulcan", "my user is janjansohapi", "I'm fav kit is your mom I'm jk it's  crocowolf kit", "Grim reaper", "its yuzi", "Awesome vid keep up the good work", "You really should have said no u at the beginning", "shieldel", "Shield", "All kits can become good kits", "my fav kit is fisher when i get ems i get diamond sword", "Yuzi", "Fav YouTuber", "Uhhhhhh bunty hunter bc best kit", "Every time I get into a video game I go outside and play in the grass or I go take my dog on a walk", "yo dieway make a apology video", "Archer", "I love how he spinned the like thing twice", "That defi looks like Demons Mo-I ment Himself too—", "I want to 1v1", "Plssssssss", "941", "ur vids are awsome i saw you in the lobby i like when you troll them with enferno sheild", "Rektway can we pls 1v1 it is my dream to 1v1 you", "we need to get this man 1M subs", "Lmao even she used hack she can’t even aim properly", "vanessa", "My favorite kit is my skill", "Grim reaper", "Yuzi", "Bro I’m almost 4th grade and I don’t know how to spell missile no one even taught me :(", "the roasts today...fire", "I love you're videos😁👍", "Grim", "Shielder and heres a brutal trap spam landmines on ur bridge instant troll", "My favorite kit is Barbarian", "Grim riper", "rektway can u give me infernal shielder kit :username thedarkbigsmoke", "0:09 \"Have you seen yourself in a mirror?\" You say that but you have headless head to hide ur real face, so shut up.", "Sheld\nAnd grim", "Hello", "\"Wow, she's a very cheating woman\"", "Yuzi", "Hi", "Hello there people", "Nice one", "My fav kit : Vanness bc he can shot more Arrow in one shot", "Barb", "My favorite kit is Vanessa", "Grim reaper", "Grim but I don't have it", "The reason you keep getting damage from rocket is that she's hitting the ground and not hitting you basically a direct hit will reflect and splash damage on the ground will damage you", "If any one says your ugly say sorry girl I’m not a mirror", "By watching this umm I learned that inferno is OP and free is bad sometime", "Rektway:So im playing bedwars and see this toxic player\n\nPrivate server: You sure this lobby is public", "", "If u use shield with static/fire, you will make kids rage", "Ayo😳", "one questoin bro", "Another day,another great video from rektway :)", "mine is all kits cause i dont have any kit", "Rektway cus you wreck your foes", "I get your name now", "My favorite kit ls yuzi", "What do you mean when this girl randomly walk up to me, YOUR IN A PRIVATE SERVER WTF", "Rektway", "Rektway", "Nfx lol", "Rektway can you add me on Roblox pls my username is Weirdmonster333", "get out of my lobby she says... UR IN A PRIVATE SERVER-", "that girl is like demons mom being bad at bedwars (jk)", "Aaaeeerrryyy", "Get real content *eats snacks*", "aaery", "That's sus dude like chill", "lol roast xdemons mum", "What a coincidence that she uses projectiles the entire game.. 😶", "I like when rektway says: we’re Gucci boys” I love it it’s like if we’re all Gucci", "I want to 1v1 you probly your gonna win but I'm gonna try:account aaaron3006 as chill", "I think shield will not deflect the bomb it deflect only bullet", "Everytime i 1v1 someone for kit they got mad that they lost they don’t give me kit", "Rektway my fav kit is grim and yuzi", "She needs to go to pre school she just bully in every school lol", "Infernal", "Addison is prob a pre teen so 12?", "is e", "Did rektway read my comment last vid i said rektway use sheilder it has a buff and he use", "Lol that girl is trashhhhhhhhh", "my fav kit is that kit too rektway and btw i like ur vids :D", "my favorite kit is my kit", "Hi", "and my favourite kit is hmm, barb", "Demon be like : Wait what did he say!", "0:26 the way Rektway says \"invite\" is in a cool accent lol!", "Yo rektway i have a video idea can you play funky friday again its been a long time", "That hair is the same hair as my friend. You calling her ugly broke my heart :( anyways I love watching you Rektway", "grim reaper but i cant buy the kit bc i dont have Robux🥺🥺😭😭", "Idk", "Simp.         Jk", "rekaway u cheated too XD", "wats ur fave kit mine is demonds mom lol jk it's yuzi", "Die way sucks", "It’s been 3 mins in doubles and I had 10 kills and at 9mins I had 19kills", "Nothing i have no kit i have no robux but when i get robux ill buy grim reaper", "I hate Builder i like barbarian", "My fav kit is yuzi", "The farmer cletus kit", "Aery", "hey rekt u are the most non-simp guy I ever saw", "You know someone is trying to be you", "Famer", "And i love your videos", "My fav kit is the grim reaper", "nice cap", "RektWay please more fnf", "My favourite is yuzi", "xdemons mom would probably be a hell dragon", "Yuzi", "Hey rektway dieway side sorry to you", "Hello I was late", "Inferno shield", "So true I was in a solos game using the kit and this guy started raging after I killed him using the kit I even explained it to him", "Yuzi but I don't have robux by to buy it", "simp", "GRIM", "GRIN", "Elder tree", "I meant the tree guy", "proway", "Love you bro keep it up love to see u post rektway", "Your mom", "I remember Sus demon and sus funky", "Love ur videos man ur not scred", "The xdimon’s mom part was sussy but the charity it’s something good", "Cap", "She is +inf noob", "Grim reaper kit", "I bought this kit rn because it’s upgrade", "A", "Rektway is no simp he is the God of being insanely good at everything!", "Idk", "6:05 but... U are a simp", "my favorite kit is yuzi", "Me fav kit is aery", "I like how \"public\" the lobby is", "It's the kit 6our using", "rektway can we 1v1?", "Yeah you teach cheaters a lesson", "arey", "My fav kit is yuzi can u please gift it to me my username is 11k_JD", "Grim", "Everyone he cheated in a 1v1 with itzhomely rektway is the real bozo", "hi", "Ive 1v1 someone like that but spammed /spawn rage_blade and /spawn emrald_inf like bruh", "My fav kit is damprea", "MY FAV KIT IS THE ONE YOUR USING I was like bruh she’s dum when she said missle", "Yo that comment is actually sus 😳😳", "Shield kit is favorite", "I think mines crocowolf probably", "It my mom lol jk it’s ares🫥 nannnnnnnnnniiiiiiiiiii", "New subscriber❤️ your videos are great", "God kit", "Miner", "REKTWAY IS A SIMP", "Void regent", "aery", "pov:2021 shielder I'm suck\npov2022 I'm op now", "Arey but I’m new I your my favorite bedwars youtuber", "Eleder tree because you get more health", "BEST SHEILD BUFF", "SIMPS BE LIKE: YEAH REKTWAY GET OUT OF HER SERVER AND JUST OBEY HER EVERY COMMAND", "Nyx", "0:39", "It's miner", "It also suck how people cheat….", "I love ur vids too", "hey rektway i  got some juicy content for you, my \" friend \" is on something high and he thinks hes a hacker and better  than all. he said he will hack you first. And i kinda need your help because hes a salty kid.(LITERRALLY). Message me back ill send you my discord link lol", "mine is yuzi and shielder", "Infernal", "my kit fav is nyx", "Simp……………………………………", "Yuzi", "Grim and Vulcan", "Yas", "Yas", "Or atleast i can play with you", "Rektway, can i have robux or kit bc i been subscriber for 2 years now🥺🥺🥺🥺", "i think the shield only reflects when its shot to you, but her aim was on the floor", "Infernal but i lost that account", "The girl: Hehehehehe it is time to cheat lol.\nMe: bro wtf he forgot to team chat i hope rektway doesn't lose.\nRektway: *uno reverse*\nThe girl: HACKER\nRektway: bruh im using this kit that has shield to deflect your shot lol.\nMe: *me realising how op the shielder is op* WOW NOW THAT IS MY FAVORITE KIT.\nEdit: i love your vids winning againts a 1v2, 1v3 and a 1v4 and also beating up a cheater", "Don’t send hate to them it might have been planned", "Gompy", "He spinned the sub thing twice lol", "You’re my favorite YouTuber", "vulcan", "Nice roast at the start", "simp", "Elder tree so I could be a whole tank", "Well my favourite is the inferno shield kit and grim reaper", "Rektway is just so good.", "That  you  have", "Arey kit", "Why does everything and everyone got to be so toxic. I wish to to a video with you.  Your my favorite bedwars YouTuber \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n😢😢😢😢😢😢😢plz", "“Gucci”\n-mr rekt", "Hold on rektway i want a yuzi kit pls im dreaming about it", "Yuzi", "Why are you being sus like funky and demon", "LOL YOU SAID WHY MY ROCKET NOT WORKING 1:55", "Mine is grim reaper and aries spears", "Sheilder", "He said at least im not the one crying \n24/7 but i do", "I think the shield on the barbarian I like them both", "L", "O", "Mine is wary", "D", "Ff", "Ok", "E", "fraya", "1:53 its because since the shield deflects any projectiles rocket launcher does splash damage too wich can give you damage but atleast she wasnt aiming at the floor otherwise you would be killed", "lol i laughed so hard when you put down the screen where it says, \"pls donate to charity\". yes i did donate to charity, thanks for the motivation rektway!", "SIMP", "Axolotl Amy is my favorite", "Are she relly that blind and not see the shield", "Reaper", "You not a simp bruh", "And I like how she says that your scared and she is lol", "simp              jk", "why was u in vip\nso you no her", "Hey rektway did you get bored of funky friday?", "Lol I like how she says that your cheating and she is xd", "Me: JUST GET THE FUCKIN BED", "Hill", "This one was so unique! I want to see more vids like this. r0Ve", "Can we just say thank you for his amazing content? ZEkz", "Demons mom hot lol", "Pyro", "Hi rektway my favorite kit is axolotl amy", "Private server \"¬\" LOL", "P", "Sim", "P", "Sim", "Using kits isn't cheating, but i think infernal shielder is a bit pay2win", "Bed", "Play bad wars but has too much editing", "Jk", "Lol u didn’t", "My fav kit is elder tree and grim reaper", "O", "Why did you tell her she will shoot you see now she is powerful", "Bro imagine faking your vids", "Infernal shielder deflects rocket launcher", "Rektway is sus to xdemon mom lol and how do I donate to charity", "pls bro you got to back to funky frday", "Ddg", "7:29 I have the same opinion", "This is the 467th comment but I was here in an hour so I consider myself early", "I love how rektway said “do you think I’d lose to a girl like you” and didn’t say “do you think I’d lose to a girl”", "si,p", "I saw her say in the chat say \"I heard star creators can cheat all they want\"", "Pro savage! 😎", "Dont call you a simp???\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyou are simp >:)", "Lol", "Simp jk man we love you", "rektway + demons mom and sucking ghost = SUS", "crocowolf aery nyx", "rektway says very sus stuff \"ima boink her from here\"", "Rektway + Tanqr = Best PVP PLAYER", "Yuzi and shielder kit", "Dude this girl have the host pannel and she is toxic to rekt that rektway get inf he doesn't have host pannel", "Rektway your the best I know your not a simp you love your comments and subs and likes and your just to cool to everyone you always win     🏆", "XD sip", "So this is what that guy meant when the WORST KIT got a buff", "Am I the only one who knows this?\n\n\nBut how did tactical crossbow not make it into luckyairdrop or atleast get a surprise or some when u get it, what is bedwars logic??????", "she said that she's not bad when she's the one cheating and still ends up dying", "Grim reaper", "I am a huge fan", "My favorite kit is grim or elder tree and my user is al_242h", "Even tho he pays them to play he makes good vids you can tell its him paying someone", "I love how he says L bozo", "The kit u used", "She was hitting the ground", "Rektway i would never call you a simp :D"]