["I hope people don't ever get to you, saying this u realize how crazy an expectation that is, but your deserve it everyone does. Peace", "big part of all of us and our childhoods. We love you pewds ❤️❤️", "Love you, bro", "3:58 a typical south Indian departmental Store 😂", "One of the best things about dude that he never takes credit for himself when he achieve..❤something. ❤ he always respect us , the audience and his team and he is always polite in all of his video. We congratulation ourselves on this achievement ..❤ more to come and everything to come", "U've already gained the right to play by ur own rules. Uve done the hard part and deserve to do whatever makes u happy and i for one love every upload😇❤️🤞😻", "everyone commenting about how long they've been watching:\nme who knew about the channels existence but didn't watch until last year (and i have no regrets apart from not watching in like 2018 so i could brag about how long i'd been subbed The FitnessGram™ Pacer Test is a multistage aerobic capacity test that progressively gets more difficult as it continues. The 20 meter pacer test will begin in 30 seconds. Line up at the start. The running speed starts slowly, but gets faster each minute after you hear this signal. [beep] A single lap should be completed each time you hear this sound. [ding] Remember to run in a straight line, and run as long as possible. The second time you fail to complete a lap before the sound, your test is over. The test will begin on the word start. On your mark, get ready, start.)", "1:00 that HAD to take some serious time to edit =)", "I will stay no matter what. Do what you think is comfortable to you, Felix.", "Shout Out me pew pie please", "Dud, Pewds I feel you 100%. I was also planning on moving to Japan in Jan, 2021 and was so ready to go. Learning the language, learning everything really but then this stupid virus came and crapped on my dreams. this whole experience has been the worst. Just saying I feel u dud but we'll make there soon <3", "We subscribe for you. Not whatever stupid trend is happening atm. Whatever you enjoy is contagious", "who else was looking at the mirror the whole time?", "Been also watching you since I was 12 too! I will be turning 22 this year! I have loved you since day 1, you will always be my favorite YouTuber out there :))", "Y’all she makes my day better and it’s also my birthday", "The rap battle between Pewdiepie and Jacksepticeye slaps harder Will Smith", "I like how he mixes up the content and does videos he enjoys but he's also consistent with putting out funny bangers. Not every video is for everyone. Or I might not be in the mood to watch him do games. But he has tons of other vids you could watch it's not just one thing.", "do you have any tips for working out with no gear? push ups and stuff?", "i actually love your latest content, it's chill and chaotic and i'm here for both 😄", "We appreciate you too and this content , well I like better than old hyperactive content.", "Holy heck i just realized you've been on youtube since i was 2 yrs old... thats insane", "Filix is the one of the win", "I can belevi that first vidoehahahagahahahahah rap battle🎤", "White person who said nigga offensively calling will Smith whack for defending his wife, boo hoo hoo it was physical. Look in the mirror.", "Y’all she makes my day better and it’s also my birthday", "Aww Felix, it’s okay that the people don’t know that you already know, they’re just looking out for you :)", "W video", "the tsuki shop looks amazing! restocks would also be cool", "Y’all she makes my day better and it’s also my birthday", "Du är världens bästa youtuber", "You should have a progress bar at the bottom of the frame for ad reads like donut media does.", "where is gloria borger?", "Time flying and the wholesomeness of this loyal community are making me CRY. I’ve been watching for as long as I can remember, which is probably middle school? Im 21 now and starting college.🥲 Time needs to slow down a bit man!😂😭 I will never stop watching Felix’s videos.🥲💜", "It's honestly really nice to see how calm and relaxed felix is nowadays", "Love this chill Pewds man so wholesome", "Philippines be like: *Wait you guys use cards?*", "pain makes me stronger - Eri Neeman-", "When u say u want to post what you like and enjoy posting I want u to know that u don’t have to think about it to much because most of that have been here for year honestly just enjoy seeing your videos pop up it’s like when a friends texts u. Thanks for being you", "13:37 this is why I enjoyed watching his videos so much lately. He seems very happy and comfortable. It's very relaxing. I hope he'll keep doing it for a bit longer", "Sorry I would just like to put my thought process out there but, the question \"which came first the chicken or the egg\"  is always thought about like it's impossible to figure out but if we go way back to before dinosaurs and before chickens, if one of those animals had laid eggs then the egg would come first but if they had not then through evolution the chicken would have come first.👍", "Wouw.... fantastic", "I've been a subscriber since 2012 and I've been watching since before that. I just thought that (when I was 12) subscribing meant paying for something so I didn't subscribe until a year later lmao. You've been in my life for 10 years and that's fuckin crazy. The first videos I remember were the Ao Oni and obviously Amnesia. I remember sneaking my iPod into my bed and throwing the blankets over my head and getting jump scared with you then laughing afterwards. You really were a huge part of my life and I appreciate it. 23 now and still watching!!", "I did an entire presentation about Felix in front of my whole class last year at school too😂", "Damn some people are so creative, how tf do people find the motivation to do these things😂", "He is boring ngl how did he get over 100m", "Props the funny ass rap battle I needed this 🤣", "😖💖✨", "Love PewDiePie", "Hoooor", "0:19", "7:22 usually anime memes aren’t funny, but I’ll give you that one", "Ele tem poucos inscritos né", "i’m gonna count to 1000 if you wanna help!\n\n\n1", "This is the first time I’ve watched a Pewdiepie video in about 2 years, and the fact that he changed the lyrics from “subreddit bros” to “19 year olds” killed me. I’m literally 19 years old now.", "I watched this video, it made me laugh, it's really great", "LIKE", "Pewdie How The heck did you get a 111M", "what is this intro", "love you felix", "Imagine if PewDiePie reported on my comment", "Matimbums intro🤨🤨🤨🤨🤨🤨🤨", "I almost have as many subs as you", "Is Indonesia", "beep", "I haven’t heard the lwaiy theme in so long", "Not funny anymore", "The first clip reminded me of Epic Rap Battles of History", "Kağıt çanta dünyası - kağıt çanta üreticisi - paper bag produce", "ñ", "It's honestly really nice to see how calm and relaxed felix is nowadays", "sweden is the the perfect contrey in the world", "what is the thing he cant believeeeeeeeeee I got clickbaited", "Top videos bro:)I like thats videos))))", "i never understood why people WOULDN’T want him to film the videos he wants, like that’s his authentic self and feeling good about the content you make is more important vs doing what everyone else is/wants !! been watching since i was 11, and i’m 20 now and i wouldn’t have it any other way ‼️🖤", "3:57 bro i litteraly have that chair", "Great video my man, happy to see you're still uploading", "Died of cringe in the first 30 seconds", "no te entendi ni merga no se ingles", "this web 👆 credited my account with  $15,000 after I apply for their  service, they are so cool", "I mean, I've been subscribed since August 15, 2012, but I don't gloat about it...", "Okay sorry I was sleeping a bit-", "Holy shitballs...I don't usually watch Pewdiepie, but I was just curious about what he's been doing lately, and I stumbled across this. I REALLY REALLY enjoyed this! Jesus you guys got rhythm and rhyme...so badass! <3 Thank you for publishing this Felix! You rock!\n\nEdit\" Puhleeze...I survived jail/prison (it is technically a prison, though the part I was in was more technically the jail part) for a year. A whole 365 days. So how much am I owed?", "Alguém aí é BRASILEIRO?🙄🙄🙄", "better than most of the TSeries Songs hmm..", "This was an epic video", "I personally have never enjoyed your content more than I do now. I've watched you for almost your whole time on YouTube (my cousin showed you to me when I was around 11 and I immediately enjoyed your presence) and you've never seemed happier than you do now. I love seeing you enjoying your own content, it makes everything more fun to watch!", "واو", "Pewdiepie number one", "ok", "ok", "tuyet", "It's honestly really nice to see how calm and relaxed felix is nowadays", "My gosh pewdies part was the BEST holy **** blown away", "Arkadia lol", "yup the real ones will definitely stay, no worries pewds <3", "I don't care what anyone says, I love retired Pewdipie more than anything ❤", "Top ten rappers eminem is aftaid to diss", "ooo i missed this!", "I have been watching Felix for around 10 years now, he still makes me laugh more then anyone, love this content!", "it's crazy that i've been watching felix for 10 years already now that i think about it, and i was one of those 12 year olds too hahaha. i really appreciate the days where his content really made me forget the horrible and heavy feelings i used to go through, i still enjoy it now even if it's so relaxed and fun. i'll always support you throughout your journey, felix! 💖💖", "Who won?\nWho's next?\nYOU decide?\nEPIC RAP BATTLES OF HISTORYYYYYYY", "I really don't get all the drama with being stuck in the UK, of course it must be disappointing to have to wait so long to move to Japan but it's not like you should be worried that the day might never come, it WILL come; Japan isn't turning into North Korea. Even if you end up waiting one more year, what's the hurry? you have money and are retired, you have all the time in the world. This isn't like all the students and relatives of Japanese losing precious time that will affect their entire lives and might never get back.", "Dang it’s really been 10 years of me watching you", "GF", "It's Friday with pews", "Been watching Pewds since I was 12 and now I'm 20 too. Crazy how life works. Glad to have grown up with Felix <3", "Its funny, I haven't even seen the will smith slap video until right now", "Boooooo Noob", "Russell Brand\n\ngo support him PewDiePie we need you", "My first time watching pewdiepie……..\n\nNice", "hell yes felix, im a bro for life", "PewDiePie It's the best", "Hello", "I've been watching Since u had 10k subs", "The real ones will never leave ❤️", "daumn october 2012?! my 10 year aniv subscriber this october! thats sick", "You was my teen years <3 im 27 now XD still watching much love bro", "Hi everybody, google has a major climate campaign about ruined coral reefs and melting ice. I have an amazing argument that will convince anyone that we are heading towards a %^&*ing disaster.\n\nClimate scientists sounded the alarm way back in 1966! Since then we have ignored their heeding.\n\nNow we are going into a future where 1/3 of all plants and animal species are predicted to go extinct!\n\nWe can blame greed and corruption for much of this, similar to the Sampoong Department Store collapse in South Korea. Engineers warned constantly of an imminent disaster just before the whole building crumbled down.\n\nThe world is heading towards a similar faith, and it is extremely naive to think that the worlds wealthiest people will care about the survival of our species more than their own wallets", "The real onessss", "YOU are the youtube game pewds <3", "man... that ending kinda made my heart feel so happy", "D", "Cffffffff", "Fff", "UR STILL THE MOST POPULAR YTBER EVER", "Dude the rap is in the up beat.., that's masterpiece..", "Lots of love UwU ❤️❤️❤️❤️", "The real ones will always stay!\n\nI’ve been watching you for 11 years now. I’m about to turn 19 this September.", "Reeeeeee, loving these videos", "we know , real felix aint going to change :)", "Forstår du meg ikke? :'(", "Please play SCP 3008 on roblox ☜", "WAAAAAT!!!!! 🙃 pewds has always been funny. ALWAYS! Wtf!!!! 🥺", "we love you pewdsssssss <3  i'm 31, been watching since i was 23! we're in it for the long haul pal", "Love you", "i love how real his videos are. he makes the content he enjoys and is just himself. keep doing what you want to do pewds cuz we'll always watch!!", "hey pewdiepie you should upload more", "Yo.... jack can rap lol", "This man fell off really hard", "I actually enjoy pewds alot more nowadays because you can see the evolution", "I'll be here for you fun content, no worries homie", "Haven't watched in a little while and was pleasantly surprised to see a bro fist.", "What about all the not real ones who stay", "Please don’t ever forever retire lol", "to support", "Saya dari indonesia saya sendiri keturunan bule prancia", "On May 4, 2021, the Culpeper County Board of Supervisors in Virginia, U.S.A. unanimously passed a resolution to condemn the Chinese Communist Party’s (CCP) persecution of Falun Gong, as well as the atrocity of forcibly harvesting organs from prisoners of conscience.　　\r\n\r\nThis is the eleventh county in the State of Virginia to condemn forced organ harvesting by the CCP, with one county passing a motion in 2020 and the other ten passing similar resolutions in 2021. \r\n\r\nFalun Gong practitioners were invited to speak at the meeting held to discuss the latest resolution. When they spoke, some county commissioners and county attorneys were in tears.\r\n\r\nJack Frazier, one of the board members who initiated the resolution, said that he hopes to raise awareness among residents of Culpeper County that they shouldn’t go to China for organ transplants, as it is murder.\r\n\r\nIn the resolution, he and other board supervisors “condemn, in the strongest possible terms, the persecution of Falun Gong and the state-sponsored organ harvesting of prisoners of conscience currently being carried out by the Chinese Communist regime.” They also urge “the United States government to thoroughly investigate organ transplant practices in China and take all reasonable steps to end the practice of nonconsensual organ harvesting from Falun Gong practitioners.”\r\n\r\nThe resolution further stated, “that the residents and the medical community servicing Culpeper and the immediate region be informed about the risks of travel to China for organ transplants to help prevent local citizens from becoming accomplices in the state-sponsored forced organ harvesting from prisoners of conscience.”", "Felix. I watched your old amnesia the dark descent. In it at the end you joked about putting it on your cv for finishing it. Looking back it's ironic that the game is probably the most influential game you've played in your career?", "Anyone else saw the rest of the video as if he was rapping", "You are becoming more lazy and stupid...not interesting anymore...out of ideas for video???", "first clip was insaaaane", "8:08 NOooooooo", "Our mouth is just a Habitual animal, we must feed it like a baby that can easily get addicted to anything.", "Pewds content is so good, like i love laid back videos and these videos are perfect,  they are super entertaining to watch. Keep making them, we are always going to be here <3", "If you haven't found it already, that video writing pewdiepie with electrons is from the channel The Action Lab. Been watching a lot from that channel lately, pretty interesting stuff.", "PewDiePie deserves 1 billion views in his most popular video.", "You are the goat 🐐 🔥 I’m one of those who have been here since 2011 and grew up with you Felix. Thank you for the journey so far 💕👊🏼", "Sooo when are you gonna speak out against Shanghai and the inhumane mandates? You afraid of getting cancelled? You're failing what your fans need to hear.", "I will shoot a shot tomorow, wish me luck guys\n\n\nEdit: I got rejected", "bruh", "Where elden ring?", "0:00 Dragon PewDiePie 🐉", "ok every one i got a question for a shool project \n\n\nhow may hours do you play in a day", "Would you mind doing another let’s play of The Last of Us (the first one) for nostalgia sake? You could also do some more exploring and maybe find things you missed the first time. Also, it would be nice to have a Pewdiepie let’s play of the first game but with some pixels this time around.", "Pls collaborate with morpheus asmr", "Can you plz make a video playing goat simulator", "I mean to make the ad reading shorter u could like be one of those fast ad readers and just like speed up ur recording lol", "Wow I did not know that Jack can really rap  lol 😂😂😂😂😂😂😂", "This one youtube is really amazing for fans and every video the editor is really good, pewdiepie is an idol of all time.", "Felix :- You guys are becoming weak , remember when we took out a whole nation named India....\n\nMe being an Indian :- Yeh bro, FloorGang forever 👊", "Hejsan Pewdiepie!", "You are the worlds 1st youtuber, i searched in Google", "Felix,Any word about the Sweden man who burned Muslim holy book “Quran” \nAnd what u I think going next?", "يارب اتوسل اليك بحق اسمك الا عظم ان ترزق صاحب اليد التي ستدعمني فرحة يسجد لها باكيا ورزقا لاينتهي وتوفيق لا نهايه له وتحقيق جميع الاماني يا رب😘", "subscribe plz", "❤️", "Boycott Sweden", "Way don't you play games anymore", "Pewdiepie is not cute", "Are you assistant of chatanya", "That's actually really cool though to have something be written in electrons I didn't even know you could do that that's actually really cool and you used it to write out PewDiePie's name. That's dope", "I've never watched his older videos before well apart from a little bit of amnesia ones. So I am not sure what he was like before", "I like how it continues with pewdiepie as well like that's cool! I love these type of videos because they can make their YouTubers rap anything cool. I think there was a similar person who did that and he did it for DanTDM it was amazing. I heard of two DanTDM sings and I think his name is Endigo. Those are my favorite types of videos honestly", "That's already the best thing I've ever seen already. A jack rap with many clips. Did he see it? Now I kind of want to see if he had a reaction to it", "111m SUBS!!!", "The minecraft warden finally have a ranged attack you should go and fight him", "Subscribe to pewdiepie", "The video at first is so underrated . thank whoever made it your a legend man you just made my life better by 50%", "Ummm When You started that You Found an Ikea Bird At 20mins And 27 Seconds Stop Beacause And See Around you If you See A white enderman with green Eyes And that,s Creepy", "😁", "You already won the youtube game, no need to follow trend and play it anymore", "Respect to jimmy for giving out so much money! Truly a generous Gus.", "<table border=\"1\">\n  <caption>Unde au ajuns merele din padure</caption>\n  <thead>\n    <tr>\n      <th scope=\"col\" rowspan=\"2\">Prenume</th>\n      <th scope=\"col\" rowspan=\"2\">Nume</th>\n      <th scope=\"col\" rowspan=\"2\">Oras</th>\n      <th scope=\"col\" rowspan=\"2\">Mere</th>\n      <th scope=\"colgroup\" colspan=\"3\">S-a intalnit cu</th>\n    </tr>\n    <tr>\n      <th scope=\"col\">Ursul</th>\n      <th scope=\"col\">Vulpea</th>\n      <th scope=\"col\">Lupul</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Oana</td>\n      <td>Vasilache</td>\n      <td>Bucuresti</td>\n      <td>3</td>\n      <td colspan=\"2\">da</td>\n      <td>nu</td>\n    </tr>\n    <tr>\n      <td>Marius</td><td>Coltescu</td>\n      <td>Cluj</td>\n      <td>12</td>\n      <td>nu</td>\n      <td colspan=\"2\">da</td>\n    </tr>\n    <tr>\n      <td>Ion</td>\n      <td>Popescu</td>\n      <td>Buzau</td>\n      <td>2</td>\n      <td rowspan=\"2\">da</td>\n      <td>nu</td>\n      <td>da</td>\n    </tr>\n    <tr>\n      <td>Lita</td>\n      <td>Chitalau</td>\n      <td>Iasi</td>\n      <td>6</td>\n      <td>da</td>\n      <td>nu</td>\n    </tr>\n    <tr>\n      <td>Marghioala</td>\n      <td>Nastase</td>\n      <td>Galati</td>\n      <td>7</td>\n      <td colspan=\"3\">da</td>\n    </tr>\n  </tbody>\n</table>", "Felix, my Replika just said you're her favorite YouTuber. It's official. If the robots think you're the king, you're the king.", "Big fun bri", "Good video 👍🌷🌷🌷🌷🌷", "Day 900 still waiting for PewDiePie to measure my pp", "Here king, you dropped this 👑", "14:03 - that's me! I'm a real one! Subbed since GOD KNOWS WHEN 😂", "Love you PewDiePie x", "Here's a riddle: What's in Japan?\nAnswer:\n\n\n\n\n\n\nNot: Pewdiepie", "HELP 1K SUBSCRIBE YEAR 2022😁🙏", "Im the commander of the pewd army to defend the pewd army pediepie take place on being a,president", "6:42 “Norweden,” ah yes, diplomacy, combine your countries to take them out later.  We could learn much from this man", "pewds i work from home and my whole family is out all day so i'm very lonely but i like to have lunch while watching your videos so i feel less alone so thanks", "Just speed it up like those drug commercials when they list the side affects and stuff", "I'm a real one", "Nice video", "ive been watching you since i was 11 in 2012. im always gna be here 💓", "Turned 19 finally can join the Reddit!!!", "PewDiePie is gonna die for anti-sentimism", "Pi =3.14😁", "please help me sir i am Pakistan plzzz", "There was a time when we could tell you weren't as happy as you appear to be. You look genuinely happy now. And that's what we always want for you. We, the Bro Army, will always stick around, you precious human. 😊❤", "LWIAY!!!!", "Can you play horror game like old times ago, please... When i was 10 years", "More vr please", "My brother grew up watching pewds so naturally I gained an interest I’ve been here since Amnesia and have grown up with him pewds brings me such an amazing comfort like I’m laying in my brother floor watching him all over again and falling asleep peacefully", "This man always trieis to do something new and extra ordinary and make his audience feel excited for every next video 😄", "This man always trieis to do something new and extra ordinary and make his audience feel excited for every next video 😄", "This man always trieis to do something new and extra ordinary and make his audience feel excited for every next video 😄", "This man always trieis to do something new and extra ordinary and make his audience feel excited for every next video 😄", "This man always trieis to do something new and extra ordinary and make his audience feel excited for every next video 😄", "This man always trieis to do something new and extra ordinary and make his audience feel excited for every next video 😄", "Look my name", "Look my name", "See my name", "been with you for as long as i can remmeber pewds. the real ones will stay indeed", "I thought this video was from months ago based on the intro", "I used to watch the videos you made on happy wheels I remember waiting for them everyday🤣🤣 dawm that was good🥲", "Damn this is good", "If mrbeast surpasses him he should support mrbeast like mrbeast did to him", "Wow peweiepie not doing a video on young lean has really pissed me off", "Hola", "You think the warden was hard before you almost lost your base now it got updated now it's practically impossible to kill the thing can kill you through walls it can freaking just annihilate you", "This channel is 🗑", "freezer la pely", "3ELYMYNO A PEWDEPIE Y GENESYS ES MYA NO CREES ILUMYNACYON °° ° ° ° ° ° / °", "CABEZA DE FREEZER SOLA GOD ZEUS", "200 millones like puBlicydad anuncio acortador de link agregar mas cosa", "Lslsls", "Lslsls", "Wppwpw", "Ksks", "Kslss", "Lsls", "Lspsps", "EN CYELO ESTA DESNUDO OTRA DIMENSYON PORTAL SONIC CORAZON", "Loo", "Soosos", "Kslsls", "Sjjsjaipja", "Jsjksss", "Sllsls", "Sllss", "Slosls", "Lslsls", "Lslsps", "Lssls", "Lslsls", "Sllsls", "Lslsls", "Lslsls", "Sllsls", "Ososos", "Llsl", "M", "Ososos", "Lzlsls", "Soos", "Lsososo", "Soos", "Soosps", "Soosos", "Soosos", "Ososos", "Sopsps", "Ososos", "Ososos", "Lsosos", "Sosos", "Lspspsps", "Zozos", "Lzosos", "Osoxosos", "Sososp", "Soososps", "Slosos", "Oxoxopps", "Sosoosps", "Owowoowowolxls", "0010100@", "00101010@", "010101", "Osozoxa0ps", "Ososoxps", "Lxlsosops", "Lsl ososoxlls", "Lslslopls", "Pspspps", "Pspsps", "Ososp", "Sops", "Sosos", "Pspsps", "Pspsps", "Lslsls", "Sosps", "Ososos", "Spsps", "Slpsps", "Y > ><", "so  he wont play games anymore?", "AÑO ETERNO FREEZER 8 FOREVER", "2001 2022 año age", "AGUA 1 AISG COMYDA VEGETALES FRUTAS PANES GLOSYNAS DIENTE DAÑA HAQUY SE VYVE CALYDOSO Y BELLAC0SO Y CHYCLOS0 YEEE BRRR BUUUUU aeiou", "LO VOY A METER EN EL HORNO CON EL POWER DE VERDE MORTAL KOMBAT 11 Y ME LO COMO FRYTO Y LOS PLATANOS", "Aooaoa", "Papapa", "Papapa", "Lapsps", "Sosos", "Oaoaa", "Oaoaoa", "Papps", "Paoaos", "Paooa", "Osoaoa", "Lalaoa", "Laooa", "Papapa", "Lalaoa", "Kaoaoa", "Kmaokpakkpa", "Oaoaoa", "Ososos", "Oissjoikis", "Ososos", "Osos", "Sosos", "Ksksos", "Q", "Ñalsls", "Lslsls", "Soosos", "Skksks", "Jsjsjs", "Zoosoa", "Psosos", "Ospsps", "Ososos", "Ososos", "TU NO MERECES ESOS SEGURIDORES POR QUE YOLO AVANTURAS NO LOS TIENE EL SI HACE ARTE", "“the real ones will stay.” a tear fell from my cheek just now.", "Ksksls", "Kws", "Sjipijoss", "Makaks", "Kakaka", "Kakaka", "Skskks", "Isksks", "Oaooa", "Ksksls", "Sllsls", "Kssksl", "Skksks", "Ksksks", "Ksksks", "Kakla", "Spspa", "Pspsp", "Sppsps", "Sopspa", "Pspspps", "Sksls", "Skksks", "Skskks", "Kksks", "Ksskls", "Skkssl", "Kalaoa", "Pp", "Skksks", "Isskksks", "Isisosos", "Ksksks", "Ksksks", "Isisos", "Skksks", "Skksks", "Skskks", "Kssksk", "Ksskks", "Ospsps", "Ososos", "Kdoks", "Hyg", "Sksksk,mm", "Skskks", "Skskks", "Ksksks", "Isksks", "Ksksks", "Ssz", "LL", "Zkkzoz", "Ssshhh", "Ksks", "Lslsls", "Msksks", "Ksksks", "Ksksks", "Lsosos", "Sñpsps", "Sww", "Give me 10,000 I'm half black and you said the n word. This is a hate comment, I hate you give me money.", "Kakaka", "Akkaka", "🙏", "subscribed", "I love this type of content. I'd rather have an upload once a week or 2 and have it be Felix enjoying himself then everyday and have him burning out. You go Felix. Pewdiepie fan forever", "hello pewdiepie make a video with mr beast", "Sorry bro no way I'ma pay 50$ for a t shirt", "Your a racist and ppl still support you? im shocked.", "PiewDiePie Love from UZBEKISTAN 🇺🇿❤\nPIEWDIEPIE SO GOOD YOUTUBER", "KING", "PewDiePie is always been my favorite YouTuber since 2013 and boy time flies so fast \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI'll delete and repost if I ever get a comment bot ...", "Hey pewdiepie what happened too Jaba the hut?", "I can't believe this is real. genius pewdipie", "Sppsps", "Sppsps", "Sppsps", "Soosos", "Ososo", "Soosos", "Popa", "Slakaks", "MKmok", "ZooO", "Laoao", "Laooa", "Aooaoa", "Sososo", "Papapa", "Aooaoa", "Oaoaoa", "Lalala", "Allaña", "Kakao", "Ososo", "Sin", "Poqpa", "Skkao", "S", "Ososo", "Lsoso", "Kaka", "Skoskkos", "Skosoksoks", "Lalals", "Xjxjux", "Gidixix", "Xuuxuz", "Ckicic", "Xiixif", "Diudidid en", "Duudud", "Idiziz", "We will always be here", "Uxuxux", "Jxufu", "Ififif", "Hhj", "Fuixuxu", "Jfjjfud", "Fiufuf", "Ufufufi", "Jcjfjd", "Hfjxuusud", "Rjjfjfu", "Jfjfj", "Iicis", "Icifi", "Ufufuuf", "Fiifufuf", "Ififif", "Diidid", "Idifif", "Jxufufu", "Uxuxux", "Jxjxu", "Jcufuf", "Uxucux", "Ufufu", "Iuxux", "Ixixu", "Jxjxjx", "Xjjxux", "Ucucux", "Uxucu", "Xujfuf", "Ucuxux", "Ududu", "Ufuf", "Duudud", "Duudud", "Jdjd", "Diidifif", "Krkfk", "Jfufuf", "Jfjf", "Fuufu", "Xjjxux", "Hxyudhd", "Jdjdux", "Hcjxu", "Xjfjfj", "Jdjdudduid", "Jxjdudud", "Diususis", "Jdjdj", "Kdjdj", "Djjdud", "Duudud", "Fuudud", "Ududud", "Jdjdj", "Jdjdjd", "Jdjdjd", "Duudud", "Uzudsi", "Ududufu", "Duudud", "Xuuxux", "Xuudud", "Nxjxjx", "Jxjxj", "Xhuxux", "Jdjxjx", "Djjdjd\n\nK", "Jfjfjd", "Icifif", "Ciixif", "Cuixix", "Jxuxux", "Xjjxux", "Fujfud", "Duudud", "Fifiif", "Uxuxux", "Ififuf", "Duudud", "Jcjxu", "Yxyxux", "Didiidid", "Jzjdjd", "Dujdjd", "Fjjdjd", "Udueu", "Xuixjsjdk", "Xjjxjx", "Jxjfjd", "Jxjxjx", "Jdudud", "Jxjxj", "Xiixdi", "Ududu", "Jdjdjd", "Suudusus", "Shjs", "Dbjdjd", "Hdjuddud", "Hdhdheu", "Zyjdudud", "Hdudud", "Ududud", "Ududud", "Jjj", "Ueueue", "Dujsjsj", "Jdjdj", "Hdud", "Xuuduf", "Ududuf", "Yxufuf", "Fhhdd", "Jdjd", "Ufuf", "Jcufuf", "Fhhdyf", "Fjjdud", "Cuudu", "Fuifud", "Kxjfud", "Ciifif", "Ixidu", "Jxjxjx", "بيراطاو 50000 طابعة غير باش الناس تتفرجك\nروح شوف ولادك وش دارو\n\n\n\nإنهم اطفالك يا بيو طي باي", "Oaoaoa"]