["Hooooooooioooiooooooooooiiiiii", "I like this song just wow 💞💞🇧🇩🇧🇩🇧🇩", "Wow amazing  💕🔥", "ฟังบ่อยมาก", "เลิฟเลยค้า❤️❤️❤️", "ยังดูอยู่คะ ชอบๆ😍", "She's so alluring..watching from the Philippines 🇵🇭😍💖", "رهيبةةة 🔥🔥🔥 حركاتها صوتها كل شيء 😍😍   . و أول عربي بيعلق 👏", "여기 유트부에서 보다니 파타야 루시퍼에서 노래를 부르던 그녀 팬이 였는데 반갑네요", "So lustig", "https://youtu.be/U2FrvHbl7Sc", "rrrrrrr ay ayyyyyy me encanta 💖👑🛐", "His style and song was amazing 😲 wow ! She rocked . I love this song 🤩", "Better \n than the original", "Que gracioso cuando cantan en español 😅  lo hace bien", "Por eso amo mi musica latina es la mas bailada y la mejor cantada del mundo vamos 💪🏽🎇🎆🎇🎆🎇", "Even tho it's not perfectly \"perfect\", the main attraction is that she's not just singing but 'performing'. The attitude, the stage presence and the way she's interacting with the audience and the judges is just amazing!", "The end of song", "Goosebumps all over 😍😍😍😍", "rrrrrrrrrrrrrrrrr Taki Taki... that was more than enough to give that girl like 10 Freaking Golden Buzzers\n\nEpic cover ❤️", "Her voice and energy are amazing. Whenever I see this video, I always watch it. 🤩", "La mejor interpretación de esta canción, excelente!", "Bro I have no clue what they’re saying but the dude at 3:03 is cracking me up 🤣", "So cute voice 😍💕💕💕💕💕💕", "What s her name plis", "That ayyayayay....  uff..  so sexy and cool...  the other judges had to turn", "She reminds of a new age Eartha Kitt... she rocked that!", "Vergood...😍😍😍", "เจอตัวแม่เลยจัดจริงๆ", "Suppop singing from nepal", "Someone help is she on spotify?", "EXPLOTA COMO NAGASAKI  (BLOW UP LIKE NAGASAKI ) JAJAJAJAJA omg SHEEE SAYYY IT!!!!!!!!!!!!!!!!", "Greatest  new musical  artist", "พี่แพรไปได้ไกลเลยยย 🙌🏽💕", "Seleranya buruk njiiir😂😂😂😂", "Muy buena interpretación y bonita voz", "I love her voice😍", "This is WAYYYYYY!!! Better than the original song!\nI went to look for that song hopping was as good as your interpretation!\nI was soooo disappointed!\nLol\nYOU ARE SUCH A GREAT PERFORMER!!!", "Her stage presence is the best", "https://youtube.com/channel/UCDimUnHpnqVexnLUnCljnOQ", "Confident level..🔥 can I have bit??", "ฉันไม่เข้าใจสิ่งที่พวกคุณพูด แต่มันสุดยอดมาก...จากอินเดีย", "Her anergy❤️❤️❤️", "What are they sayinggggg🥺🥺 please someone translate", "*u rock babyy* ❣", "Awesome self confidence ❤️❤️❤️", "ฉันมีความสุขมากที่ได้ฟังเพลงนี้❤️❤️", "คุณร้องเพลงเพราะมาก💯♥️", "คอมเม้นไทยอยู่ไหนครับ 2022 ล่ะ", "This is the best version of taki taki \nI've ever heard I do luv the original but this gives me goosebumps 🔥\nKeep doing it girl", "ऀईभघघभीभीमीढीठठगचणभभमयक्षकखगबढथूज्ञबीगबघुज्ञद", "ऀईभघघभीभीमीढीठठगचणभभमयक्षकखगबढथूज्ञबीगबघुज्ञद", "Love from india", "ชอบมากกกก I love it.", "Awesome", "Woah!", "Any indian😂", "Amazing voice", "ในฐานะศิลปินละติน ฉันช็อคกับผู้หญิงคนนี้ เธอดูเป็น Latina ที่น่าประทับใจจริงๆ ฉันอยากรู้จักเธอมากขึ้น estoy impactado canto en español que me sorprendí sin palabras de verdad que sin palabras!!!", "She owns the stage love it", "ดูประจำครับ  ชอยความเป็นอิสระในการถ่ายทอดผลงานเพลงมากครับ", "She is doing like a rockstar and people came to her concert she is amazing", "This wasn't just a performance, it was a concert", "Gurll I am obsessed with this 😩", "Confidence level is not from this world", "I love her style 👌👌", "She is the real ⭐✨✨", "Yo is this in spotify??? Pls reply anyone", "wow", "woow love two    taki taki", "Wow what a performance level,, I fall in love with this girl", "mind blowing", "😱😱😱😱", "Omg such a heavy voice... ❤❤❤", "มาขย่มผมหน่อยครับ😆", "I cannot understand a word but great performance!", "When she sang 'But the hate be so real' ahead this she sang further lines in English but I couldn't find in the song. From which song these lines taken?", "Love ❣️❣️❣️❣️❣️ from India 🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳", "Am litrally in love with this woman what a star her rap is insane tho❤👈 popped my head taki taki and them purring sexy 😆", "Bruh but why they having the voice audition at her concert tho?", "ฉันมาจาก TIK tokคุณน่ารักมาก ร้องเพลงได้ดี", "โครตชอบเทอเรย😍", "I will never get sick of watching her sing and dance! She's amazing!!!", "โอโหคนไทยร้องแต่คนต่างชาติดูมากกว่าคนไทยอีก", "기가막히죠!!!", "00:23  just love with the ay-ay-ya-ay", "Trending in 🇮🇳India tooooo \n\nHats off to the musicians as well 😇🥰", "Love from india", "This is so powerful", "Wow I really enjoyed her performance!! Love her voice! And her breath control during her dance is impressive! 👏🏽 All the best from Germany 🇩🇪 😊", "Very nice voice", "Вщйюеч гекуро", "Attitude", "This was not an audition. This was a fuckin finale 👏", "ไปออกทัวร์ แถวๆ ลาตินเลยน้อง ตอนนี้กระแส T-Pop แรงมาก", "Yeahhh dayummmm .. she killed it!! 🔥", "เหมือนพี่เขาใส่ความเป็นหมอลำเข้าไปด้วยอ่ะ มันทำให้ดูน่าฟังมาก🥰🥰🥰🥰🥰", "I'm watching this 2 years later and CAN'T BELIEVE I'VE BEEN DEPRIVED OF THIS MASTERPIECE ALL THIS TIME HELP-", "1:21 He was dancing to the Music and he realized he got BLOCKED", "Salio espectacular la actuacion.\n\n\n\n\nPd: el jues de traje obscuro me enamoro  😔", "I love her performance", "I can't say wow", "Hi", "Her performance level 👌🔥", "Omg I love her style ❤❤❤", "I love  this song", "All I hear is Kawasaki, but I love it!! Hello from ur TikTok audience", "Wtf 🤣🤣🤣", "She won the crowd", "เก่งครับ", "Good profession hajur.", "❤❤❤", "Wow 😳❤️", "เสียงไม่ตกเลย ทั้งเต้นทั้งร้อง", "เสียงแนวนักร้องตามร้านตะวันแดง", "What is her name?", "Anyone like me who loves the sweetness of thai language. I really the kha in the last", "She didnt have fans before the performance...she was making fans throughout the performance.... Just like Me🥳", "Can anyone please tell me the other song which was sung in English?🤓", "Ella mi favorita Taki Taki The Best", "คอมเมนท์คือ ตปท. 90%🤩", "ผ่านมาแล้ว2ปี ดูกี่รอบก็ไม่ค่อยเบื่อเลย❤️", "who know her instagram? :)", "เสร็จพี่โจ้ฝ้อีกเเล้ว เด็กพี่โจ้😅", "She could be the new Khloe Kardashian with the rrrr", "m6giL]^d9k +++", "Voice is a vast song AME onek VER sunai AI song ta", "ตกลงช่องต่างชาติป่าววว😁😅 มีแต่เม้นต่างชาติ😂", "Vuaaa que dominación del español jajaja y con su personalidad le quedó perfecto", "She got the attitude 👍👍🪓☕", "DAMN! Her style is on 🔥! Her energy is outstanding. She's definitely a performer. ❤", "Love this..", "Ah, I like P'Praeja, singing first because it's the first Finry Dee. You'll like it, so there are people who edited the last stick. Satisfied. 💖", "Un flow increíble", "Cool!!😎", "Nice ❤❤❤", "หาคนไทยไม่เจออะ", "Parabéns, que cantora incrível", "Soo cool feeling", "UFFFF talentasooo amooooo", "When I saw this video I cant stop but to watch all her performances. She is such a stage performer. Her giggle and laugh is contangeous. I love her now. I watched it multiple times already and still loving her performance. Love from the Philippines 😘", "better than original", "I like  her attitude", "ทุกวันนี้ทำอะไรดังไหม", "U r super  singer", "She sings Taki Taki better than the original group who released it!!!", "ร้องแล้วแอบหอบ", "Goosebumps! every time I watch his video. she is a very good at singing.😍", "PEARJA performs like it's her concert!🤘❤️❤️❤️", "Omg girl crazy🤩", "Naga saki 😝😝", "What a swag yrr🤩😍😍👌👌", "I like this better than the original.", "She sings it better then the original singers", "Who could forget the four iconic judges Kong, Kim, Joey and Blocked!", "1:23 who saw Kim Jong un 😂", "给劲儿！😎", "Omg i Love her style ❤💖", "So much Attitude and Swag🔥🔥🔥", "Congo", "Even her giggles are on pitch", "OMG I love it and very very nice 😍😍😍😍😍😍😘😘😘😘😊😊😊😚😚😚🤗🤗", "That's better than the original", "GUYS! THAT'S NOT AN AUDITION-IT A REAL CONSERT!!! OMG!!!! I AM ALREADY HER FAN!", "Omg i love her style. 🤩", "What is her name?", "ตอนนี้ก็ยังกลับมาดู", "fantastica", "Hi", "👍🏻👌👍🏻👌👍🏻so nice", "Still watch this version of \"Taki Taki\". I like this \"Taki Taki\" way better than the original \"Taki Taki\". Did I tell you about \"Taki Taki\"?..... \"Taki Taki\".", "ดูกี่รอบก็ชอบบบบบ", "understanding 0/\nengoing 100000 /", "🔥🔥🔥", "Can somebody make a lyrical video of this? I wanna cover her cover🤩 It's just amazing", "เลิฟฟฟฟฟ", "Name plzzz???", "🔥🔥🔥🔥", "It was so kind of her to let the judges hold the auditions during her concert", "เก่งมาก", "Her laugh at the end. Cherry on top.", "🤩🤩🤩🤩🤩🤩", "ดีกว่าต้นฉบับอีก", "เพระมาก", "1:21 LMAO he was so enjoying the concert he didn't notice he was blocked lol", "Se la rifo con esta presentación! Que energía!", "Why 4 th judge blocked", "Better than original", "No word is left!!!", "She is very good", "Considering she is dancing too her singing skills are really good.And I don't thing she went to an international school either since she has a Thai accent", "i love it\n❤❤❤❤", "ชอบอ่ะ น้องเค้าอยุ่ร้านไหนจะไปดูใครรู้บอกหน่อยค่ะ", "Attitude level is so so so good. I like her style.", "What a swag", "Fđgccfu", "What a performer", "She is super cool! Did they say she sang Hiphop? Dude,  that song is moombahton and reggae.", "I do not understand I do not understand", "เอาคนดูอยู่", "Just wow amazing", "ะาบจอออขชแแาส", "How to pronounce her name?", "fire", "น่ารักตอนขำ❤️❤️😁", "10.3.2021🥰", "💕💓💕💓💕💓💯", "Thailand Rocking Star💖💫⚡", "คนนี้น่าสนับสนุนขนาดแค่ออดิชั่นยังมีแฟนต่างประเทศเลย ......", "Omg how ordare leave her style", "WOW 😍", "Verry nice..", "I can't understand that song but really enjoy  it🕺🕺", "Ok google how do rh factor in uh huh you 262", "โกง", "วงการเพลงเสียหายหมด เต้นยั่วอย่างเดียวเสียงไม่เพาะไม่เป็นไร ไม่ใช่เดอะโชว์เรียกว่าอะไร", "โจอี๊บอยไม่เคยคลัมเมโลดี๊ จากผลงานในเดอะว๊อยคือทำเดอะโชว์บอกได้ว่าไม่เคยผ่านการคลัมเมโลดี๊มาก่อน", "ผู้เข้าแข่งขันคนนี้คือประกวด เดอะโชว์ในเดอะว๊อย พวกเสียงดี ก็เสียหายหมด ดิ", "คณะกรรมการโกงต้องแบนอยู่ในการแข่งขันไม่ได้ 8ปีชนะกี่รอบ โกงแน่นอน เพราะทำเดอะโชว์จริงๆ", "ให้เดอะแร็ปก็ไม่รู้จะโกงท่าไหน เงินรางวัลเป็นล้าน ถ้าได้ก็แบ่งลับหลัง โกงเก่ง", "โกงชนะแล้วก็มาแบ่งกัน แต่พอดีผู้ชนะไม่ใช่มันไง ต้องแบนโจอี๊บอย", "โกงเข้าแข่งขันกับคณะกรรมการ ชัวร์", "100ล้านไปเลยแม่", "ù jshdòhàà", "อย่าคะ ล้มเจ้าก็ไปอยู่กับล้มเจ้าสิค่ะ แบแม่ชาวบ้านแล้วแบคนอื่นด้วย 🤣🤣🤣พี่ไม่เอาหรอก", "ผลลัพธ์คือ มันไม่ได้ทำไรผู้หญิงที่แก้ผ้าเองเลย แต่มันนั่งเล่นของ กับ ไซโคแบบสบายใจ จนผู้หญิงคนนั้น เกินขีดจำกัด การรับได้ ของ ความรู้สึก มึงนี่มันฆ่าตกรแบบอันดับต้นๆของเมืองไทย เพราะ ตร. ไทยไม่ทันมึง ถ้าเป็น อังกฤษ มึงไม่รอดหรอก", "ผลที่ได้ลองคิดดูนะ ไกลตัวมากเลยจริงมะ เป้าหมายแก้ผ้าเอง ลงมืออยู่ห่างๆ แถบนั่งสบายใจอยู่ในสตูดิโอด้วย ตร. ที่ไหนจะจับได้", "เข้าใจแหละ ว่าโจอี๊บอยแผนเยอะ ไม่งั้น จะทำผู้หญิงคนนั้นแก้ผ้ากลางถนนได้ยังไง ถ้าแผนเด็ดการสลับตัว โจอี๊บอย ไม่ถูกปล่อยตัวออกมา เอ๊อะหรือว่า โยนขี้ให้เพื่อนร่วมงานจนประกาศแต่งงานกับใครสักคน ตกใจแก้ผ้าอาลวาดเลย จริงมะ", "แม่ด้วย", "มีพ่อล้มเจ้าทำไงเนี่ยะ", "ใช่มะ โจอี๊บอย มันไม่เหมือนโสเภณีตรงไหน", "อ๋อ เหลือแผน z สลับตัวคนสุดท้าย อีกแผนหนึ่ง คนคนที่ไม่ค่อยรู้เรื่อง ทำยอดของเราดีกว่า น่าจะเวิร์ค", "พยายามทำร้าย สิริวัณฯ ไม่สวยเลยนะ มันก็คือคนที่ทำลายกษัตริย์อยู่ดี", "ทรงบ่อยเหรอ ทรงหอยหรือทรงไข่ดีหละ", "ผลออกมาก็ ล้มเจ้า อยู่ดี", "ทีมมึงไซโคโหนไข่กะหอยเก่ง", "เปลี่ยน เวียนจนคบแผนยัง คิดว่าฉลาดคนเดียวหรือไง  โจอี๊บอย มึงเป็นคนที่ทำร้ายผู้หญิงคนที่แก้ผ้าวันนั้น 🤣🤣🤣 แผนc หละ ไซโค จนเธอถูกมองว่า เป็นคนทางประสาท แผนมึง เธอคนนั้นน่าจะหมดผลประโยชน์ทางการโหวด ยอด และ ทำเงินทรูมากกว่จริงมะ โจอี๊บอย", "มีแต่โพ๊สรูป sextoy ขึ้นอะ เฟสบุ๊คผู้หญิง", "เป็นไรกับ แม่คนอื่นเค้าอะ เป็นมีคนโวยวายอยู่ แม่ชาวบ้านเค้าไม่ได้เป็นทอมหลอกนะ เลข6แล้ว เรียนจบที่ไปหรอ", "ฉันรักเธอ เป็นแฟนกันนะ😘😘", "ขอให้คนในวงการวันนี้ ร่วมพิจารณา โจ อี๊บอย  สำหรับการกระทำในครั้งนี้ด้วย มันคือการฆ่าตกรรมคนไทยทั้งประเทศสำหรับการตัดสินใจของมันในวันนั้นคือเทปบันทึกนี้", "ตอนนี้ทุกคนมีปัญหาหมด รวมทั้งพ่อแม่ของคนที่ทั้งพวกจะล้มและไม่ล้มเจ้าด้วย", "พวกล้มเจ้ามันคิดว่าจะมีปัญหาแค่คนที่สนเจ้า แต่มันไม่รู้ตัวว่า ส่วนใหญ่รวมทั้งตัวมันด้วยมีปัญหาด้วย", "มันไม่สนหรอกว่า สังคมไทยจะเป็นไง ที่ทำก็แค่เอาหน้าให้ยืนในวงการได้เท่านั้น จนวันนี้ เด็กไปม๊อมเพราะ สิ่งนี้มันสนับสนุนเข้าทีมมัน เกิดปัญหาใหญ่ถึงประเทศก็ไม่สนใจหรอก", "ยอมให้มันอยู่ในเดอะว๊อยได้ยังไงถึง 8 ปี", "หลอกตัวเอง", "ยังไงก็ล้มเจ้า แล้วอยากยืนอยู่วงการไทยนานๆเนี่ยะนะ", "รู้มั้ยทำไมมันถึงไม่เคยโดนเชิญไปเล่นหนัง hollewood เพราะว่ามันไม่สนใจในประเทศไทยที่มันอาศัยอยู่เลย คุณเห็นดาราที่มีเชื้อจีนแบบมันมะ เช่น เฉินหลง ดอนนี่ เหยิน หรือ คือ อื่น ถูก ดึงตัวไป hollewood หมด เพราะประวัติส่วนตัวก็ไม่มีปัญหา", "ที่สำคัญ โจอี๊บอย คนนี้ น่าจะไม่เคยเกณฑ์ทหารด้วย  คุณจะเห็นได้ว่า เด็กต่างชาติที่เข้ามาเรียนไทย  เมืองจดหมายเรียกตัวกลับไปเกณฑ์ทหาร เด็กต่างชาติคือ กลับทันทีเลย", "ไม่สนับสนุนงานทุกงานของโจอี๊บอย \n1. วันนี้เด็กไปม๊อมเพราะว่า เข้าใจผิด ม. 112 และยังทำให้ เด็กที่ออกไปม๊อมหลอกฆ่าพ่อแม่ตัวเอง ทางตรงและอ้อมในด้านเศรษฐกิจ \n2. สนับสนุนคนเข้าวงการโดยไม่เช็กประวัติก่อน ว่า มีภูมิหลังไง จนวันนี้ ม๊อมที่เกิดขึ้น ส่วนใหญ่คือ คนที่ต้องการล้มสถาบันกษัตริย์ในประเทศไทย \n3. การทำงานในวงการของมันสนใจแต่ เกมส์มันต้องชนะ ไม่สนใจชุมชน หรือ สังคมวัฒนธรรมของประเทศไทย \n4. โจอี๊บอย เป็นดารานักร้องที่ไม่เคยได้รับเชิญไป เล่นสักเรื่องในhollewood เนื่องจาก ประวัติในวงการบันเทิงไม่ดี พร้อมทั้งหนังประวัติศาสตร์ไทย\n5. ผลงานเพลงไม่เคยมีการกล่าวถึงประเทศไทยหรือ ประเทศที่ตัวเองกินนอน อยู่อาศัย \n6. มันสนแค่ตัวเองยืนในวงการได้มั้ย เท่านั้น", "มันล้อเลียนเค้ามันก็ต้องเป็นคนที่โดนข้อหาจาก ตร. เอง ทำไม พวกเองต้องไป เข้าคุกแทนมันด้วย ฉลาดหน่อย ด่าหลายรอบ ยังไม่ฟัง ไอพวกเด็กโง้", "โจ อี๊บอย คือ อภิสิทธิ์ โอภาสเอี่ยมลิขิต\nส่วน ผู้เข้าแข่งขันคนนี้ชื่อ yannawat เธอได้ถ่ายรูปล้อเลียนลูกสาว ร. 10 จริงแล้ว ลงในเฟสบุ๊ค เด็กรุ่นใหม่ก็เข้าใจผิดว่า สามารถทำได้เพราะการกระทำของผู้หญิงคนนี้ จนเด็ก ออกไป ม๊อมแล้วรวมมาเป็นข้อ ม. 112", "สนับสนุนงาน โจอี๊บอยไม่ได้ แล้วผู้หญิงคนนี้ด้วย", "คนล้อเลียนภาพ กษัตริย์ คืออินังผู้หญิงคนนี้ และเด็กไปโวยวายเพื่อมัน เพราะมันเป็นคนล้อเลียน เนี่ยะนะ เห็นมั้ยว่ามันถูกจับเข้าคุกมั้ย มีแต่เด็กที่เป็นแกนนำถูกหลอกเข้าคุก แทนมันคนนี้ แล้วคนที่สนับสนุนยืนอยู่ไทยทุกวันนี้ คือ โจอี๊บอย แล้วมันก็นั่งทำงานในวงการสบายใจไม่รู้สึกรู้ร้อนอะไร เพราะมันไม่ได้ออกไปโวย กษัตริย์ หรือ รัฐบาลมีแต่เด็ก แล้วเยาวชน", "แบนเดอะแร็ปเปอร์ด้วย เพราะให้เงินสนับสนุน คนทำร้ายสถาบันกษัตริย์ คนที่นั่งทำงานแล้วสนับสนุนคนล้มเจ้า แล้วเยาวชนเข้าใจผิด เรื่อง ม. 112 คือ โจอี๊บอย", "โจอี๊บอยไม่สมควรยืนอยู่ในวงการไทย เพราะ ประเทศไทยมีสถาบันกษัตริย์อยู่ แล้ว ร. 10 มีลูกสาวชื่อ สิริวัณนารีรัตน์ จำใส่กะลาหัวไว้ไอดารานักร้องหัวมวย", "พยายามทำร้าย สิริวัณนารีรัตน์ ไม่รู้ที่ต่ำที่สูง หลอกเยาวชนไป ยกเลิก ม. 112 เพราะตัวเองทำรูปล้อเลียน องค์หญิงแล้วไปหลอกเด็กๆว่า เยาวชนก็น่าจะ ด่าว่าด่าทอพวก กษัตริย์ได้ วันนี้คนที่สนับสนุนมันยืนในวงการบันเทิงควรพิจารณาตัวเอง ออกจากวงการได้แล้ว ไม่ใช่ใหเด็กไปว่า คิ้ม", "ถ้ามีเชื้อชนชั้นสูงมาจะรู้โดยไม่ต้องมีคนมานั่งบอกนั่งสอนว่าอะไรทำได้ทำไม่ได้ โดยสัญชาตญาณเชื้อชาติและไม่ข้อความวุ่นวายให้ สังคม", "คอนเฟิร์มว่า โจอี๊บอยเป็นเชื้อชาวจีนที่สกปรก 100% ไม่มีเชื้อ mongol ผิวรูปผิวร่างจากเชื้อคนจีนที่มีวัฒนธรรมที่ เข้มงวดกันมา", "Super", "I couldn't understand anything but She is the real entertainment....... Wow", "OMG her dancing style killing me....and her voice 🔥🔥🔥", "เอ๊... แผนโจอี๊บอยให้ หรือจะ มีอะไนกันไปเลยดีนะ แล้วเดินคู่กันไปเลย ยังไงเครดิตก็ติด คนล้มเจ้าทั้งคู่แหละ จะเดิยด้วยกันหรือจะแยกกันเดิน ก็คนล้มล้างสถาบันกษัตริย์ในประเทศไทยอยู่ดี 🤣🤣🤣", "เอาคนที่แก้ผ้าเขี่ยให้แล้วหนิ แต่บังเอิญคนที่โดนเขี่ยให้ก็ไม่รู้ ไอคนแก้ผ้ามันก็ไม่รู้ หลักฐานมันก็เลยลอย...จน ไม่มีใครจับได้ แต่ๆๆๆกูคยหนึ่งแหละที่รู้ 🤣🤣🤣", "ไม่ก็เขี่ยให้เพื่อนร่วมงานที่นั่งข้างๆ", "นิฆ่าตกร ผู้หญิงคนที่แก้ผ้า มันตายทั้งเป็นเลยนะ  มึงนี้มันเฮี๊ยะจริงๆ หมดประโยชน์แล้วก็หาวิธี เขี่ยแบบใช้วิธีไซโค🤣🤣🤣มึงคิดว่ามึงฉลาดคนเดียวเหรอ ไง", "ล่าสุดโจอี๊บอยโจรกรรมข้อมูลให้ผู้เข้าแข่งขันคนนี้", "ล้มเจ้า", "ใช่มั้ยโจอี๊บอย  รวมทั้ง ข้อมูลของผู้หญิงที่แก้ผ้า แล้วถูกทุกคนมองว่าเป็นคนมีปัญหาทางจิต", "กินแล้ว เลยต้องเอาขึ้น เวที  ทำเป็นไม่รู้จักกัน   ล้มเจ้า  ใช่มะโจอี๊บอย ล้มเจ้า", "ทีมล้มเจ้า", "ล้มเจ้า", "จะไม่มีใครแก้ผ้าเพราะโจอี๊บอยอีก เป็นคนที่สอง ถ้าอยากแก้นักก็ไปแก้ผ้าเอง", "โจอี๊บอย มันโจรกรรมข้อมูลเก่ง ขโมยข้อมูลคนไทย ให้ลูกทีมที่ นำเข้าค่ายตัวเอง คิดว่าน่าจะทำมานานแล้วแล้ว มองว่าไม่มีใครรู้ หญิงสาวที่แก้ผ้าวันนั้นด้วย คือ สิ่งที่บงบอกว่ามัน หมดประโยชน์สำหรับการทำยอด โหวดแล้ว", "What blasphemy is this? This is not audition. This is concert!", "ขึ้นสิ", "ยังไงก็ล้มเจ้า จะขึ้นรูปคู่กันไปเลยก็ยังไงก็คือบุคคลล้มเจ้า ที่คนเค้ารู้จักกันว่า ล้มล้างสถาบันกษัตริย์ไทย", "ถ้ามึงไปขอของมาจะสักยันต์ไทยอะไรก็ไปสักกันเอาเอง ไม่ต้องให้มันมาเรียกกู", "กะหรี่น้อยชายหญิงจะบอกให้รู้นะจ๊ะว่า กูเนี่ยะแหละ ทหาร", "ของเยอะ ตอนนั่งทำในรายการ เขย่ายังไง", "อ๋อ นิแสดงว่าผู้หญิงที่แก้ผ้ารถยนต์สีขาวหมดประโยชน์กับโจอี๊บอยแล้วใช่มะ ในด้านธุรกิจทรู แบบต้องโหวดๆๆๆให้  ยอดใช่ปะ", "🤣🤣🤣", "รีบขาย!เหรอ  ขายทั้งหอยขายทั้งวีซ่าด่วน", "ปกติแทรก เน็ตเวิร์ก ตลาดลูกค้ายี้ห่ออื่นแบบนี้บ่อยมะ", "ทรูเหรอ โทรหาน้องชายแบบไม่ได้เป็นลูกค้าเลย มีวิธีการทำตลาดแบบใหม่เหรอจ๊ะ คนละเครือข่าย", "อยากลงยันต์ไทยก็ไปลงเอง พอดีถือบัตรประชาชนไทยอยู่แล้ว", "สัญดานงี้มิน่า กิ๋มบัวถึงตัดขาด ไปเลย", "ฟ้องกูข้อหาไหนดีอะ ข้อหาแอบอ้างเป็นลูกสาวแม่บ้านของลุงเปี๊ยะหยวยดีมะ 🤣🤣🤣", "โจอี๊บอย หลบแล้วหลบอีก ตั้งแต่ ผู้หญิงคนที่อยู่ดีๆแก้ผ้าแล้ว มึงคิดว่า ตร. เค้าไม่สงสัยเหรอ", "โจอี๊บอยมันสนับสนุนการโจรกรรมข้อมูลของคนไทย อย่างนี้จะสนับสนุนได้ไง มันโจรกรรมตัง้แต่คนไทยยังไม่มีปัญหาจนมีปัญหา แล้วคิดว่าการที่ออกมาพูดวันนี้จะทำอะไรมันไม่ได้", "จบมาแบบไม่โดยผู้ชายแทงหอยด้วย ดีใจซะ กูไง ถ้าเป็นมึงอาจจะใช่ถึงต้องเอารายกูต่างๆ มาทำเป็นพวกเครดิสสะอาด", "ไม่ใช่กูด้วย  ลุงกูหูตาไวจะตาย ถ้าเป็นกูนะ ต้องถูกส่งกลับกรุงเทพจาก เชียงรายเนียะแหละ", "แล้วหลานยาย ฉันก็ไม่มี ชื่อของเธอเลย", "เธอคิดว่า รูป mk ผู้หญิงใส่ชุดกระโปรงเขียวคือ แม่บ้านที่ลุงฉันจ้างมาเหรอ  รูปฉัน", "สมัยปีสองอะนะ ฉันเท่ย์ รายสักลูกศรชี้ลงก็เลยต้องมีขีดเส้นตรงข้างล้าง", "ลูกศร ชีลง ทีหอยเธอมันก็เหมาะกะเธอดี", "คนนี้ไม่ใช่เครือเพิ่มธรรมสิน", "แต่ทำไมแม่บ้ายทำต้องนานไม่ได้สักที", "เธออยู่บ้านลุงฉันแล้วเธองง ว่าทำไมลุงของฉันถึง carantee ฉันไปเมกาได้ใช่มั้ยหละทั้งที่เป็นคนนอกบ้านเหมือนเธอ", "น้องสาวฉันไม่ใช่เธอ", "ลุงชอบจ้างแม่บ้านไว้คนหนึ่ง หน้าตาเหมือนเธอเลยนะ", "เรามีลุงอยู่บ้านอยู่บางนาคนไปแอบเข้าบ้านเขามาใช่มะ แล้วคิดว่า สถานะเธอกับฉันมันเท่ากัน", "ใช้วิธีนี้กับคนไทยมากี่ปีแล้ว โจรกรรมข้อมูล คนไทย", "แก้งเพื่อนเรา น่ารักเรียบร้อย แบบนี้ไม่มี รอยสักไม่ชอบ คนนี้ไม่ใช่เพื่อนฝูงเรา", "เราเป็นเจ้าของ ig. สมัยเรียน ป. ตรี ที่ แม่ฟ้าหลวง เพราะฉนั้นลายก็เป็นของเรา ไม่รู้ว่าเธอไม่ทำเป็นหลานชาวบ้านตอนไหน", "เดี่ยวเอาลายสักรูปลูกศรชีลงให้ดูนะ เป็นคนออกแบบสมัยเรียนเป็น นศ. ปีสอง แล้วก็ลงไว้เป็น รูปโปร์ไฟล์หน้าจอไว ไม่เคยให้ใครเป็นการส่วนตัว", "แบนผลงาน โจอี๊บอย ทุกงาน ทั้งงานการแสดง งานร้องเพลง งานรายการเดอะว๊อย และ งานเดอะแร็ปเปอร์  วันนี้ประเทศไทยพังเยอะแล้ว จากผลงานมัน", "แล้ววันนี้ เยาวชนก็จะพังเพราะมัน เพราะมัน", "เห็นได้ชัดว่ามันสนับสนุนคนแบบไม่พิจารณาว่า มันจะทำให้ชาติบ้านเมืองพังหรือไม่", "โจอี๊บอย รับคนนี้เข้าทีมไม่ใช่เหรอ หรือจะบอกว่าไม่ใช่ในนี้มีหลักฐานการสนุนการกระทำต่างๆจนเยาวชน เข้าใจผิดใน มาตรา 112", "เธอผู้นี้เป็นคน ล้อเลียนเองก็ต้องรับผิดชอบเอง ว่า หมิ่น พวกกษัตริย์เอง ไม่ใช่ให้ ม๊อมเยาวชนมา เรียกรัฐเรียกศาลถอด กฏหมายมาตรา 112 ออกจาก ประเทศ", "เธอเป็นคนที่ควรรับผิดชอบในการกระทำของเเธอเองเรื่อง ม. 112 ไม่ใช่ให้เด็กหรือเยาวชนออกมาเรียกร้องการ ยกเลิก ม. 112 จากการกระทำของเธอเอง", "คนนี้แหละที่ล้อเลียนรูป สถาบันกษัตริย์ แล้ว โจอี๊บอยก็เลือกเข้าทีมจริงๆ มีการร่วมงานกับคนนี้  คนล้มเจ้า", "رائعة حقا.. شاهدت الفيديو اكثر من مرة رغم انني لا افهم شي 😍", "KFHDFOEFAGFGJFGVCVWDHZ1IIGIDJGKZGDHJDJSPA12KRGGSLDQM", "ตกหลุมรักเทอตั้งแต่ครั้งแรกที่เห็น", "No offence but that seemed cringe to me....", "Love from Nepal but I am not understand song l am love this song", "Pearja 🤍", "เก่งสุด", "her energy level infinite 😶", "Love you.☺️🇱🇰🇱🇰🇱🇰", "Wanna listen full song in her voice .... Badass girl ... Rocked the floor....... 🔥🔥🔥🔥", "Omg love tish songs and styel", "There's no English sub 🤡", "Grande", "I love ariana", "Her moves attitude and styles are nextlevel", "I am emma hessters", "😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😪😎😎😎😎😎", "I love this song", "Alguien que me diga como se llama el modelo de su pantalón...", "More", "I love her confidence and attitude... Amazing", "Understanding not but enjoying more more like this video", "Better than the original", "WOW", "This is not an audition\nThis is a f'ckng concert!!😱😱💯", "Very nice voice... And nice song.. From Bangladesh 🇧🇩🇧🇩🇧🇩", "Lovely voice ❤️\nLove from India 🇮🇳❤️", "Ft👍👍👍👍👍👍", "ෆට්ට කෙම්ලෙ", "Omg ❤❤❤❤👍👍👍", "What a performance........😘😘😘", "I like it  \n0 understanding\n100  enjoying", "Mind-blowing", "Wow so super", "Hard singer", "She sang much beautifully than the original studio version. 😎", "*WHO ARE WATCHING THIS VIDEO IN 2021🥰🥰*", "Good", "Legends are listening this masterpiece ❤👌👍 after 1 years", "😱😱😱", "Wooooooooooo\nhttps://youtu.be/T6163YIaN4U", "Watching from Nepal🇳🇵🇳🇵🇳🇵🇳🇵", "Love from Alaska!! I like this more than the original!!", "Love From Bangladesh", "Chhaang chaaang chhungchhung taaki saaki baaaki but op", "มีใครขนลุกบ้างต้องใส่หูฟัง", "Love THIS song 🎎♥️💕", "Her style is so amezing", "เมนท์ไทย หาย", "I love her song a lot 🎊🎊🎊🎊🎊", "OMG......I love her style.😱", "she just oozes sex appeal ..", "মন ডা চাইতাচে তোরে উল্টা কইরা ওছাই", "555🤣🤣🤣😎", "I just understand😂 taki taki but it was amazing❤❤", "OP 👍", "Hi", "TeT", "Amzing voice ❤️‍🔥❤️‍🔥 from sri lanka", "I can feel his energy \nHis voice is amazing \nIts rapp", "Vamos españoool!!! Wow 😍 cantó y bailó asombroso, como lo haría una latina! 😍", "Wow🥰🥰🥰", "عالی بود واقعا خیلی حال کردم\nصداتم عالیه🦄🦄", "this is one of the worst audition.", "Her attitude is just in another level.She rock the stage.", "👎👎👎👎👎👎😡😡😒😒👎👎", "ខ្ញុំលកម្ពុជាបានធ្វើឲ្យមានការចូលរួមពីសំណាក់ប្រជាពលរដ្ឋនៅក្នុងការធ្វើដំណើរទៅកាន់ទីដែលព្រះអង្គទ្រង់ត្រាស់ថាម្នាលភិក្ខុទាំងឡាយតថាគតអនុញ្ញាតឲ្យភិក្ខុនោ🇹🇭💗🤝💗🇰🇭 LOVE Taylan", "🇧🇩🇧🇩🇧🇩🇧🇩✔️❤️", "Best version of taki taki", "กีสสสสสส คอนเสิร์ตชัดๆๆๆ", "What is her name?", "She is damn savage...she rocked the show❤️", "So sweet your voice and style", "🔥🔥🔥🔥🔥", "গানের শেষে হাসিটা কিন্ত দারুন ছিল", "love much ❤️❤️❤️", "Amazng", "Loves from Bangladesh 🇧🇩.. I listening this song thousands time.. Love you", "Necesito un pantalón como ese 👍👍👍😜", "fully enjoy her song", "Love that", "🤮🤮🤮🤮🤮🤮🤮", "คอมเม้นฝึกภาษามากกกกก", "Oh my god her style and song is very very very nice", "She did Ozuna,Cardi line so well", "Waw ❤❤😍😍😍🎶🎶", "She just rock the stage love it  😍😍😍😍👏👏👏👏👏👏👏", "Vocals not so good but the energy and sass makes up for it.... Very nice performance.", "Le salió bien 🤩🤩", "What's her name??", "What's her name???", "รู้สึกว่า เสียงไม่ค่อยเพราะอ่ะ ส่วนมากเพราะดนตรี ความคิดส่วนตัว😐", "Wow!!💖🔥🔥", "ชอบแพร", "Dman it she literally nailed it bruh", "ดูรอบที่ล้านแปด เหมือนเปิดคอนเสิร์ตเลยง่า", "I'm from India but love this girl voice 😘😘", "Well her name is pearja", "Can any one write her name in english", "Sủi ma 😀", "FANTÁSTICA!!!!!!!!!💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜", "Name  😎😎😎😎😎😍😍😍😍😍", "It’s not a audition, It’s a concert", "me encanto esta chica", "wow 😍😍 im from nepal", "Se siente bien se la única persona que entendió la canción jaja", "I hv never seen this kind of energy,this kind of enjoyment during performing the song ....omg what a masterpiece ❤️❤️🔥", "Rocksssssssssssssssssssssssssss🔥🔥🔥🔥", "เหม็นหน้าอีคิ้ม", "i really want her as an idol may she will become a rockstar  of the world we love you", "Love ♥️♥️♥️", "ສຽງມ່ວນຈັງເລີຍ", "It's amazing 😁😁", "I love song taki taki rumba", "Who can not agree  after that speech. Btw  she is talented..i wish i knew the language", "สักวันผมต้องดังครับ😢😢", "I wish I could have that confidence", "Perfect performance", "His confidence is better than when selena was singing", "OMG I'm big fan OMG of girl her style her singing style dance style 😍😍😍😍😍😍😘😘😘😘", "Love from India🇮🇳🇮🇳", "น่ารักมาก หลงรักเลย", "จะผ่านมากี่ปี่แล้ว ก็กลับมาดูเรื่อยๆไม่มีเบื่อเลยค่ะ\n#รอติดตามผลงานอีกนะคะพี่แพรจ๋า🥰", "What shes name", "😲 😳 wow", "Nise song", "Not audition it was a live performance", "Wow! She's so amazing.  All the best  , beautiful! I live here in the UK and  I got lots of Thai friends!", "😛😛😑😑😑🤣🤣🤣👎👎🤮🤮🤮🤮🤮🤮🤮🤮🙀", "It is very nice 👏👏👏👏👏👏👏👏", "Bu delimi neee", "เสียงเธอดีกว่าตัวจริง ฉันรักเธอ🥰😍🤩", "Colombia here🙋🏻Latin gang everywhere 💪🏻🎶", "What's her name? This girl is a Rockstar. <3", "หน้าอย่างเหมือนพี่ยูอะ", "I love this song 💗💗💗💗💗💗💗💗💗", "Fire", "მაგარი  ხარ😍😍😍😍😍", "Love from India ❤️❤️", "All the world singer has same type voice not great range like dimash dimash is on a another probably the greatest vocalist singer of all time", "Omg i love her style", "❤🙏", "I actually have crush on her abilility to rock the stage", "It's actually like her Concert", "I like this song", "Yo ni sabía que en Tahilandia se oía éste tipo de música... esa es Puertorriqueña nacida allá, que locura", "I just can’t any single word but I enjoyed 100000000000% well🔥", "โคตรมันส์สุดยอดเอนเตอร์เทรน", "😳😳😳😳", "Wow", "OMG she is amazing and I love her style", "O wow beautiful", "Next level voice", "OMG I REALLY LOVE THIS SONG", "Wow...Wonderful💙", "Whoooooo \nWonderful", "Judges got Balcony ticket", "Wow.... 🙌✨", "สวัสดีประเทศไทย", "Staaaaaaaa", "Awesome song", "OMG.love you.", "amazing 👌👌", "Understanding = o%\nEnjoying = 100000 %", "Pislik", "Banana", "Understanding 12% enjoying 1000)000000000000000%", "I don't understand but I injoy ❤️🇮🇳", "She sang this song 1000% better than the originals.", "Vi todo el video aunque no entendí ni madres!", "สุดยอดๆๆๆๆ", "I am from India  but I love her style ❤️❤️", "Omg I like you are style", "😻😻😻😻😻😻😻🥰🥰🥰🥰🥰", "So good voice she is a rock she is self depent she needs anyone at all . She is outsanding singer", "I like dice...., hahhaa", "This was really waste", "รักแพจ๋า", "நான் தமிழ்நாட்டை சேர்ந்தவன் இந்த பாடலை விரும்புகிறேன்", "Omg her voice is so hip hop", "Esta mujer me enamoro de este tema suena mejor que el original \nQue bien 👍 😊 🇨🇴", "She is way too confident , The moment when she moved her hip , just killed", "Can i get it in Spotify 🥺", "❤️", "Really amazing keep it up❤️", "ME GUSTO EL ESTILACHO DEL INICIO DE LA CANCION! SEVERO FLOW TIENE LA CHICA CANTANDO EN ESPAÑOL. FLECHAOO OMEEE", "Understanding-0%\nPerformance-100%\nEnjoying-10000000000%\nLove you 😍💗💓💛♥", "👍👍👍👍👍👍👍❤❤❤❤❤", "คาแรกเตอร์เขาดูมีเอกลักษณ์มาก", "owned that stage", "ชอบเลยยยย", "This one of my absolute favourite cover of anything period", "Taki taki my favorite gaan", "Her giggle is everything. Love it ❤", "This Singer name..?", "I LOVE HER STYLE WOW WOW", "Omg\n🙋🙋", "😀😀😀😀😀😀😊🙂", "<\\\\\\ SO MUCH INCREÍBLE EXCELLENT WORK>>>>>>>>>>>", "Bala song boluchhu", "Omg loooool let’s go taki taki", "She was so cute", "Omg", "Taki taki rumba\nAmazing", "What is your name", "She rocked and judges shocked\nUnderstand-1%\nEnjoy-99%", "Not able to understand but enjoying very much and I like her style also I speaking in Thailand language but I don't Thailand language", "ممم", "Oh whoa....!!! DJ Snake would be applause her.\n💜💜🇮🇳🇮🇳", "Best song 👌👌👌👌", "She is really amazing 🤩", "OMG YOU ARE FIRE! 🔥\n🇦🇷ARGENTINA HERE🇦🇷\nCONGRATULATIONS!!!", "I love her style very much what a amazing song thanks for this amazing song 😀😀❤️❤️❤️🎉🎉👍👍😇🎉✨🌟👩👌🎊😃", "Boom 💥 💥", "Love from india❤️❤️❤️", "vmkfvjfdbmkgbijfgjbdkmrmvoekgktrgrtmgviurmthpl[nokhdgokb", "What's her name ?", "I LIKE HER SMILE...", "sawadikhap", "Nice", "Omg l like her voice and style 🗣♥️😎", "I lop her style and performance 😍😍", "0:35", "0:34", "Wooooooooooooooooooooo we", "I like your 👗 👗 dress amazing voice super I like it super iam a girl super I like your smile in end", "Idk if this Loud pack got me trippen or what, but I swair i understood her language the last 60sec", "Verdade,entendi tudo,eu era o palco☺", "She rock and i was shocked", "❤❤❤❤❤❤❤❤❤❤❤", "My favourite song taki taki song 😍😘😘🤩🤩🥰👏👌 song favourite song", "I love thailand.\nBirth place of blackpink lisa❣️❤️", "Very nice😍😍😍😍😍🤩😘", "ฟังแล้วฟังอีก", "So good song", "กดเข้ามากูนึกว่าเดอะวอยซ์ต่างประเทศ", "omg i love yuo", "Rock", "She is like Indian sharmukh priya", "555", "What is her name..? Does anyone know if she has YT Or IG.. ?", "T mi", "I love her voice", "I love your voice", "Omg❤", "And I'm on repeat mode👍😍🎧🥁❤️💃😍", "Nice I love  her song", "นี่ใช่เดอะวอยซ์ไทยแลนด์ไหมเนี่ย คนไทยหายไปไหนหมด นึกว่าเข้าผิด", "❤️❤️❤️ wow ❤️❤️❤️", "Wanna perform like this one day😍", "Fun fact 😁 - she made her blind auditions into concert 😝😝😝", "What a talent", "Æ ÅD0", "Taki taki❤👌", "ฟังแล้วขนลุก!!", "No", "I love this song", "🤘🤘🤘✌✌✌", "👏🏼😳สวดยอดๆๆๆๆ", "Wow 👏😮👏😮👏😮👏😮 super 👏😍👌🙌❤😳👏😍👌🙌❤😳👏😍", "Very very very Fabulous", "เสียงหัวเราะท้ายเพลงอร่อยมาก5555+++", "Too good", "This is was concert", "she is so pretty 🤩", "So much better as the original song. Great talent", "wow 👌👌💞💞😍😍😎😎😎😎😎😎😎👍", "বিয়াদপ", "Supperb voice yar i am enjoying this song", "Big fan", "She's so good", "เม้นท์เยอะมากน้องแพรดังสุดๆ", "Can anyone explain this conversation in English👆", "ขอโทษที่กูโดดเรียนอังกฤษ😭😭", "My favourite song gauri", "Fducudfi we ig", "1:05 & 1:12 my favourite part 😘😍😍😍💘💘💘💘", "I am from india \nUnderstanding -0%\nEnjoyed -1000000000%", "Op love for nepal big fan", "Selena gomez : taki taki\nNeha kakkar: saki saki \nMy exam : baki baki\nMe : rumba\n My mom: ye ladki pagal hai\nMy dad: lut gaye\nMy bff  : meri tho koi feeling he nahi hain 🤣 😂", "I got goosebumps", "كاش عربي مرة من هنا صلو على نبي محمد وعلى اله وصحبه اجمعين", "She Rock🤘 the show", "So sakxe❤️❤️❤️❤️", "Her style is soo pretty", "I am from　じゃぱ", "Khæ chān chxb man😍😘😘"]