["Who can only sing sam Smith's songs and not sound dumb af", "Still in 2020", "Me: *sings the first line*\nAlso me: this ain´t it", "Welcome to 2020 like button\n⬇️", "crazy russian hacker", "Just means we gotta get better and more confidence", "Hi guys I hope you wouldn't mind checking my cover of this song 🥺", "Don't know about my babe......  😜\nBut......\nMy neighbours🏠 certainly thinking about me being crazy🤪🤪🤪🤪..... While trying  to match d song with such low & high notes...... 🥵🥵🥴🥴🥴😂🤯", "Sight!I'm not the only one", "Amo", "this is how we bingham", "I started crying while singing because this hit home damn", "I really wanna do a cover, but... It would be too embarrassing for me to do it ><", "Hehehe i can hit the highnotes dohh😂✌🏻", "I feel like I'm the only one in the comment section that can sing this song", "Amazing 😍💖", "This really humbled me", "*me looking through the comments confused because I can hit all the fucking notes*", "Am i the only female who can sing low and high in this comment section? I been hearing from other females that it's hard singing this song yet I'm a soprano and i can sing the low parts.", "1:22", "A new disease in my town called Idiotic\nEvery pretty lady in my city got it, point blank\nPeriodically empty seats, dine at Ciprianis\nLike Beyoncé they're getting by or they get embodied\nSo Sasha Fierce, a whole lot of tears\nRolling down her cheeks, crying 'til she's sound asleep (sleep)\nPreach (preach), pray (pray) that today is not a lonely one\nYou gotta know you're not the only one\n\n[Sam Smith:]\nYou and me, we made a vow\nFor better or for worse\nI can't believe you let me down\nBut the proof's in the way it hurts\nFor months on end I've had my doubts\nDenying every tear\nI wish this would be over now\nBut I know that I still need you here\n\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\nYou've been so unavailable\nNow sadly I know why\nYour heart is unobtainable\nEven though God knows you have mine\n\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\n[A$AP Rocky:]\nWe all guilty of the same crime if you ask me\nI might've had a couple women at the same time\nBut she can't do the pressure, Jack Daniel's for breakfast\nA cap of Valium mixed with antidepressants, precious\nMy momma said that we need love\n'Til I found out life's a bitch with no prenup, you're on your own\nDivorces or court splits, decisions and choices\nThe Porsche or the fortress? Ignore it or forefeit\n\n[Sam Smith:]\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\nI know I'm not the only one\nI know I'm not the only one\nAnd I know, and I know, and I know, and I know, and I know, and I know, know\nI know I'm not the only one", "Takes practice takes confidence it takes years for some people once you get used to it it's no big deal a room full of people is just like any other room full of people just be confident in what you doing", "2020 anyone??", "https://youtu.be/2bjpiIsrCJY", "Awesome", "Quarentena ta fazendo tanto efeito", "M", "Omg", "Please do #My only one \nSebastian yatra", "No", "i can only sing the high notes i suck at the other parts", "Practicin riff and runs with this anybody else?", "Hi, may I use this for a contest, please? 😌. It's an online contest, organizer will upload it on YouTube.", "Thank you so much!  I made a cover of this song on my channel! Thank you ! :D Don't hesitate to check it ❤ ❤ ❤", "Who else just went to an empty and sang then acked like nothing happend😪😂😂😂😂(I meant empty room)", "I´m good singing by myself but when I play the music everything sucks!! :'(", "I did a piano cover for this song! If you wanna support me, please check it out💕💕💕💕", "I sing really good but in front of people I am really bad😂", "No I am to", "✌🏻", "thank you, I covered this !", "all time fave", "yessss", "2020...", "I know I’m not the only one who is sorry for their neighbors", "Thx for the karaoke It's really awesome", "I learned that people leave. Even if they have promised a thousand times that they won't.", "1:17", "No I am too :( :)", "LOVE FREE ❤️❤️😍😍😍 kareoke", "I hit the low notes pretty good but im not good on the high note parts", "💁2020?", "This is *R E A L L Y* hard to sing", "We will have our School competition at Friday. This song Motivates me.", "L597987", "Mother may I sleep with danger, please\nIt's been knocking on my door since I was seventeen\nOh, oh, and you saw but you choose to ignore\nBut now it's more than a wish, it's a dream\nNow I don't understand how you can hold me back\nYou said \"Baby learn your lessons when you step on cracks\"\nOh, there's no time to fall, existence would call\nAnd see experimenting\nAnd I guess there's just no other way\nI've been drawn to a new escape, ay\n'Cause I'm wearing bamboo and I'm picking up zoots\nI've slipped away\nNow I'm tonguing on a Rizla\nAnd you sachi snows a deal for us\nOh, and dangers got me wrapped up 'round his thumb\nBut it's no trap 'Cause I'm in love\nI said I'm in love\nI said I'm in love\nYeah oh oh oh\nI said I'm in love\nI said I'm in love\nLove\nMother may I sleep with danger, please\nIt's been knocking on my door since I was seventeen\nOh, oh, and you saw but you choose to ignore\nBut now it's more than a wish, it's a dream\nNow I don't understand how you can hold me back\nYou said baby learn your lessons when you step on cracks\nSo no, there's no time to fall how you go, oh\nI get what I want, you see\n'Cause I like to tread so carefully\nAnd you won't, won't, won't, won't ever know\nSo mother may sleep with danger, please\nIt's been knocking n my door since I was seventeen\nOh, oh, and you saw\nBut now it's more than a wish, it's a dream", "I know I'm not the only one. 😟", "Am I the only one that can sing the low notes?!", "I can’t hit it haha", "Hi guys! I just covered this song in my bathroom, hop over to my channel and give me some notes! Really, I just started singing publicly and would love to get better <3 Have a great day!", "Well i cant sing high lol", "mom threw a flip flop at me and yelled STOP UR GIVING MY EARS CANCER ;-;", "key down please", "Please do Hallelujah by Oh Wonder", "I sounded like a dieing bird tie hole time singing", "hakdog", "I didn't really know the first part but when I got to different lyrics it got easier to sing", "Letra:\r\nTu y yo frente a Dios\r\nJuramos tanto amor\r\nEsto es mas que decepción y la prueba esta, el dolor\r\nPor tanto tiempo lo dude \r\nMis lagrimas negué\r\nQuisiera que acabara ya pero dime que haré si te vas\r\nDime demente pues crees que no se lo que has hecho \r\npero es tan evidente entre tu y yo hay alguien mas \r\ntan cerca pero lejos \r\nEntiendo todo ya\r\nEh perdido todo tu amor\r\nPero tu tienes mi corazón\r\nDime demente pues crees que no se lo que has hecho \r\npero es tan evidente entre tu y yo hay alguien mas \r\nEh dado todo de mi \r\nTal ves no basta mi amor\r\ndescubriste miedo en mi ehh\r\nMintiendo, destrozando noo\r\nDime demente pues crees que no se lo que has hecho \r\npero es tan evidente entre tu y yo hay alguien mas x2\r\nohh no no ohh no no ohh no no ohh no no ohh no no x2 \r\nentre tu y yo hay alguien mas.", "Vietnam be like...", "Thank you for this instrumental! I covered it!♡\nhttps://youtu.be/2R0F1NModwc", "2 likes and I will do will a cover of this song...\nEdit: I am good singer btw", "Hahahahahahaha *im crying\"", "Jesus loves you very much even if you don't believe it", "I can’t hit the high notes on: “you... SaY Im CrAZy!!!!!! I can only hit the low notes and im a girl!!!", "Hey guys, I've made a cover:\nSam Smith - Not The Only One (Cover by Nishit Tarantula)\nhttps://youtu.be/ForQwv-_ANE\n\nThis cover n' my all other covers I did before are not perfect but I'm Evolving as it's my *Music Evolution* ♡😊\n*Please watch this*\nMy channel - Nishit Tarantula\nVideos - Science (Specially physics), Music (My covers n' Sabrina Carpenter's Lyric videos!) ♡😊", "they literally have the best voice and its unbeatable. Like, literally none of us have a better voice than them. Sorry! <3", "Poprostu to jest najlepsze", "well i know i can sing so not a problem for me", "nice song", "coming back to this after a breakup, extremely thankful I'm an alto", "i’m actually very good at singing this", "Whenever I sing along with Sam I sound good... but then... Sam I need you", "RINGKASAN\nLIRIK\nDENGARKAN\nREKAMAN LAINNYA\nORANG LAIN JUGA MENELUSURI\nYou and me we made a vow\nFor better or for worse\nI can't believe you let me down\nBut the proof is in the way it hurts\nFor months on end I've had my doubts\nDenying every tear\nI wish this would be over now\nBut I know that I still need you here\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\nYou've been so unavailable\nNow sadly I know why\nYour heart is unobtainable\nEven though you don't share mine\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\nI have loved you for many years\nMaybe I am just not enough\nYou've made me realize my deepest fear\nBy lying and tearing us up\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one", "This is so fun", "Bro i dont even know this song but like i wanted to see if i could use it for the song im writing buttttttt that didnt work out so well", "Can you please do a karaoke version of isabela merced’s “I’ll Stay” 🤩", "You and me we made a vow\nFor better or for worse\nI can't believe you let me down\nBut the proof is in the way it hurts\nFor months on end I've had my doubts\nDenying every tear\nI wish this would be over now\nBut I know that I still need you here\n\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\nYou've been so unavailable\nNow sadly I know why\nYour heart is unobtainable\nEven though you don't share mine\n\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\nI have loved you for many years\nMaybe I am just not enough\nYou've made me realize my deepest fear\nBy lying and tearing us up\n\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one", "I literally came to work with my grabdma just so I could sing this song in the echo room 😂😂", "Adoro essa música", "Noce", "1:17", "Here's the piano part so you can play along!\nhttps://youtu.be/meQZK_NqP2c", "Tu y yo Prometimos para bien o para mal, creo que me has desepcionado , la prueba esta en como duele, por meses he estado con dudas negando cada lagrima, desearía que eso se acabará , pero se que te necesito aquí\nDices que estoy loca porque piensas que no se que haz echo, pero cuando me llmas amor se que no soy la única\nTu haz sido tan infiel y ahora se porque tu corazón es inalcanzable a pesar de que el mio no compartes \nDices que estoy loca porque piensas que no se que haz echo, pero cuando me llmas amor se que no soy la única\nYo te he amado por años tal Vez no fue suficiente me he dado cuenta de mis miedos tus mentiras nos hacen más daño 🎶🎶😪", "Sám smith im nôt the only one this is the bešt one but i čant sing et👌😞❤️❤️", "Playing it at 2x makes it seem like a happy song", "For a girl my voice is really deep but those Low notes.....jeez.", "It’s so funny how ill always come to this channel when my parents aren’t in, and then the moment they come back I’ll turn it off. I love singing so this channel is lush 💞💞", "Not throwing shade but can you not change the music like in every video it's either a little higher or lower and it doesn't sound right", "I like this beat more better than the real song beat", "so I know that I'm Not The Only One who can't sing this song with low notes 😅", "Anyone still here in 2019?", "I ruined a perfectly good song when I sang it....sorry guys lol.......T^T", "Godbim gay", "I nailed this on my Bathroom", "[Verse 1: A$AP Rocky]\nA new disease in my town called Idiotic\nEvery pretty lady in my city got it, point blank\nPeriodically empty seats, dine at Cipriani's\nLike Beyoncé, they're getting by or they get embodied\nSo Sasha Fierce, a whole lot of tears\nRolling down her cheeks, crying till she's sound asleep\nPreach, pray that today is not a lonely one\nYou gotta know you not the only one\n\n[Verse 2: Sam Smith]\nYou and me, we made a vow\nFor better or for worse\nI can't believe you let me down\nBut the proof is in the way it hurts\nFor months on end I've had my doubts\nDenying every tear\nI wish this would be over now\nBut I know that I still need you here\n\n[Chorus: Sam Smith]\nYou say I'm crazy\nCause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\n\n[Verse 3: Sam Smith]\nYou've been so unavailable\nNow sadly I know why\nYour heart is unobtainable\nEven though Lord knows you kept mine\n\n[Chorus: Sam Smith]\nYou say I'm crazy\nCause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\n[Verse 4/Bridge: A$AP Rocky]\nWe all guilty of the same crime\nIf you ask me, I might've had a couple women at the same time\nBut you handle the pressure, Jack Daniels for breakfast\nA cap of valium mixed with antidepressants, precious\nMy momma said that we need love\nTill I found out life's a bitch with no prenup, you're on your own\nDivorces or court splits, decisions and choices\nThe Porsche or the fortress? Ignore it or forefeit\n\n[Chorus: Sam Smith]\nYou say I'm crazy\nCause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\nI know I'm not the only one\nI know I'm not the only one\nAnd I know and I know and I know and I know and I know\nAnd I don't know\nI know I'm not the only one", "és lindo! amote", "Wow this is cool", "I just uploaded a cover using this instrumental. Your videos are bomb! Thanks for sharing. ❤️https://youtu.be/-qIE265QMr4", "25 likes and I’ll do a cover", "Why am I even trying to sing with a broken voice?", "if i get 30 likes i’ll post a cover on my channel of this song!!🥴", "Next: \nA video of everyone who tried to sing along with this karaoke", "satnam satnam keh o bandey diljit dosanjh ka karaoke banao bhaai please diwali se pehle", "Por que lo engaño", "I’m so sorry for my neighbors😂😭", "나는야 한국인", "Bestttt ❤️❤️❤️❤️", "You and me we made a vow\nFor better or for worse\nI can't believe you let me down\nBut the proof is in the way it hurts\n\nFor months on end I've had my doubts\nDenying every tear\nI wish this would be over now\nBut I know that I still need you here\n\n#\nYou, say I'm crazy\n'Cause you don't think I know what you've done\nBut, when you call me baby\nI know I'm not the only one\n#\n\nYou've been so unavailable\nNow sadly I know why\nYour heart is unobtainable\nEven though you don't share mine\n\n#\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n#\n\n\"\nI have loved you for many years\nMaybe I am just not enough\nYou've made me realize my deepest fear\nBy lying and tearing us up\n\"\n\n#\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\nand I know I'm not the only one\nand I know I'm not the only one\nand i know (6x) now\nand I know I'm not the only one", "100 likes and ill do a cover", "This song is gonna be my american idol audition ^_^", "Nothing was the same since you went away everything has been a fade i need to meditate but you who i cant get away reminisce them days like it was yesterday and i been ashame to been afraid to say what i never get to say wish there was another way i guess theres another day to express and say what i procrastinate", "Nothing was the same since you went away everything has been a fade i need to go and meditate but you who i cant get away reminisce them days like it was yesterday and i been ashame to been afraid to say what i never get to say wish there was another way i guess theres another day yo express and say", "Nothing was the same since you went away everything has been a fade i need to go and meditate but you who i cant get away reminisce them days like it was yesterday and i been ashame to been afraid to say what i never get to say wish there was another way", "Nothing was the same since you went away everything has been a fade i need to go and meditate but you who i cant get away reminisce them days like it was yesterday and i been ashame to been afraid to say what i never get to say wish there was another way i guess there's another day to express and say that was hard to face", "Nothing was the same since you went away everything has been a fade i need to go and meditate but you who i cant get away reminisce them days like it was yesterday and i been ashame to been afraid to say what i never get to say wish there was another way", "How to sing like Sam Smith:\n1. Try to yawn while you sing.. That will make you sound like Sam Smith and also make it easier for you to hit the higher notes\n2. Enjoy", "Im a goat", "Im scared to sing this wit my headphones on bc my neighbors but fuckkk it duddeeee", "Is someone not able to hit low notes but hits high notes well", "Imma do a cover I'd half of the song can anyone check it out when  it's up?", "I used to hate myself for never being able to hit the low notes. But now that I'm a few years older, I can hit them with ease.🤗", "replay by iyaz plz", "All these comments are about not being able to hit the low notes ummm I can’t hit the high ones !!! WTH", "Love this song soooo much.. so touching. One of my favourite songs so I covered this! Love your music also!", "Congrats 6millino subscribers", "... quién más quedó ronco después de cantar esto? :'''v por eso calienten, niños", "Hell yea!!", "I can’t hit the low notes so I just sing it up the octave. It’s kind of high but I’m a soprano so it suits me better😂", "When this girl can sing the 2nd lowest octave", "100 likes 1 cover", "R❤", "Finally a song I can sing to without sounding like a dying frog yayyy now I sound like a dying cat so progress ppl PROGRESS😌😌", "Click on the photo u will hear me sing but not this song", "this so is asf!!! sad!!!", "may i have the palace of sam smith :)", "I am 11 years old I am in chorus I am in middle school I love to sing", "I sing this whole thing in the octave down but damn... When I go from baritone voice to falsetto... the transition is killing me here 😂😂😂", "*r e l a t a b l e*", "This is my voice practice karaoke video thanks a lot Sing  King 👑", "The memories of year 4", "Dang my mom caught me singing beautifully and posted it shit!", "Fall - Justin Bieber!! Pleasee!", "DO STRINGS BY SHAWN MENDES PLEASE!!!!!!!!", "can you check out my Cover and tell Me what you think?", "SUPER", "I'm doing this song for my school dance on Friday. Wish me luck! BTW, I'm 9.", "👌🏻", "this song is crap from kai", "i love the effort that you have made to make music fun again :) but could u please get rid of that annoying noise during the beginning of the video pls and ty, i use your channel for my quiet time as well as singalong time.", "Three years ago", "Sing king karaoke", "Anyone listening from 2016/2015", "[Verse 1 - A$AP Rocky:]\nA new disease in my town called Idiotic\nEvery pretty lady in my city got it, point blank\nPeriodically empty seats, dine at Ciprianis\nLike Beyoncé, they're getting by or they get embodied\nSo Sasha Fierce, a whole lot of tears\nRolling down her cheeks, crying till she's sound asleep (sleep)\nPreach (preach), pray (pray) that today is not a lonely one\nYou gotta know you not the only one\n\n[Verse 2 - Sam Smith:]\nYou and me, we made a vow\nFor better or for worse\nI can't believe you let me down\nBut the proof is in the way it hurts\nFor months on end I've had my doubts\nDenying every tear\nI wish this would be over now\nBut I know that I still need you here\n\n[Chorus - Sam Smith:]\nYou say I'm crazy\nCause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\n[Verse 3 - Sam Smith:]\nYou've been so unavailable\nNow sadly I know why\nYour heart is unobtainable\nEven though God knows you have mine\n\n[Chorus]\n\n[Verse 4 - A$AP Rocky:]\nWe all guilty of the same crime if you ask me\nI might've had a couple women at the same time\nShe can't handle the pressure, Jack Daniels for breakfast\nA cap of valium mixed with antidepressants, precious\nMy momma said that we need love\nTill I found out life's a bitch with no prenup, you're on your own\nDivorces or court splits, decisions and choices\nThe Porsche or the fortress? Ignore it or forefeit\n\n[Chorus]\n\nI know I'm not the only one\nI know I'm not the only one\nAnd I know...\nI know I'm not the only one", "😢😢", "Would you be able to do instrumentals on songs from the fox series EMPIRE? They have some good tracks like \"Up all night\" , \"Mama\" and \"Looking for you\" by Jussie Smollette and so many others like Chasing the Sky by actor Terrace Howard, Jussie Smollette and Yazz... thank you... it would really be awesome", "hedley 17", "Play at 2x speed it sounds like a happy song.", "Too good at say goodbyes :((", "😪😪", "This is awesome ....", "When you sing soprano and this song makes you sing tenor too😂", "Ik this is deffinately my Britains got talent song if I get through obviously 💛😀", "Am I The Only One Who Can Sing The Whole Song 🤔🤣👏🏽", "Friend : Who's your bias in (any kpop group?) \nMe : (specific name,, but in my mind all of them 😂)\nBias: I know im not the only oneee😂😂\nOnly kpoppers will understand lol😂\n❌(no bashing)❌", "Can you do bridge of light kareoke it's a really popular song but there's no kareoke for it", "I can't hit the low notes☹️", "$$$$", "that moment that you realize that you can only sing the chorus cuz you can't do the low vocals 😂", "I LOVE THIS SONG", "One of my friends made me their personal radio because they like my singing voice  lol", "I tried it 😔😂😔😂", "Ministry of healing health and happiness", "Does anyone else when they click on a karaoke sing the part they know? Like when I clicked on this I sang I know im not the only one. Before the video had even started XD", "Linda musica , gostaria de ouvir cantada", "Why is this a love song?", "i hit i cant red", "am I the only one that kills the verses but butchers the chorus?", "I have a low/neutral voice and I'm a girl so it works out", "Hitting those low notes perfectly but struggling af on those high ugh", "me: (sings like a dying llama)\nfriend: who sings that song?\nme: Sam smith\nfriend: lets leave it that way\nme: f u 😭😒😒", "pls tell me how to download it.", "its so nice to sing along 😂", "I cant sing😭😭😭", "try mixing up some of sam smith's stay with me and I'm not the only one :)", "that last verse Lord I always cry I can't even get the damn word out and tears lol ima punk", "Shit!", "umm......love it......my neighbous are mad at me now❤❤", "im a girl and i HATE how my voice is low. i can sing low notes perfectly,  but i cant really transition to my head voice,  and im horrible at songing high notes😬", "LOL ( ͡° ͜ʖ ͡°)", "Gghgh high", "Wiernym i uczciwym być\nPrzysięga brzmiała tak.\nJak długo chciałeś się z tym kryć?\nTeraz ból dusi mnie, to trwa.\n\nWmawiałam sobie, to nie tak\nZbywałam każdą łzę\nBez ciebie żyć mam nie wiem jak\nChociaż żyć bez ciebie już chcę\n\nJa wiem i milczę\nRozchwiana jesteś, słyszę co dnia\nJa wiem, że mówisz kocham,\nLecz słyszę to nie tylko ja\n\nTak nieobecny stoisz tu\nPrzyczynę teraz znam\nNie dla mnie twego serca puls,\nChociaż ty miłość mą wciąż masz\n\nJa wiem i milczę\nRozchwiana jesteś, słyszę co dnia\nJa wiem, że mówisz kocham,\nLecz słyszę to nie tylko ja\n\nTyle lat byłam twoja, lecz\nBałam się, że przyjdzie ten czas\nI ciałem stał się największy lęk\nRozdarłeś co łączyło nas\n\nJa wiem i milczę\nRozchwiana jesteś, słyszę co dnia\nJa wiem, że mówisz kocham,\nLecz słyszę to nie tylko ja\n\nJa wiem i milczę\nRozchwiana jesteś, słyszę co dnia\nJa wiem, że mówisz kocham,\nLecz słyszę to nie tylko ja.", "why the fck are they making a song like this, I almost lost broke my throat and lungs.", "I'm like boss", "Oh god, i'm just 11 and i Think i just rocked this song😂... Yeah, im sure not tho.....", "literly, i am so good at singing", "I'm not the only one part 0", "brasileiros?Nós estamos espalhados pelo youtube😂😂😂😂", "this song is so easy to sing", "20 likes and i'll do a cover! promise lol if you don't care please ignore hehe", "hi I must say I love the fact that you barely use voices in your work \nso me and my people can say what we want and not get thrown off by the voices, you really know what the people want", "will someone give me sore-throat candy?", "(:", "Your cool", "i love karaoke....sing king karaoke your the best...", "shot for me drake pleaseeee", "Is this in the original key?", "Loool so gooood", "kills the verses, struggles with the chorus. my female logic", "Yes I am awaiting for the weekend to be released my bad days.  This past week.", "micheljackson", "Fantastique et genial", "faithfully by journey please?!?!", "Ten likes and I'll do a cover", "cute", "when he sings\"but when you call me baby\" does he mean she actually calls him or she like refers him like she calls him \"baby\"", "you and me", "All of you people say they can't sing this song, you should come to my place and I'll show you beautiful.", "28 comments for a cover", "Why am I coughing so much trying to hit the notes...I couldn't sing this steady without laughing at the comments because I relate to some of them...I sound like I'm taking my last breaths here 😂😂😂", "you have to train your vice to hit the low notes and high note i did that and now its very easy to sing this song :)", "you can sing this in low-notes as long as you get into acapella or using guitar to sing along with it", "I know I'm not the only Juan", "Not understand yo ser mexicano jaja", "I sound like chewbacca mum", "....Well....I know I just ruin my pets ears cuz I'm home alone and I sound like  a T-rex trying to eat a wood chipper and accidently went inside there and died....I SOUND LIKE MY COUSIN AND THATS VERY BAD", "Yesss", "good I like it", "everyone gets fucked up at low notes cause to get them perfect, we need to sing as loud as possible. which is not really possible for someone in civilized areas. oh btw, big foots can sing this", "Are these the sounds of the Roland SC-88Pro?", "good exercise 4 my voice man", "Thanks for the great karaoke !! with the help of it I did a cover! Please give it one last time on my channel and comment what you found", "Hi all i made a cover of this song would love if u can go and gove it a check would mean alot :)", "Idk if i should cover this...", "My rap remix when I was about 15-16 https://soundcloud.com/cuzimhalfasian/not-the-only-one-rap-cover", "i feel like I'll swallow my throat in low notes.", "I will sing this song for valentines cause I'm single", "I am 10 and if you took away the weird nasal sounds of a blocked nose, I think I would sound pretty good. Or is that just me boasting? 😂", "Say Selena 10 times\nClap 5 times\nPost on 2 videos \nCheck ur voice", "I know I'm not the only Juan...", "Said just got a karaoke machine this Christmas and I sing on sing King everyday", "i can get everything except for the bridge like it feels weird singing it", "can you do how will I know by Sam smith please?", "say selena 10 timesclap your hands 5 and repost this to 2 more songs and then check your voice", "im not the only one", "ilove my song😗", "I lost my voice singing to this 😂", "Can you make a song all I want by Daniel skye", "bbc", "I always used to say to live lovely\nYou have love life and love lively honey\nIt’s kinda funny that after showers\nYou be sneaky over by him, after hours\nAnd that devoured me when I heard that\nThat fact just towers me but I turned back\nWhen I realized that I couldn’t do it alone\nAnd I despise fucking choosing your home\nOver my own \nBut finances looking droughty\nMacDonald’s paying me 5 dollars’ hourly\nYou might say it’s cowardly and money hungry\nBut trust me \nI need some dough, I’m putting it bluntly\nBut not to her though\nShe’s got me sold\nWith her pose, her strokes and her clothes\nThat closely fit her. Should I dispose\nOf my feelings towards this\nBitch that I hate, admire, this queen of the fortress\nBut my hormones spinning, sinning, it’s quite torturous \nBut Lord just \nForgive me for what I done to my deportment \nI look messy now, I’m driving myself drunk\nAnd I’m high as a kite, yet my heart has just sunk\nAnd even after singing these songs, these words, these poems\nMy fucking women continues to blow him\nWell she blows me too, but only off \nAs often as she can, she aint wanna talk\nShe aint wanna fight, she aint wanna fuss\nShe aint wanna try, she aint wanna love\nBut that’s bull-shit, but name it however you wanna\nDesperate, sex-driven, but I’ll never be forced to\nTell you anything, even my friends don’t know\nDon’t even go out anymore. No sense, oh no!\nI just sit at home, and think about you all day\nI wanna kill yuh, but I’m stuck to you \nThe fuck to you\nWhen you saaaaaaaaaaaayyyyyyyyyyyyyy\n\n\nit actually goes with the beat and timing, im proud :)", "Whenever i try to sing i end up wishing i was never born.", "legal", "Say Selena 10 times\nClap 5 times\nPost this on 2 videos\nCheck your voice", "i feel so ruin. 😔", "i feel so ruin. 😔", "hi", "sangat menarik\nsekali\nsaya suka\nsaya suka\nsaya suka kamu", "can you do H.O.L.Y. by Florida Georgia Line in a female key? thanks!", "it's like remix", "Hmm... been thinking about covering this song.", "Nailed it! 😂😂😂👍👍", "Anything you want - You got it. Anything you need - You got it. Anything at allllll....", "good shit", "50 likes and I'll do a cover for real", "Sia the greatest pleasee, i luv yur chaneel", "love this song and I love karaoke", "favorite  song ! 😄😄😄😄", "algum brasileiro tentando cantar em inglês? kkkkkkkkk", "I will be here karaoke", "Panic! at the disco- Bohemina Rhapsody plsss", "kapan nih kemalang", "linda😂😂😂😂", "Can you make BlackPink whistle and boombayah please", "Cold Walter-Justin beber plissss", "I like my kareoke", "i know im not the only one", "Thank you!", "can you do safe with me by Sam smith?", "I used this backing track for my interpretation. Thanks. I gave you a plug on my page. Thanks again.", "much love everyone", "is it possible if u can make a karaoke of PIECES by rob Thomas... TIA", "ur song are damn \nkeep doing em", "singing loudly alone", "u know i am the only one", "you could do better with these karaokes, have a graphic for leading up to the beginning instead of just highlighting the word right away", "J", "Hey guys! I made a cool cover (with a cool video) of this song, it's in my channel, go check it out, it's fun!", "I would like to request BABY I WOULD  by Jasmine Thompson . please notice this. thankyou. Its one of my fav. Lovelots !", "Love this song fits my voice perfect❤️❤️❤️❤️❤️", "it's so hard to sing this 😂😂😂😂😂😂😭😭😭😭😭😭", "* screams the chorus bc I can't sing *", "I love to sing this song thx u are my fav channel for karaoke", "i'm going to compete with this karaoke version of this song! Your karaoke versions of songs are great!!", "awesome kara oke", "Me: *gets sick* \nMe: *intentionally comes to this video so I can sing the low notes*", "I'm singing 6/12/2016", "oke", "I relate this song!!!!!!", "Could you du Chris Daughtry - Waiting for Superman ? (:: Love your karaokes, btw! <33", "Guwapo ni kuya jem", "J", "Did you have We Dont Talk Anymore by Charlie Puth ft. Selena Gomez? Thanks", "say selena 10 times\nclap 5 time \npost this on 2 other videos", "Im not the only one i know :(", "I do my homework to this <3", "I love your channel #singking. helps me out a lot!!\n😁😁😁", "I can hit the low notes. It's great 😂😂", "i like full", "gyvi", "I killed it 😁😂😊", "fith harmony please", "I like this song it reminds me of my heart break with my boyfriend but I still gave him a s\nchance because I love him and because he's everything to me. ppl might say I am to young to understand love but I'm not I have parents who love me so obviously I understand what love is I'm not dumb they taught  me how to love and what love is suppose to be", "+Ugge Ugge same!😂😂😂", "I'm doing this song in choir. Thanks for posting it. Do you think you could do a karaoke version of Homeward Bound by Marta Keen. I have to do it in choir too. It'd appreciate if you do. :)", "I love this song and my voice eek xxxx", "vou cantar ISO na escola", "tae ako", "first of all to sing this song u dont always need High Notes sing it the way U can sing it((: Trust me i cant hit those high notes But sing it and It make it your own style of singing it", "i no i'm not the only \none that love's sam smith. (:(:", "i like that song", "my mom loves. your song", "Struggles to hit low notes, kills The chorus", "you say I'm crazy. but you did it", "make kareoke for gibberish by max", "this helps  me sing", "i don\"t like it but i love it\n<3", "I sound like a dying whale", "i like it", "https://www.youtube.com/watch?v=Yf7v8sAEQjk", "noiceee", "Can you make a karaoke song for - 7 Years by Lukas Graham", "I have always used Sing king for my karaoke use and I find it not useful when I use others. I just wish sing king would bring out their usage of weird people because I've been waiting for that for ages. But as long as they keep sing king going, I will keep using it.", "im a singer and im 13", "im a singer and im 13", "any one who can see sing message me", "John Doe by B.o.B. feat Priscilla", "I did a cover of this song, I tried.. x", "My crush sang this in a presentation 😍😍😍😍😍😘😘😘😘😻 I LOVE THIS SONG!!!!!!!!!!!!!!!!!!!", "+struggles to hit low notes of the verse+ +belts the fuck out of the chorus+", "great Chanel man", "Can you do pillow talk by zayn mailik??", "Singed 5 people dead 1 people injured", "do nothing but trouble by charlie puth! love ya channel btw😋", "☺☺", "+SingKingKaraoke I think you should do karaoke videos with real piano sound :/", "will this be copyrighted if i posted me singing this on my soundcloud?", "please check out my snippet! :)", "love... this side...", "I lovr I love this song so much", "this has gotta be the best for karaoke", "your MIRACLE!", "I love this song", "I like it", "I love you", "i like this song", "Cna i use for a cover please ??", "Good job bro", "omg do john newman easy please! 😍😍😍😍", "Christina Perri - Distance please!!!", "Hi! You can update the song Waving Flags by British Sea Power in instrumental version? thanks!", "Sing king karaoke is the best👍🏻", "you should really do a reggae karaoke version, but this is amazing", "you should really do a reggae karaoke version, but this is amazing", "stay strong by bars and melody", "i really love this ❤", "Say Selena 5 times clap 5 times post on 3 other vids check ur voice", "💩", "tem brasileiro  aqui?????? love", "Love <3", "I just LOVE Sam Smith", "I have a great song for sing king. y'all should do ''twenty eight'' by the weeknd", "thanks! i made a short cover with it, if you want you can check it on https://soundcloud.com/tiararmdhn/im-not-the-only-one-sam-smith-cover :D\nTHANK YOU", "i love this i swear lol", "Have u done seasons?", "skelaekqpwkqwdkalqkaelalewmlakqlamwlaewm", "i sang it... check out my channel if u dont care ahahaha lol 😌", "I love this! Thx for making!!!😍😘🙏", "I sound like a kangaroo giving birth :'(", "please do Chivalry is dead.", "yo", "Used this for a cover on my channel. please check it out and I hope y'all enjoy", "Used this for a cover on my channel. please check it out and I hope y'all enjoy", "Can you please do Hello by Adele? I would really appreciate it.", "verrrrrrrrrrrrrrrry goooooooooooooooooooooood \n\n\n\n\nlove it", "How can i make this song into an environmental symposium lol?", "best ksreoke cover THANKS", "I'm discover your error. 1:52 It' not unavailable. The true is unfaithful", "HEY YOU! I've just done a cover of this awesome song! If you could check it out on my new Youtube Channel and tell me what you think about it, I would appreciate so much! THANK YOU GUYS!!", "Hello by Adele please :D Love ur channel!", "boa musica", "Can u make only one by James Blunt. Please. Ps great video", "please do Drowning Shadows by Sam Smith. its his up coming song PLS PLS PLS xx", "like", "I love this! Thx for making!!!😍😘🙏", "im bad at singing ):", "Hey Sing King Karaoke! Can you send me the mp3 file of your Sam Smith songs instrumental? All Sam Smith :) I’ll credit you on my cover... please? :D", "Me cuestan más trabajo las notas bajas que las altas :(", "pretty hurts ❤🎶", "Do you have Good to Be Alive by Andy Grammer yet?", "I love this song!!!!", "", "Am I the only one that's scared to sing infront of other people...? 😐", "YASS! My Song....", "the sing it's a very very good .\nthank you very much.", "This makes me cry so bad. I miss him...", "we put this on my sisters mom and dad's computer and we did relly good on it 100 persent and our favorite part is when he said and I know and I know and I know and I know and I know bye check out getitgirllondon", "👌🏼🎤", "You just earned a new subscriber!!\nI <3 karaoke!!!\nXD", "Can I use the video, and record a cover of this song?", "my favorit song", "this is a valentine's day song?!?! some valentine's day y'all are havin!!!!", "should I do a cover.... if so who wanna do a challenge", "UMAY J", "I feel so sick.... I know I'm not the only one😓", "this my jam like i can not even contain myself right now bruh!! SAM SMITH IS LIFE. LIKE IF YA DONT KNOW NOW YA KNOW BABY", "I POSTED MY FIRST YOUTUBE VIDEO !!!! can you watch it ? & give a like ,comment & maybe sub? , you dont pay any  money for that, THANK YOU !!", "im a good singer and all but this is actually the only song I can sing soprano and control my vocals.... any one else?", "cantas hermoso☺", "Essa música é muito linda. Eu amo ela!!!!", "Hi everybody ! We are french teenagers and we do cover of many different songs. Check out our channel if you're curious :)", "i cant tell if im bad or not", "I sang this song on my channel, if anyone would like to see it :)", "My favourite song ... It piss me off that I can't sing it ;___;", "If you have a minute please check out my cover of I'm Not the Only One  https://www.youtube.com/watch?v=ID0TEKriIro - I'd love some feedback!", "SIMPLE BEAUTIFUL. ITS THE BEST KARAOKE HAVE DONE-  I LOVE THIS MUSIC. WHEN YOU CALL ME BABY I KNOW I AM NOT THE ONLY ONE. LOVE IT. CAN YOU PLEASE UPLOLAD. ALL FOR LOVE OF MICHAEL BOLTON?. I WOULD GREATLY APPRECIATE IT.", "this song its like the melodie \"stay with me\" isn´t the same but for me it's similar jajaja i don´t now maybe it´s because i was sing stay with me before :)", "I say ONE after the logo intro every time", "I love this song", "do you one hide from back", ":D :) :p", "nice", "Hay alayah it's kianna", "Hi nice vid", "OMG!! Karaoke Night is Every Thursday!!! I love It <3 This gonna be next...", "I am singing this next Saturday at the voice auditions (:", "Y\n\n Utjf", "hey", "can i add this karaoke to an offline video ?", "Doing this for Britain's got talent next year!", "omg you're so awsome .. i really like you :)", "Sing king karaoke  is the best", "@Candis C", "Gym\nBhgvb\nUnique", "Omg¡!!!! Love it", "Im not good at singing hue hue e.e", "Fabs", "Can you do Crazy by Andrew garcia PLEASE", "Here's the thing with me and karaoke...I can sing along with the singers when it's on the radio or something, but when I immediately try karaoke, I sound like a dying walrus... ._. Yep. But anyway, thanks so much for putting up the karaoke!! It's always fun to try it out, even when I'm 99.999% sure I'll end up sounding like a walrus again! XDD", "Pls do NIGHTCORE LETERS CAUSE I HAVE TO SURCH ALL NIGHTCORE MUSICS CAUSE IN NIGHTCORE is simply... TO QUIQ!!! thanks. :)", "Omg I love this song especially with karoke", "", "😋", "i always get the words wrong with the chorus and i try to becool and not lok at the words and pretend i know how to sing the whole song!!!:(", "I'm going to sing this at my Americas got talent audition", "😂😂😂😂", "Ustedes son simplemente los mejores :))", "Hello if you ever have the chance of making  the song `Home`by Phillip Phillips  into karaoke , please I would really appreciate it", "If you like Sam smith check out this cover http://youtu.be/QByscvtBE_o", "Sam Smith - I'm Not The Only One (Febian Kharisma & Imam Saputra acoustic cover)  https://www.youtube.com/watch?v=5v9vXszEgs0", "Asomer then cake love your songs", "This page is amazing this is where me and my friend get all our music so we can start doing covers then finally start making our own music", "I have just done a cover of this song , this karaoke version was amazing thanks !", "@nesha boo lets cover thiss!!", "Algum br , cantando igual louco aqui também ?", "1:35", "I've just used this mmo for my cover song. if you have time please check it\nHope you guys like it.", "That intro and endtro sound is atrocious.", "Please do Say You Love Me by Jessie Ware!!!", "Awesome song", "Congratulations, very good sound quality. I agree, the bes. I am looking for some old hits  like 'Love Story'( Andy Williams), 'Imagine' (John Lennon)...", "amazing song", "Sounds great!", "Ganda naman nyan ng kanta", "Hey i used this song look at my video i use sing king karaoke \nhttps://www.youtube.com/watch?v=ojDXoi50fK8\nthank you!!", "Would love to get many of the soul oldies, that is a group of artist looked over now a days", "checkout my version of this song\nhttps://www.youtube.com/watch?v=xz4ZXt8OtYM", "Can u post \"that's what I go to school for\" the Jonas Brothers version. Thank you very much. Ur karaoke magic is awesome.", "Thx ill make sure to share it with others. Your channel rocks! kepp it up :)", "@Sing King Karaoke do you have any tips for vocal closure? Or videos?", "Meh", "happy bday sam smith", "Anyone want to check out my cover? https://www.youtube.com/watch?v=B1NUohbFUmc", "Hi my. Name is aaliyah I like. Singing. And. I single", "I like this songs", "Thanks for doing this song! I have an audition Friday and am using this song! I love your page, and will you do a See You Again karaoke? If you already have it, will you please send me the link? Thanks, and have a great day:)", "You should consider to add some kpop songs. You gotta great karaoke channel here!", "I like this song because it's have many meaning ,and i relate so much", "I like this song because it's have many meaning ,and i relate so much", "this a good karaoke brand", "Amazing", "LOOOOOOOOOVE!!!!!!!! :)", "I love to sing this over and over💕❤❤❤❤💖💞💓💓💖💖💝💝👻💝💖💞", "your channel is the best kareoke one! i love it.", "Im not a good singer but this is a really good song to dance to", "Is very amazone", "I'm singing this song on my schools talent show 😁😁 wish me luck 🎉🎉🎉👍🏻", "I love this song", "This is a girl and mingling to be singing this at my school talent show wish me good luck!😉😉👏👏👏", "i love this, it fits my voice so well! :3", "wow.. I love Sam Smith", "I love this song", "Crystals - of monsters and men karaoke please! :D", "hehe thx so much i've been looking and this is the perfect vid", "", "When I sang this at first, I was a little messy, but now that I have accustomed my voice (I am only used to singing this song in the shower haha) to this song and the pitch, it sounds beautiful. To me at least(:", "You should put Sam smiths sining in the background. Like your other videos.  😁", "Wow great instrumental! Such an amazing channel for all karaoke amateurs :-)", "Hey @Sing King Karaoke can you make a karaoke video for any song from All Time Low pleaseeeeeee???? I love your channeeel (:", "I barely noticed that I sing this song really good.", "I made my cover of this beautiful song, if you have time please check it 😄😄😄", "ring me im single im 22 and im a girl my number is 0179568235 my real name is anna xxx ;)", "His songs literally make your heart feel every type of emotion at once which is why I covered Stay With Me. Now, I'll add this one to the list! - Ricky", "Can you put All I want by kodaline? :)", "My voice so awfullll!!!", "Nice", "Can.you do smile.by R5 please :(", "", "like if you are about to sing just when the lyrics popped out", "Cool i love this song :) ;)", "My mom likes the song", "\"Stay With Me\" cover\n\nhttps://m.soundcloud.com/vonsmusic/stay-with-me-prod-by-king-beez", "😂i suck but u rock my fav sam smith song😍😍 the videonwas amazing diana agron my fav singer actress", "i freaking love your channel", "Wow this is great! I had so much fun! Thanks @Sing King Karaoke :)", "Love this song! I sang a mashup cover of Sam Smith I'm Not The Only One & Meghan Trainor - Lips Are Movin :)", "Love this song so much", "Hi! Can you please make a karaoke of Alive by One Direction and Nobody Compares by One Direction? Thanks! :)", "Me too", "I Made An AMAZING Cover to this song! Please Go Check It out!", "@Sing King Karaoke ty for this karaoke!", "I have a great voice my family said that I could be a famous singer one day but I'm shy what should I do", "Wow!!!!", "can you make suicide by james arthur? its really nice song and hopfully if you did make it i would download it and i would so appreciated by that ... thank you :)", "I love this song!", "Thank you for this....", "Please watch my cover of Sam Smith - I'm Not The Only One thank you  http://youtu.be/lB8glhCY2B0", "I'm not bad at singing myself oh and I. Love ur video!! 😍😍😍😍😄😄", "@Sing King Karaoke  can u please do four five seconds by rihanna kanya west and paul mcartney", "", "", "Wow I like this...*", "Really stop hating on sam smith he make the best songs ever then any other famous person", "can i use this in a cover?", "", "I love this  its perfect", "Can you make one for the thinking out loud and im not the only one mash up by Sam tsui and Casey Breves??? \nThanks Hahahha :D", "can i use this as a cover?", "Sam showed up and showed out we luv him in Detroit GAY PRIDE 2015:-) :-)  HES TALENTED AND DESERVE ALL ACKNOWLEDGEMENTS GIVEN GO SAM!!!", "Please Restart of Sam Smith :(((", "Another great one! You don't mind if I use this one too, do you? I'll link to your channel and this video once again. Keep doing the great work you do!", "Rushen artist  peinters", "Omg I #Can't believe sam Smith is gay #dissapointment", "i likeed sing it wtih my friends lol", "I sub back😘", "Hi this is amazing!\n\nI was just wondering if I can use this for a cover please? :D", "I love this song😍 I'd love it if you could listen to my one-take cover of it on my channel.. It's not very good and there's a few mistakes but I tried 😊", "You and me, we made a vow\nFor better or for worse\nI can't believe you let me down\nBut the proof's in the way it hurts\n\nFor months on end I've had my doubts\nDenying every tear\nI wish this would be over now\nBut I know that I still need you here\n\n[Chorus:]\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\nYou've been so unavailable\nNow sadly I know why\nYour heart is unobtainable\nEven though Lord knows you kept mine\n\n[Chorus:]\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\nI have loved you for many years\nMaybe I am just not enough\nYou've made me realize my deepest fear\nBy lying and tearing us up\n\n[Chorus 2x:]\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\nI know I'm not the only one\nI know I'm not the only one\nAnd I know...\nI know I'm not the only one", "", "Hey plz like and follow and like my channel", "Check out My Cover Guys (:\nhttps://www.youtube.com/watch?v=cH7dXklkkLE", "Can u please make a kareoke on Sam Smith Lay Me Down? :) thanx!..", "May I use this for my cover?", "Can I use this for a cover I want to do? =)", "Just subscribed", "This really helped, because I want to film a cover of this! I will be using your channel often! Thank you!", "You and me, we made a vow\nFor better or for worse\nI can't believe you let me down\nBut the proof's in the way it hurts\n\nFor months on end I've had my doubts\nDenying every tear\nI wish this would be over now\nBut I know that I still need you here\n\n[Chorus:]\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\nYou've been so unavailable\nNow sadly I know why\nYour heart is unobtainable\nEven though Lord knows you kept mine\n\n[Chorus:]\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\nI have loved you for many years\nMaybe I am just not enough\nYou've made me realize my deepest fear\nBy lying and tearing us up\n\n[Chorus 2x:]\nYou say I'm crazy\n'Cause you don't think I know what you've done\nBut when you call me baby\nI know I'm not the only one\n\nI know I'm not the only one\nI know I'm not the only one\nAnd I know...\nI know I'm not the only one", "And ı know the ı am not the only one:)\n\n\n\n♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡\n\n\n\n\n♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥ \n\n\n\n\n\n☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆\n\n\n\n\n★★★★★★★★★★★★★★★★★", "so hard", "I did a short cover.I hope it's ok", "May I use this for a cover? 😮❤️", "you made this instrumental yourself?", "this song is really sad", "im sorry but i have to sing this again its to good YA DONE GOOD SAM YA DONE GOOD", "Sing king you did a great job!!! This version really made my voice sound great!!!", "You're doing the best karaoke versions :-)", "I love it so much I sing all the time", "Well, this helped alot, and by that i mean alot!", "Hi, what do you think about our cover of this song ? :)\nhttps://www.youtube.com/watch?v=pV9B83v5118&feature=iv&src_vid=SPq1Gqm-i9A&annotation_id=annotation_236607677", "Could you make the lyrics for thinking out loud? By Ed Sheeran.", "i love this", "Can I use this for my cover on my soundcloud? my account is faldyrifady", "I love this song, my favorite ❤💖💕", "This is such a good version. Let me tell you, Sam Smith has a beautiful voice, I love it and my top 3 songs by him are Stay With Me, this one, I'm Not The Only One, and Money On My Mind. And my top 2 songs that featured Sam Smith are La La La by Naughty Boy and Latch by Disclosure. I can sing real high too just like Sam, Justin Timberlake, Jason Derulo, Adam Levine of Maroon 5, Chris Martin of Coldplay and other male singers that can sing real high. I seriously love Sam Smith.", "", "Please make a karaoke version of Battle Scars by Paradise Fears!! Thank you", "Karaoke in Asia is way better than this lol", "Could you do like I can Sam smith", "HI DEAR CHECK OUT MY SAX COVER OF SAM SMITH:\nhttps://www.youtube.com/watch?v=HY0n9zGkCH8", "Please do Lay Me Down by Sam Smith,that would be perfect :)", "I thought it went \" im getting red in the face, you can call me obsessed\"", "Come to see My version of this beautiful songs ! I count of you guysss"]