["Did so c", "Got to fdg", "La", "Ch hhvv", "Fish k", "DJ hhvv JCC", "Given me red", "HK kg the", "GI Jan MBA e", "Fit rug", "HV JB", "DJ if d", "BB it", "GI it TD", "DJ KB JCC", "Ch by RSS", "DJ KB", "Ch by r", "Ch JBL", "DJ HD egg", "Ch Jan KC", "Ch hh", "Cherry red", "Bob if", "DJ cc TX", "Doc if", "HK and", "TJ JD do FS", "DJ Jan JCC", "Ch NVR", "J KB y do", "TJ KB", "Did as", "Rich HD", "DJ BB SC", "DJ h doc", "DJ BB HD", "Gov b", "Ch hhvv", "Ch HCM b", "DJ JB b", "Yoon hhvv", "GI on KB", "Dust v", "Ch h BBC", "Ch try to", "Gov NB", "Ch hhvv HDD", "DJ JCC TX", "DJ DJ HDD", "DJ BBC TX", "GM NV HD", "BBC JCC", "Edu BBC rs", "Gov hhvv ed", "DJ ugh HD", "TJ hhvv", "DJ FL", "FB Ch", "TJ hhvv", "DJ hhvv b", "TJ hhvv", "GM hhvv cc", "GM cc", "BM hhvv HV", "TJ JDdj JCC", "Fhfhdhd", "Rich HD", "This song is definitely playing on my engagement ❤️❤️❤️", "Fig hhvv", "Blu Ch us", "HH DJ HDD", "High did", "She egg", "GM to we", "Ch HD ex", "Dgfff go", "DJ ugh HD", "Bluff RSS", "Bk ok KB", "DJ gf ex", "Ml LLC if", "Bdd", "FL KB KB", "BBC HD", "JCB is", "٢٢,١٧٠,٨٢٢", "My fav album ❤️", "Up KB tdf", "GI DJ UC", "Egg DSC was es", "Ch KS", "DJ FF RSS", "HK on KB", "Vin HV ed", "FB ccyf", "Code", "CL TD e", "Chv", "GMC f", "Edu tree", "Blog us", "N HD", "Bk hhvv fd", "BM hhvv GC", "MLB gg", "Home he q", "Ch yff es", "HK KB HD", "Jvv FS w", "If FB HV d", "DJ if ye", "JP GB oh by", "JCC HD red", "Gov tree", "GMC go", "GI ugh JCC RSS", "HK KB KB HD", "DJ UCS", "GMC GB free", "HK hv hhvv", "GG if the", "soytufannumero1", "22M", "If this song was true, you’d still be talking to him. Can’t Marry someone and not be Not talking to them. . . Just saying", "🥺🥺🥺🥺🥺", "Who are u gonna marry with paper rings Taylor?", "The fact that I did not like the album at the beginning then now, I started to love it. 🤣", "aquele meme da Taylor chamando o Joe de \" pobre\"", "Nunuchiiii", "One of my fav songs ❤️", "she gave me a paper ring guys!! what am i supposed to feeeeeel !!", "this song is very amazing", "♥️♥️♥️", "The way this song reminds me of Nick and Charlie for some reason", "Cutest song ever <3", "fave", "I wanna answer the one who's courting right now with the line.\n\"That's right, darling, you're the one that I want\"", "*I wish we can have a music video of this* 🥲🥺", "This album is so cute and vivid", "How did I get to hear this song just now??? Taylor Oooh", "Ay the begginig, i didn' t Even know that this song existed, now i love it (But I love Taylor more 🖤⭐🖤⭐🖤⭐🖤⭐) •Taylor is a genius•", "this song makes me want a super beautiful love", "Aaaaaaa me estoy volviendo adicta a esta canción 😍😍😍😍", "I love this song 💗💗💗", "ew", "if this song ain't on my wedding I'm not getting married", "the background of the band in this song gives this song perfection ✨✨", "00:32", "Listening happier by marshmellow after listening to this is 😭", "this song makes me energetic every morning.\nit just has this, hype and cheerful energetic tone and its amazing", "this song should be there when they make a movie on the book \"it starts with us\" or \"love hypothesis\"", "TAYLOR TE AMO yo te doy un anillo de papel pero de una que me mato", "This song just feels like the drama every girl wants in her life😜😜😜", "finally found the chandler to my monica", "😭🤩", "Eu amo essa música e atraducao e incrível", "We all have to agree that Taylor demanding 3 kisses from Joe is the cutest thing ever 🥺💕\n\nThis hits way different after they’re actually married 😭 so happy for my favorite couple", "So cute!!!", "Lol.❤️👌👌👌❤️❤️. You wore an engagement ring to see how I would react if you married another MAN!!! Hahah, and I passed the TEsT!!!❤️❤️🤦🏼🤦🏼🤦🏼🤦🏼🤦🏼🤦🏼🤦🏼😂😂😂😂😂. Amen. Praise Gid. I think I can afford a little more than a paper ring. I’ll give you a RUBBER BAND!!! I’ll cut it with scissors and tie a small knot. I’ll chop off a cat’s head and stain the ring red!!! Seriously. That’s what I want to do!!!!????!!! 😘😘😘😘. J/k", "this song can be in radio frfr👾", "yes", "taylor t amo eres mi idola", "\"I like shiny things but I'd marry you with paper rings\" \n\"I hate accidents except when we went from friends to this\" \nAbsolutely love it!", "It's happy, romantic, cute and naughty at the same time.\nTaylor is a genius, indeed!", "21M", "you’re the best", "I might need someone to make a mashup of this song and Weezer’s “If You’re Wondering If I Want You To”", "0:30", "love this song\ntaylor is a goddess", "Jesus loves you", "This song is perfect.", "I love this song aaaaaah ❤❤❤❤❤❤", "the fact that this song doesn't have a music video is outrageous. seriously.", "This song is stay, stay, stay's more successful younger sister", "love", "So true", "Desi Danny love ❤️ \n12\nSaturday morning", "Desi Danny love ❤️ \nSaturday morning 12", "Desi Danny love ❤️ \nSaturday morning 12", "mi canción", "This song is so amazing!!!", "Her songs never upset me ❤\n\"I like shining things bt I d marry u with paper rings \"😘", "I love this album💗", "0:01", "Love this💜🤍", "im playing this at my wedding, no doubt", "its too amazing", "Now seeing this with 21M views feels nostalgic because I'm here even before 1M😌💅", "FAV‼️", "2022 liked", "Brasil curte", "I LOVE THIS SONG", "i love this song my dear taylor swift", "love taylor <3", "This song is so beautiful.", "❤️", "the beat(?) of this song, esp in the beginning is something that I feel will most likely be played on a vacation to a beach in movies.", "This is what I call is a masterpiece", "🥰🥰🥰🥰", "One of best song to listen in summer", "This is my wedding song", "This is probably one of Taylor's most satisfying and romantic songs ever", "Hands down favorite song on this album", "If this song isn't playing on my f wedding,nah mama ain't goin'", "you are such  a  sweet kitten ...just pure love //// 3/5/2022 ~~~", "This whole song is euphoric~~! AND THE COUNTDOWN BEFORE THE CHORUS MAKES IT EVEN BETTER", "\"I like shiny things but I'd marry you with paper rings\" is better than \"I love you\"", "This is art", "te amo taylor te amooo", "It's 2022 and this song is still a masterpiece !", "\"I hate accidents except when we went from the friends to this.\"\nI love this line. It's so sweet and mischievous at the same time.", "goodness this song and Lover are goals for any romantic relationship just comfort, fun, and nostalgia.", "I really love this song cant stop playing it", "3 years since it came out and I still love this song <3", "taylor i luv u", "beomgyu <3\n\nedit: now who liked this  I'm gonna square up 🤨", "Parece una intro de disney channel", "WHY DOES PEOPLE NOT LIKE LOVER???\nIT IS THE DREAM ALBUM 😭😭", "this should be in a coming-of-age movie.", "This song is underrated", "He tries SO HARD!! but, you just can't, not dance to this song!! <3 Taylor!! More more more!", "I\n\nL\nO\nV\nE\n\nI\nT", "best song on earth tbh", "Made in Baguio take me here 🤧🤧🤧🤧", "U are mi fafreet singer", "O K !", "This is and forever will be my favorite song in the whole wide world. I strive to have a relationship like this when I am older. I have my engagment and life planned out around this song....", "mens dont cry much\nbut when we do \nits on something that touches our heart", "I cant listen to this song with out smiling", "love", "So happy this song was played at my wedding! 😍", "Lily and Lo", "Instagram reels brought me here 😅", "Y'all talking about how you wanna sing this song with your partner while I'm out here learning to playay it for mine 😎", "ˑ ִֶָ ♡♡♡ ˑ ִֶ", "2/22/22💜", "\"baby boy\"\nthe way she said that 🥺🥺🥺", "We need a short chick-flick with this song.", "as pure as Taylor herself", "The lyrics istg>>>", "can we all agree that taylor is such a genius lyricist", "happy vibin", "❤️❤️❤️❤️", "ငို တာ တောင် ရပ် သွား တယ် i love this song so much ><", "TAYLORRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR TE AMO MAS QUE A MI FAMILIA \nERES LO MEJOR QUE ME HA PASADO EN LA VIDA \nMI VIDAAAAAAAAAAAAAAAAAAAAAAAAA", "Ready for it!", "love", "LA AMO", "this song littarly describes me and my gf ( we went from besties to lovers recently and this has become our love song kinda) i love the song", "Paper ringssss", "After 3 years i still wake up to listen to your songs", "2:24", "We all can literally listen to Taylor when we're sad, happy, angry, depressed, excited or nostalgic...I swear I can live alone with her music...", "I really like you need to calm down", "I Love this song", "\"i like shiny things but i married u with paper rings\"😭", "go mhiema galing akong jikjin mv", "This song gives nostalgic vibes idk why tho 👽.", "love", "happy heart's day, taytay! i love u sm!🤍", "I first heard this play randomly through spotify and i got intrigued hearing the intro which lead to me reading the whole lyrics. It's just a wholesome song especially knowing the meaning of it.", "This song gives me a lot of cartoon opening vibe. The fun adventure type of cartoons to be exact. Craig of the Creek vibes 💕", "Esta canción es tan alegre que la terminas de escuchar y sientes que debes volver a escucharla una y otra vez porque no es suficiente. ¡La amo!", "İnte", "He surely liked shiny things & married Patrick with a paper ring figuratively 😭❤️", "this is david's pov:", "0:32  0:52", "This song just reminds me that im lonely.", "Thank you for releasing this song on my birthday ☺️🌹❤️", "niggas", "Ur mom is gay", "this is THE song.", "this makes me wanna fall in love. ive been lonely for 4 years now.i dont want a boyfriend anyway, i just want to feel it all again :(", "✨💕", "aaaaaaaaaaaaa", "Once I made a version for my friend that goes I like tasty things but I ate onion rings uh thats bestie I am crazy and I made I hate vegtibels but I eat them anyway uhu that's right bestie I am crazy", "AHHHH this is just amazing", "I'd marry u w paper rings >.<", "I LIKE SHINNY THINGS BUT ID MARRY YOU WITH PAPER RINGSSSSS", "She loves joe alwyn \nyou just can't seperate them", "ILSTBIMYWPRYTRDYTIW", "I love this song paper ring 💍💍", "TE AMO TAYLOR", "I love this song", "because of this song I feel very cheerful", "this song is pop garbage at its finest", "Wanna scream this song out loud to my love someday!!", "I like shiny things but I married you with paper rings. Well thought line", "Views:20,60,952\nLikes:250K", "İts mean summer", "This song is never get old", "After church", "Desi Danny love ❤️ \nTaylor swift’s", "20M", "I like music", "TODA MI VIDA TE VOY A AMAR PAPER RINGS 💗💗💗", "0:33 :)", "This song its so cute", "this song feels like non-toxic happy euphoric love", "I’d marry someone with paper rings too", "1:27 the way she said \"huuugh\"", "This reminds me of her everytime I play this. I'm smiling. February is close. Gotta ask her to marry me with paper rings. \n\nSoon enough, it's real", "Never listened this in full - I’m glad I decided to now", "1:37-1:54 😏", "19M", "I need you for the rest of my life 💓💓💓💓💓", "this song is just about meredith grey and derek shepard :)", "I like shiny things, but I'm not gonna mention that in my monologue", "19M", "2:42", "I love this song😍😍😍🥰🥰🥰😘😘💗💗", "❤️", "Stocked for a year or two or three! 😂 Lol", "Me listening to this and thinking about animated characters-", "Great song", "This song makes me happy ❤️", "omg love this song soo much", "01:57 DIS MY FAVOURITE PART OMG", "If someone doesn't propose me with this song I ain't getting married", "Imagine cleaning your room with your partner as a teen dancing and singing this song and then baking lucky charm cookies together <3", "I love her music<3", "❤❤", "i love this song", "taylor gracias por ser el aire q respiro <3", "😘", "Veer", "\"I hate accidents except when we went from friends to this\"  I feel butterflies in my stomach.", "I love this song", "this song is just the definition of love and happiness, absolutely no negativity, hatred, nothing. absolutely in love with it, ily taylor :)<3", "No one:singing and listening to paper ring while walking around and brush my teeth everyday", "I'm blind as a bat because of her!", "Thinking of my only Lover! They always stay her age! \n   Thinking Valentine's day! \n\nYour the Only one! I want!", "Love u taylor......", "Love your music so much!!!!!!", "my fav music", "This song makes me want to live my dream life and get in a relationship and dance with my partner in the rain\n-M", "WAIT UR TELLING ME THIS CAME OUT IN 2019", "this song makes me feel some sort of way and i don’t know how to describe it but i love it", "🥵👍🏽👍🏽👍🏽👍🏽🇵🇪✏️✏️✏️✏️🥵🥵🥵🥵", "1:27 best part", "ATG TLK xoxo the lazt King•==0072>0089🔥🔥🔥🔥💯🖤♦️", "It better not be a post it greys fans will know.", "Now this gives me Lexi and Fezco vibes....", "I want your complications too taylor😩", "for when baking pancakes or making hot chocolate", "Who else is here after Taylor 's engagement rumours 🥰✨️", "Marrying my imaginary boyfriend cause why not? Hahaha.", "ILSTBIMYWPR <$", "If i am not proposed to with a peice of paper folded like a ring imma say no", "This song makes me feel like a teenager (I’m a teenager)", "this song gives only healthy relationship vibes tbh", "in love <3", "TADHANA and KEANU <3", "bop >>>>>>>>", "💞", "its giving 2000’s disney theme song", "0:32", "1:56 is the best partttt of this song", "This song is making me feel things that makes me wanna fly with my lover. ( lol I don't have a lover)", "that \"uh-huh\" has a thing.", "Playing this at my wedding", "😳Ok listen the first beats of this then the intro for barbie and the mermaid.", "0:32 IDK why but I've always thought she said \"but I'll bury you with paper rings\"💀..", "0:33", "♥️♥️♥️", "It's a great song to start a day🐱🐱⭐💜💜🥰", "If the girl doesn't propose to me a paper ring or ring pop, I'm not saying yes.", "Istg the way she says, \"Three times!\" Is so satisfying and addicting 😭", "Auguri paolo ti auguro una vita piena di anelli di carta", "taylor>anyone", "Such a cute song", "I don't get it when people say lover is taylor's worst album. all of the songs are timeless bops wdym", "Are there other songs that have the same vibe as this song?", "\"The moon is high, like your friends the night that we first met...\"\nlol this is my favorite line!! >u<", "I love this song more then anything. I first found it when listening to songs about having a relationship with a Weasley (harry potter) and I fell in love with the whole feeling of the song. It's just very up beat. It's everything I want in a relationship, but everything I'll never have and I love it. <3", "Oops I spelled your name wrong! Sry I meant: I LOVE YOU TAYLOR!!!!! I’M YOUR BIGGEST FAN", "all I can think about when I listen to this song is two best friends dancing to this and falling in love and now I want that to happen to me", "I LOVE YOU TALOR!!!!! I’M YOUR BIGGEST FAN", "33:00", "This whole album will be played at my wedding or I'm not getting married .", "This has our song vibez you can't change my mind", "I wanna get married with a ring pop", "I promise I'm not haylor but this sounds like an early 1D song (maybe not the lyrics)", "If I can't marry her paper rings then I'll marry with frog rings<8", "If I can't marry her paper rings then I'll marry with frog rings<8", "I miss this era so badddd 😭", "I went from friends to this with my best friend❤️ I really love him so much because he really knows me. He knows me better then I know myself. I always said I would never get married but if he asked me I would definitely say yes. It could be with a perfect diamond ring or with a paper ring. Either way it would be perfect. This song describes us perfectly. Thank you Taylor for this masterpiece!", "happy new year<3", "18M", "I don't know about you but I need Taylor to do more songs like Paper Rings and Stay Stay Stay. I love the fun and happy vibe that she transmits expressing a sincere, healthy and lasting love", "\"I like shiny things, but id marry you with paper\" literally me and my gf", "This song is such a ✨vibe✨", "This song has a great lyrics because I liked the use of the phrase \"paper rings\" Her lyrics is amazing 😁🥰❣️😍❤️💖🌻🌻🌻💖🌻💖💖 And more 💓💖💖💖 hearts  and emojis 😊", "This song has a great lyrics because I liked the use of the phrase \"paper rings\" Her lyrics is amazing 😁🥰❣️😍❤️💖🌻🌻🌻💖🌻💖💖 And more 💓💖💖💖 hearts  and emojis 😊", "I need this playing at my wedding.", "i just want to relate to this song tbh", "❤️❤️❤️", "this should've been in red and forever winter should've been in lover!", "One of the finest works of taylor. This song is a classic.", "😭😭😭want a mv tay tay😘", "I just found out that back in 1998 my dad made my mom an engagement ring out of paper and aluminum foil.😂😂", "Paper rings is my confront song, it never fails to make me smile💗💗", "This reminds me of Emily In Paris.", "This is in ATG's Top 3 songs of Taylor  ALIson swift Brilliant A+ x", "okay i want to send this song to my crush and after the day i sent it i want him to give me a paper ring at school.", "This song mad me feels like the main characther", "im here  cause  spiderman!", "last year my mom called this song \"cash grabby\" and \"fake\". \nthis year i was listening to it and she said it was nice when she didnt know it was taylor\njust shows people hate taylor swift because of the media influencing them\nily taylor\n- blu", "constantly editing Tom Holland in my head while listening to the chorus", "this sounds like stay stay stay 2.0", "IDK WHY THIS SONG CAN MAKES ME HAPPY 😢", "Who is the man shouting 1,2,1,2,3..... Lmao 😂😂😂🤣🤣🤣", "t amo rubia", "😭", "this song💖💕🤍💞💘💓💘💞💝", "this is mondler’s anthem", "Listening to it since the morning and it's 12pm", "This literally explains my feelings perfectly ❤️", "After 2 years im still here enjoyibg the happiness of this song", "‘2019 music was shit’\n2019:", "Shut up this is an end credits song to a cheesy romance movie and thats a compliment", "Heh not suprised", "why it starts like icarly opening theme I- 💀💀", "Just waiting for Taylor's marriage news !!", "Hi", "Who's still hear 🙋", "I like Shiny things , But I'd Marry you with Paper Rings 💜", "I like Shining things....🥰", "HAPPY BIRTHDAY QUEEN!!!!!!\nI LOVE YOU", "Mid", "Happy birthday", "Do you want me to do that tomorrow or do it at home?", "What? How rude!\nLol?", "Best song ever", "Hsbhshsbs this makes me happy", "So true", "lover and rep are the best prove me wrong", "TAYLOR IM SORRY I ACCIDENTLY DISLIKE IT", "Taylor missed the opportunity to make this the lead singles or the second single", "Hi sa nag suggest na pakinggan ko 'to, na nakilala ko sa omegle, Ill marry you with paper rings.", "Perfect", "Enthusiastic", "Wonderful", "I feel like this song describes my relationship rn and that makes me so happy", "Love it", "0:30", "paper rings=not actully maried", "Love you Paper Rings so much", "This is like platonic love (like best friends who treat each other like brother and sister) and over the years turned romantic <33", "This song should be a soundtrack in a movie🥲😭😭", "0:42 - 0:51", "love the song", "I want this kind of famous", "You guys got to hear this on earbuds", "esta canción suena como el principio de !Icarly xdd", "I am finally relating to this song so bad that it scares me", "This song is the long lost sister of \"Mean\"", "que afortunado soy que la persona a la cual conoceré sus padres el miércoles 8 de diciembre de 2021, la persona con la cual quiero estar una eternidad y que me encanta y gusta tanto me haya dedicado esta canción <33 P&K🖤 Me gustas mucho", "I need this song live just her and her guitar.", "Just realized that lover album is quite coool and i love it 🤪🤓😭😬", "I'm falling in love with someone amazing and this song simply reminds me of him", "This song reminds me so much of Amy Santiago and Jake Peralta.  😭😭😭😭💕", "John ❤️", "💋me once\n💋 me twice\nTHREE TIMES\nSerotonin boost..... This song doesn't lets to rest... Bruh live performance when??", "💃", "joe alwyn be blushing listening to this", "HOLA VENGO DE JAKIRU", "He just drove our 13 year old to school because she missed the bus. Hang in there ladies. Sometimes your knight in shining armor is the cute guy from down the street with an angry, preteen girl in the front seat.", "Peraltiagooo", "LYRICS.\n\n\n\n\nthe moon is high like ur friends tried slaitking u on the internet cold wine now i watch u breath kiss me once kiss twice threee 122212 i lik e shiny bu marry u pape rings and i hate aidents when from friends ot this u r te one i want dreams the witer cold pool jump in after you flaws we wouldnt be strong kiss u once kiss twice theee on21234 i like paper rings drlin i hate accidents thats right darlin ur the one i want picture frames i want to drive away with you i wnt complications wrap round baba bpy i want ur dreary mondays i like hsiny things but id marry you ifpaper rings uhhh uhhh thats right ur the one i want ur the one i want inlike shiny things but id mary u paper rings i hate accdietns exepect friens picture frames all my dream paper rings all my dreams ur the one i want", "My girlfriend is a huge Taylor Swift fan, and I finally got around to listening to some of her favorite songs while at work. Now I'm all bubbly and unable to hide my smile.", "Ermoso uuu wiii", "Genial uuuu", "Uuu lo amo", "That sigh at the end if the second verse👌", "I HATE SHINY THINGS BUT ID MARRY U WITH PAPER RINGS <3", "MY NEW FAVORITEEEE <3", "17M", "Aaaaaaaaaaa the serotonin boost this song gives me😫💕", "VC NAO TEM UMA MUSICA RUIM MANO, EU TE AMO", "pensar q era nuestra musica :(", "this song gives 2000’s movie vibes after waking up and rushing to school lol", "I fricking love this song", "I love this so so much omg<33", "Lover album really makes you feel and understand Taylor’s emotions and she really did portray it perfectly in this album", "Taylor You Are MAGIC!!! 🪄", "Hi", "i like to listen this song if i got nothing to do", "am i the only one with a sudden urge to make paper rings after listening to this?", "I made a playlist for my bf as a birthday gift since I didnt have money to buy him anything and he didn't really care for handmade stuff (plus we're in a long distance relationship). This was the first song I immediately remembered when I made it. But he just brushed it off and didn't bother opening it. I guess he doesn't care for playlists too 😅\n\n\nJust wanted to get it off my chest. I thought he'd like it. 🤡", "so tru taylor\n-bianca forca", "it's like she knows me", "When is the video coming?", "I hope this song will be played at their wedding and their wedding reception would be the music video for this 🥺🥰", "hi jessica if you're reading this comment i just want you to know that i like you,i treasure you,i want you, i need you and I LOVE YOU\nsorry that i fall inlove to you even though we must be just friend im sorry opo", "Im a guy and love the Lyrics on this song, hope to find a women like that , who doesnt care about how expensive or where i get the ring from, as long i get one to merry her  she will be happy.", "Timothee te dedico paper rings.", "2:05", "2:06", "0:30", "..", "I like this tune.", "She's recording videos for songs we said should've had a video with the re-recordings. I'm manifesting one for this brilliant song.", "this song gives me such a brittana vibe", "Te amoooo", "queennnnnnnnnn😩😩🤌🤌🤌", "I listened to this while making paper rings to propose to mt girlfriend hehehehe", "❤😻", "Perfect wedding song 😄😄😁😁😁🤣", "I marry you what type of rains baby Eddie are you okay Eddie I marry you with paper rings and the blood stains on the carpet Eddie are you okay are you okay that's a smooth cereal Eddie are you okay I marry you with paper rings are you okay Eddie are you okay that's a smooth cereal", "i love you taylor", "incredible", "amazing", "j'adore", "🧡", "I'm at the gym and i'm trying to stay silent but i literally want to scream the lyrics of this song", "Why does this song gives off 90s vibes...?🎉", "THIS SCREAMS A HEALTH HAPPY RELATIONSHIP 😩🤍", "this song is so underrated- it's just so wholesome...and now it's my username.", ":)", "❤❤😍😍", "Taylor Swift is the music industry and she's a queen of music. This song makes me feel very happy and that's why I've listen to all the time I can.\n\n\"I like shiny things, but I'd marry you with paper rings\" - this line shows the true love 'cause it ain't matter if it's shiny or if it's paper, what matters is being with the person you really love.", "I came here again and now i can’t leave.", "Taylor can’t make a bad song….except “ME!”…IM KIDDING HAHAHA…", "not at me playing this song everytime i do my school works! this just a masterpiece", "My favourite song from this album", "from the start till 0:30 — this song screams Joe Goldberg's and Guinevere Beck's relationship.", "0:22", "\"Kiss me once 'cause you know I had a long night \nKiss me twice 'cause it's gonna be alright \nThree times 'cause I've waited my whole life\"\n*i cant even. its too perfect*", "5/11/21\nBlaire, I came today. \nThis is your favorite song, I figured I'm gonna make it also my favorite.", "love this song so much it's just so fun and just so lovely. Probably one of my favourite songs from Lover", "*When you love shiny things but you would get married with paper rings just to meet Taylor Swift in person", "This song.... 🙅‍♀️🙅‍♀️🙅‍♀️🙅‍♀️🙅‍♀️", "\"Went home and tried to stalk you on the internet\"\n\n\n\n\n\n\n*Marinette that u?*", "I need this LIVE !!!!!!", "❤️le dedico esta hermosa canción a mi genial amiga Mari❤️", "✨💞💞✨", "✨💞💞✨", "✨💞💞✨", "So it goes dahling....", "And lub me too....", "Until you come to me....", "Can't stop....", "And I won't stop....", "I lub you....", "And I'm coming for you gurl....", "Except you baby. 👌😎💯💯💯", "Until the job is finished and His kingdom is set. 💯💯💯💯", "So another mission is alwayz right around the corner....", "Than when as a soldier your mission is complete....👌💯😎", "You can't be more happy in life....", "Hey you....", "✨💞💞✨", "im here in Nov 2021 and imagine this as comedy opening song", "i love how she can express what she loves to a song that everyone can love it to", "Love it!", "I like him so much, taylor. He deserves the best but it feels like I'll never find another him. He's so pretty, tall, kind (like super!! sometimes, you'll think he's from a drama), smart (he excels the best in major subjects such as mathematics, science, English, and computer),  cute humor, cutie smile, and he plays the piano with such long graceful hands :((. This will be the last school year I'll see him and Idk what to do :)(", "Kale pag nahanp moto lab u", "Kale pag nahanap moto lab u", "16M", "this song is so perfect aa \"I like shiny things, but I would marry you with paper rings\" 💛", "❤❤❤❤❤", "every time i listen to this song i think of jake and amy<3", "♥️♥️♥️♥️", "PAPER RINGSS UH HUH", "im surprised there are only 16 mil views", "gracias por está joyita<3", "this is a different vibe", "Finally found a song to play for my wedding day!💜", "crying over the fact that I can never relate to this ಥ﹏ಥ", "the happiness radiating from this song makes me wanna cry omg", "1:28 - 1:50", "♡︎♡︎♡︎!!!", "\"Now I wake up in the night and watch you breathe\" 😌😌💗💗", "if you're not here because of TikTok then I'd marry you with paper rings <3", "why is this so underrated 🥺", "sweet song 🤍", "aha that's right", "Not getting married unless I find someone who makes me feel like this song does", "Loved", "英語喋れないけどWrap your arms around me baby boyのところだけ完璧に歌える！笑", "🦋🌹", "*🦄Kinda song you drive to & kinda song on bed lie to ... every night person will like this song for sure, if you are one of them..nice to meet you :)*", "I love lover ❤️", "'I hate accidents, except when we went from friends to this'", "nunca me voy a arrepentir de haberla staneado, taylor te amo💘", "'Went Home and tried to stalk you on the internet' Most Retable crush line ever", "I feel like I'm the main character when I hear this song", "This song fits me just about perfect! I have a future girlfriend that'll hopefully be my future wife. She's in a different state right now, so we can only communicate through the internet for the time being.... I sent her this song saying this is kind of me right now, her reply was wondering why I'm so sweet ^_^ for her. I'll be glad to wait for her.", "Do You really need Mine ,Dear ts ?", "I'm surprised she's not married to Joe yet after listening to this song.", "PAPER RINGS", "It has been more than 2 years, but I'm still obsessed with \" I like shiny things but I'd marry you with paper rings\"", "1:26", "“Wrap your arms around me _baby boi”_ 💀💀", "💞💞", "❤❤❤❤❤", "😍", "This song always remind of Jackie and Hyde from that's the 70s show :))"]