["u are THE best youtuber as u say make the impossible, possible", "One of the best thing about dude is that he\n\nnever takes credit for himself when he archives\n\nWe congratulate overselves on this achievement\n\nsomething He always respect us, the audience.\n\nand his team and he is polite in all his videos", "Is sick", "I think u should watch it I've watched the first episode and it was good but ima watch the new episodes", "Your toxic I am not subing", "Yo Tg, I have the most hardest challenge, You will have to pickaxe the opponent before attacking. Can u make the impossible possible this time???", "The moon knight show on disney plus is soo different and is freaking amaizing, is my second favorite marvel series", "Yes you should watch it", "Am spiderman", "Yes you should watch moon knight, one of my favorite shows 10/10", "Damm", "Hey typical can you give me the moon knight bundle please I’m a big fan and use your code my in game name is topsy tricky 17", "These are so boring, its mostly just reskins -_-", "YOU NEED TO WATCH IT!!!!!!!! it's soooooo goood!!!!!!!!!! and it's marvel", "Watch mon nit", "YESSSSSSSSSSSSSSSSSSS", "yes!!!!!!!!!!!!!!!!!!!!!", "Yoooo love it", "You should watch it but pg.14", "Yes Andre u have to watch it tbh it's one of the greatest series ever", "Can you friend me my fortnite name is Dynamiteleaf564", "wach moon night", "yes watch the show tg its great", "I dare you to do a challenge when only use loot Fromm battleling for corney cross roads", "Moonlight is a good show you should watch it", "Yes it's a good show", "I love your videos", "best show i have ever seen. you should watch it", "You should definitely watch it the action and  the show is good", "Like spike 💪", "I'v watched moonknight. It's rlly good and the best episode so far is episode 2.", "I bought moon night using your code!", "As grey or purple", "Does it count", "Do shockwaves count as purple", "You 100% should watch moon night the episodes come out tuesday at 12:00am utc and they are all amazing. Marvel did a very good job following the O.G comics", "YEEEEEEEEEEEEEES", "YES", "im on my mom computer my cusun said you sweat to hard on 1 player", "Yes you should watch it it’s sick just looking at it", "I'm only seven I can't watch it", "Your very very good wish I knew u! Bye the way user name ouiwe5090", "Tickle gaming", "can you gift antman12341 please", "You should have done mythics", "You are the reason I still play", "Yes you should watch it is pretty good", "Yes is awesome", "No", "You should watch it", "Tg, win a game with rocket launchers only, just prove you can do it, though i know you can!", "How do you get that glider", "You should watch the moonlight", "Black-38-special", "Typical gamer I triple dog dare u to make a video and get 5 wins in solo or duos no build u prolly can do it but I still wanna see", "What is that glider", "I did it before him and won twice in a row", "Bro had a private uav", "Ya", "WATCH IT", "One of the best thing about dude is that he\r\nnever takes credit for himself when he archives\r\nWe congratulate overselves on this achievement\r\nsomething He always respect us, the audience.\r\nand his team and he is polite in all his videos", "Yes", "Tg I have a Chanel called Jollygamer playz but no subscribers", "yes i did watch the moon night show its a really good show", "Watch moon night", "Definitely watch moonknight it is very epic!!", "Yes", "Moon knight is one of the best shows!", "yes watcvh it", "You should watch moon knight it's really good and it's about egypt so it's nice", "I'm watching Moon Knight and it is so good you should watch it", "YES WATCH MOON KNIGHT", "Moonlight is really great show definitely watch it", "You should definitely watch it", "Take note of how almost half the comments are bots. This guy's a clown", "yessssssssssssssssssssss you should", "Please gift me it big fan and I use cod typical gamer and gift me as Extreme showw", "And also he doesn't have a wrap", "Yes, moonight is an awesome mysterious show", "yes", "i watched moon  knight", "Yes", "No one better ninja rage to much", "Your so good", "Can I have some advice", "I love your videos", "Dixmsiejsk5", "This man never disappointing, impressed with the time and effort you put into these videos, keep it up! 😇", "Let’s appreciate how much awesome work and effort he puts in his videos keep up the good work!😀", "Yes you should watch it it is so good", "You should do that skin and doing gray weapons only in duos", "no do not watch the show", "Can't you use the getpack it ain't a weapon", "Yes you should a new episode comes out wendsday", "Yes", "Yes andra", "imagine i dont play fortnite but i enjoy watching andre play😁😁😁😁", "Wtf was that wutang glider?", "YES BRO", "I’ve watched it. You should definitely watch it.", "nope", "have you seen halo the movie", "Hey tg try to win use explosive weapons. GOOD LUCK!", "Yes", "YES", "Yes. Very good show!", "8:36 the buildings falling down be going with the beat", "Yes u should watch moon knight", "You can use a Mythic gold and Silver weapons since both of his colors are white and gold! It looks better with the moon 🌙 back bling that we got for Halloween in the Item Shop last year and All Star Contrail 🌟 in Chapter 1 Season 3 because he can control the Moon and Stars in the sky!", "I dont know why you didnt watch it yet", "Bruh my moon knight challenge idea was better come on gotta read discord more; still a banger vid", "watch it its amazing", "Yes you should watch the series it is so good", "Subscribe to tipicalgamer", "I think they  made that skin because of  Ramadan", "Was short for his pickaxe. Felt sad. But got him ✌", "watch it on live please", "What would you want back rift to go or bogie bomb", "The show is probably the best Marvel show ever", "Guys I think everyone knows this but the ranger shotgun looks and sounds like the combat shotty just more OP", "I haven’t watched episode 4 yet", "Jou kan get grey wapons aut a chest", "Yes", "yes \nyaeh", "You should watch it", "Yea u should watch it good 👍", "They were trying to 1v1 at 7:40", "Yes watch it 👍 but the first few episodes are naff (not that good) but it gets Realy better :)", "Moon knight is so good", "The ending of ep.4 was funny", "summen the suit", "Yes", "yes!!", "yes PLZ watch is the series is amazing and very good can u do a vid we’re u react to it PLZ", "It should've been exotic weapons not gray", "i watch moonknight show", "the show is really good", "just watched the first episode no spoilers but its awesome :ps the skin should have came with a glider", "A no heals challenge possibly??!!", "He be one shot", "I need v-bucks to get the skin😭😭😭", "I liked it it is blowing me up", "I dont like Fortnite but i love Moon Knight both the show and comics so i watched 3 minutes of Forntite", "U really should watch Moon Knight i think you would like it", "ive finished it its really good so watch it", "You should watch it \ntg I think you”ll like it it’s a cool movie on Disney+ you should do this one more time beacause he only attacks at night I think I forgot", "Everybody:has the best guns in the game\nTg:has all grey weapons but still wins", "I’ve done that flying glitch before. My brother showed it to me", "Watch the series it’s great", "It’s buttercake berries", "It’s kind of scary but it’s good lol", "tg plays", "s1 ok", "moon knight e1 to e2 to e3 to e4 ok", "He touches hes self", "yes", "I kinda wish the no cape style was marc\n\nP.s forgot other guy name", "Yes you should 👍", "yes is the best marvel movie ever", "The show is really good so far, I highly recommend watching it because it is amazing. Yet it is a little hard to follow the story at first", "I have to so there is not going to be a long episode", "I have", "CLICK THE BELL", "yes moon kight", "Moon night is so good u should watch it and yes it is on Disney plus", "It's just how he edits like like where he had 99 crown wins then he had 100 like he's the best player in this whole entire game", "Yes", "can you gift me tg i need vbucks my user is dino buns", "I have no vbucks I used it on the battle pass", "I have watched moon kight", "It is one of the funiest movie I ever seen!", "I think you should watch moon knight but it is REALLY brutal", "Don’t u guys agree with me that tg just makes our day🥰😊", "Marc too op", "Watch it it’s pretty good", "they aded klomberries back", "Maybe a spider man challenge like green goblin", "No", "Yes it is a very good show", "I did thet", "soothing", "Noooooooooo", "Tg is op op op op op op op op op op op op op op op op op op op op op op op op!", "You probley will not see this comment aney way", "Please win a game with dubble revolver", "Yo since dubble pump is gone we can use dubble revolver", "YES", "aim bot 5 :16 s", "Can you please do a challenge with one of every weapon", "I seen it on disney+", "Yes you should watch it", "Yes, andre you should watch it this serie is blowing me out, it's really psychedelic.", "TG PLAYS WATCH THE MOON KNIGHT SHOW", "bro when tg here vs everyone he gets like a lot if kills because he really good and better than faze Jarvis and ninja.", "go ahead", "tg aka the best fortnite god clapping everyone 😂", "Your the best you are amazing I love your videos I see them everyday!!!!!!!!!!!!!", "If anyone is down to play, let me know!", "Yes", "Tg  is the best at Fortnite I love your videos", "Yes", "One of tg best combo is the revolver and the shotgun", "OF CORSE IST THE BEST SHOW EVER!!!!!", "I have watched the moon night show and I enjoy it and you’re a goat and it’s on Disney+", "I watched it like yesterday", "yes", "Hi", "Hey yo", "I’m not waching because I hate build", "its my bdy", "!", "You should do a one gun only challenge", "Touch some grass", "Ns_jj", "Stop making videos it’s annoying you always i illuminate me", "I love moon kight tv show it’s lit", "I used the code", "yOU SHOULD DEFINITLY WATCH THE SHOW!!!", "Hi tg my name is dereck and I’ve been watching u for 3 Years now so I’m a og", "How do u get so many views no youtubers with ur subs gets this much veiws", "i want epic to make a arcane skin because that would be awsome (arcane league of legends show)", "How much v bux is it", "definetly should watch it tg", "Can you gift me", "Oki we were in the same game and you killed me lol", "Yes you should watch Moon Knight", "keep up the good work tg", "I was  gonna buy it but I bought ALTO I loved him and moon knight", "Moon Knight is a great show", "I think he should do a earth day challenge", "yes", "Moon knight is the best show ever", "Nice I’ve subscribed can u gift me 1000 vbuks my name chimpsdan4107", "Yes do it", "I have seen moon knight 🌚", "I’m a big fan", "Moonknight is a great show!", "If you see this comment may you be blessed for the res lt Year", "What was that glider TG", "Can anyone buy me the moon night skin", "Your opinion please .mcreamy typical gamer ninja", "watch moonknight its so good\npls", "Its good", "yes", "Glad moon night is helping us on this war", "i whached it the mer theres a hamen", "can you friend me Thegamercat585 you inspired me to be a fortnite youtuber", "I have a movie moonNight", "Hey Tg did you die to fresh yesterday", "You can u Pi I love ur vids", "Moonknight was very good if you like marvel and action and some story then watch moonknight", "the moon knight show is 16+ also you ar the best person in the  universe", "my name is fuer2a", "why not use typical gamer code he is awesome", "YOU SHOULD WATCH IT", "Moon night is do good and interesting new episodes every wed. Btw does any one thing episode 4 was kinda weird not gonna lie", "Watch moon night", "Yes", "You should watch it", "No offense TG but like\n\n\n\ncode nickeh30", "TG can we 1v1 in  Fortnite  my name is clip_projj", "Bro my birthday is tomorrow and ur vids make my day", "The moon night show is so good", "Tg watch moon night it is good", "I  Love  it", "Watch moon knight!", "I watched it", "Buaght the moon night skin with your code :)", "it is sooooo good the moon night show", "watch moon knight", "TJ behavior cares by fortnite name", "moonknight is such a good show", "TG you are the best  But my YouTube are", "Washington new Batman movie it is so f****** cool", "yeah its realy good", "I like you tyipcal gamer", "You should definatly watch the Moon Knight show.", "hi a really big fan I've want to be friended on fortnite bye you  your a graet guy caring to your watchers keep up good work hope we meet in fortnite i will send you my user in the your vid tomorrow if you want to expect it really want the moonlight a the grey only challenge was awsome bye from your fan", "Yea he’s the best", "Moon is my favourite right now I love the action and adventure combined you should most definitely watch it", "the show is sooo good", "ya i did", "Yes you showed because it is 4 episods", "You should watch it. Have watched 3 and a half episodes and there are 5 out but 6 counting all the ones that are gonna be out", "Love your content", "I like dirt", "You should it is a great movie", "haven't watched the show but it looks sick!", "Watch it it’s a good movie so sick and it’s like an Egyptian movie like talking about like gods", "you should watch the moon Night Show", "Are you gonna play Star Wars", "You should watch moon night on disney+ good story line👍", "Yesssssssssssssss", "Yes you should watch it now", "My first vid of watching TG was when  he did this rainbow chicken 😂😂😂 good ole days", "At 3:16 he has 69 shield😂😂", "You should watch it is good", "Yes you should watch it", "Yes you sould whatch it", "what happened to the pizza party from tamato head", "Yes you should", "Hi", "yas", "Yes, you should check out Moon Knight. 👍", "Moon Knight is one of the best marvel shows ever so u better watch it", "I watch Moonknight and you should its the best.", "TG, moon knight is such a good show and I’m loving it, you should watch it!", "Yes Watch it", "Xbox", "You should watch moonknight it is an amazing show", "Do you know storm troopers are coming in the game", "I’ve watched him for the past 5yrs", "yes", "you should watch mooknite", "The ranger shotgun is like the hevey shoutgun 2.0", "Moonlight is so good you should watch it", "I am a huge fan I think I will never make it A gamer i asked my dad to buy me a PS5 he’s doing this🖕", "Watch moon knight", "You should do a normal game", "Have you watched Naruto to boruto the next generation (Boruto is Naruto's son)", "It is such a good show", "Now that I think about it now I know why it’s called the Ranger shot gunbecause the range is insane", "Yes you should definitely watch the moon night show", "Yeah I agree Unknown", "Watch moon knight", "Hi", "Watch iiiiittt", "I think tgs just tooooo god at fn", "The moonknight show is awesome", "Can you please gift me the moonknight skin", "Moon knight is in my opinion my favorite MCU character. I recommend watching the show it’s awesome. 100000/10", "Tg I love you and your videos he is why I still play and learn", "You should watch moon knight", "Yes watch moon knight its so fire, i have all 4 episode😎😎", "Yes you should watch it", "I watched the show it's a good movie", "You should try doing each challenge in both no building and in the building mode, I think it could help spice up your video's but even if you don't do that you can just keep making your awesome video's.", "I think you should watch Moon Knight it's pretty good", "Hmm I wonder if Morbius will be in the game too", "Literally TG is the GOAT of YouTube. There is no one better at making content than him. Oh, and by the way tg, you should watch the Moon Knight show, I got hooked from the first episode. The show is INSANE!!!", "I've subscribed and not gotten a gift", "you should watch it please it is really good omg", "Love ur videos💞💞❣", "yes", "I have the same skin:D", "I want this skin if you want to give it to me that will made my day  🙂 my username : very-farad0", "Been watching TG for about 2-3 years now and he just boosts my confidence up to play fortnite and get kills and wins", "Tg: 9:50 my aim is so bad right now \nMe: we’ll mine every day, i don’t wanna talk about it", "Watch moon night", "You should definitely watch moon knight", "Yes you should. The moonknight show is great a lot of plot twist too", "Tg u need to watch it and love ur vids", "Yes", "Also the only reason i play fortnite is becuz of him great content tg", "he made a mistake by saying Chapter 3-Season 1 but, the content is amazing", "Moon night is so good", "I'm really sad they removed the spidey mythic from the game, if they only bring it back but make them something else, like a grabatron idk a name but u get it", "It is very good", "Hope everybody is having a good day God bless", "So live stream", "Yes you should because it is good it lest I love it", "Love you", "Moonight is on disney plus", "I missed cheating on you cause I saw her on her video I'm heroes talking to another guy and her make out later and I'm sorry but you caught shooters on", "moonknite is sooooo good", "pls gift me my username bigboyjr477", "Tg the Moon knight show is really good", "Ur best youtuber", "I watched 3 episodes of moon knight and I love it,I think you would too TG", "Love the content", "Moonknight the BEST MARVEL SERIES EVER!!!! YOU MUST TO WATCH!", "Anyone know what glider that is", "Hey TG here's an idea do the same challenge but you can only fight in the night .Now that would be making the impossible, possible 😁", "I am watching a moon night with my dad and it is good I think you \nshould watch it", "Keep up the good work", "Could I be on your next vid plz", "can't wait for episode five of moon night", "that Wu-Tang glider is sick. i am fairly new to this game so it's cool seeing everything i missed but sad i can't get most of it lol", "can someone pls gift me the moon knight pls", "well done on #3 trending on gaming u deserve it", "moon knight is good very good", "Did the crowns reset?", "You stole my vid!", "yes", "Watch Moon Knight", "Yes", "watch moon knight", "How    did you get that  glider Typical Gamer how did you get that glider", "HEAVY SNIPER ONLY Challenge ?", "What do you think about  *ANVIL ONLY *Challenge ?", "Can you make fortnite but i cant touch the colour green", "Moonlight", "Yes", "Stop doing these f****** challenges you dumb f*** and not subscribing to You or I'm not going to use your supporter Creator code dumb f****** b****", "YES you gotta watch moon knight", "TG the show Moon Knight is sick I recommend watching it 👍", "Watch the movie plz", "It is amazing the show!!!!!!!!", "have you realize the over shield is gone", "I miss the old tg when he played other game but now he plays fortnite ☹️", "what glider is that?", "You should watch moonight before you play as the character again", "Yeah wach moon knight", "thank you for listening tg you the goat fr", "Ye plz watch it is is great", "All my friends are flexing on me with the new skins😭😭😭", "i thought kolomb berries were valted", "You should watch MoonKnight it,it can be complicated at times but it’s really interesting", "Can you give me a coon in Fortnite I want this car ALTO my name is ranBabyYoda", "Sorry for the inconvenience could you do a no build mode video please", "watch moon knight its my favorite show so far and also my favorite thing on disney+", "Yo i think the revolver is good all u gotta do is hit ur shots and aim for the head", "I watch moonlight is a good episode for Kindle", "Yes I watched moon Knight the fourth ep is so confusing", "That’s very cool lol 😆 I just messaged you back now lol \nMoon nice moon", "lol", "I love your vids!!!", "The moon knight series is soooo good i really think that you should watch it", "watch it", "You should definitely watch moon knight its really good", "Was watch it", "tg keep up with the good work you never dissapoint us", "It is my fav disny+ series", "You should watch Moon Knight", "FORTNITEEEEE!!!", "They should have made his glider his cape that shapes like a moon", "Moon knight is a good season on Disney +", "WATCH MOONIGHT PLZZZZ YOU WILL LOVE IT", "does anyone care to take some time out of there day and watch my video i uploaded? I would like to know if i should keep uploading or not.", "Bots may say but you never fail to disappoint mw", "yes you should watch it.", "You should go revolver only challenge", "You should do a tank only challenge", "Great Show", "Boogie bombs and rifts and bqcks", "What glider was he using ?", "So many bots lol", "Yah you should watch it", "Yes bro it’s so good", "I got that skin", "Aeejkk a", "Would've been cool if it was grey and gold or grey and mythic since he has those gold Cresent moon blades", "Yes watch Moon night", "Can you realy give me moon kniht skin", "You should watch it", "U could use legendary wepons cuz moon knights crescent darts are yellow", "I forgot to use ur code :v", "you should watch it \\", "I have been watching TG for a few months and I must say, he is the best Fortnite YouTuber EVER. He posts every day, his videos are so creative and thanks to him, I unlocked the Prowler Skin, so once again, thanks Typical Gamer", "Yes", "Great game", "Wonder if he would ever try a no hit challenge? Where he cant take a single hit in damage the whole game.", "I love your vids I watch them everyday", "OKAY !!", "can you do the ranger shotgun challenge but the ranger shot gun should be gold only.", "Pls TG watch Moon Knight it's so lit", "Can I get him for free", "Hi", "yessir", "I watched the moon knight show it’s pretty good TG", "Yes you should watch it.", "yes", "And please watch the show moon Knight!", "Yes watch it to", "YES THE MOON KNIGHT MOVIE IS AWSOME!!!!!!", "Ranchdressen564", "I'm sorry to ask this but could you gift me the moon knight  skin?", "I watch moon Knight and I love it it is on Disney +", "Can you gift me", "Watch it on live", "Watch it on live", "Yes", "I have Watch movie night and it was good I am A big marvel fan", "Yes", "Username is becate I want a battle pass gift pls pls typical gamer", "But with chugs", "He was singing the duck song", "Do a next to impossible challenge in zero build for good content. P.s only use the loot that you first pick us. For example you pick up a stinger smg you can’t have a combat smg. You are stuck with the stinger. So you would have to chose your loot wisely.", "I subscribed INSTANTLY", "u should watch moon knight its a really good show", "please gift me the moon knight im 3J2020 PLEAAAAAASE", "U have to watch it now", "watch moon knight", "Yes.", "TG", "why is tg sooooooooo godly", "It's kind of good.", "Can we just appreciate the work and effort he puts into these videos your the best tg", "Yes 100% watch the show tell what you think cause you might think deferent then me I love the show now 2 more episodes to go", "chapter 3 season 2 TG!", "1:50 What are you saying? It doesn't matter to us you're just being Andre, The TypicalGamer we know and love and whatever you say is Gold my friend 🤗", "Watch the moon knight show, it has plot twists in it! Even my parents friends is an actor of moon knight.", "hey TG you should do a coachella randomizer challenge. gray weapons if you get: lyric. green weapons if you get: alto. blue weapons if you get: wilder. and finally purple weapons if you get: poet. do you like this idea?", "Yes watch it", "How doese hé have 100 wind this season and 123 Crown wins", "La cama Videos", "Yessssssss", "I almost won with the worst weapons, at least baf together", "Yes moon knight is the best marvel show.", "You should watch the Moon Knight show I watch it and it is so good", "ranger shotgun is good cuz you can smg combo with it and deal heavy damage", "i watched it it is awesome def watch it i liked it so much i got the skin", "Bro you need to watch Moon Knight", "This can’t be real. The first couple people he was fighting weren’t even shooting. The guy at 2:43. He didn’t even try to fight. How do I get this lobby?", "You should watch moon light it is so good.", "I never watched it so idk if you should watch it but what I have heard you probably should watch it", "i have not won with gold wepons and you won with grey lol", "Watch Moon knight it is a good show", "Yes you should watch it it is very cool and a little bit scary", "i have not watched it yet but my friend says it is good", "Yes you should watch moon Night", "can you gift me the moon knight skin please?", "U can kill doctor slone with a tank and it will take a minute or two", "Honestly tg moon knight show has been pretty interesting so far", "Moonlight is where this guy has dreams but it’s not really happening and then there’s this thing where he has something in the mirror but everything that he’s doing the mirror doesn’t do something else is in the mirror and then the mirror dude that in the mirror takes over him to turn into moon night", "How much is he", "Ep 4 is Pretty bloody tho", "Yes you got to watch .it's a mazing", "YES", "Moon Knight is pretty good", "Who else loves tg", "Marvel copied DC", "yes watch moon night", "U should watch moon knight it is  cool but also trippy so if u get confused it's  fine 👍 🙂", "Plz upload vending machine only challenge", "heat vison look like powerler vison in the moive", "Moonknight is a MUST WATCH !! Such a great show", "I love when Typical Gamer says bud buddy buckaroo", "White", "Watch it", "What is that glider", "🌙", "I feel like they could have done a little bit more for the moon knight skin it felt rushed", "Watch the show it is so entertaining", "yes", "yes ı watched ıt", "He would win easily", "Yes", "I need help to get better at the game", "you should watch moon knight its so cool", "I watched the moon knight show it is good", "Yes", "Hi everyone has your day going and your day going on tipkol gomre", "I have challenge for you TG a sniper challenge only that's that only weapon you can use your videos or great I learn a lot from you but I want you do really do the impossible", "I wonder why they isn’t in pro am", "thanks for the amazing content!", "yes you should watch it, it is amazing!", "Yes you should watch moonlight", "TV plays what do you mean there is a moonlight Rap", "You should it’s really good", "😱🤗", "Yo u should watch it it has Alexander the great its awsome I love the skin", "Tg play different games fortnite is getting kinda boaring", "Yes it is very good show", "yes", "how does he have no recoil?", "Yes watch the moonknight show", "Mid video", "I haven’t watched it but I really think you should", "Yes he should watch moon knight", "yes you should its sooo good", "You should watch it is very cool", "You should watch MOON Knight it’s sooooo good", "Moon knight is my favorite of any other marvel show, but it might be very confusing if you dont know much about him", "You should watch it it's so cool and he was sleeping and when he woke up and he's girlfriend call him and she said that he was not picking up her call's", "Yes you should definitely watch moon knight it is awesome", "I wish I could play Fortnite with Tg", "4:27, Yes TG watch it, it's an amazing show and onestly I love it", "It is a great show the first episodes are ok but the next three are amazing", "Yes watch it", "I don’t nou", "i copt moon night by accident but this made me feel better", "Yesssssss!!!!!!", "Yes you should watch moon night.", "No", "I got the skin and I’m watching the show it’s so insane I love it you should definitely watch it TG", "Yes you should watch moon knight it’s a great show👍", "Stop gaming you do way too much Fortnite", "Watch moon night I watch almost all your veido", "yes", "Yes watch it", "Pls help", "My user is blkpanther1328", "Yes", "YES", "Yes", "Well I’m not good at Fortnite though", "Honestly he should watch the moon knight show", "It had already been 4 episodes", "One episode every wednesday", "Ya it's on Disney Plus Moon night yeah it's on there I'm going to watch it in a minute", "Watch moon knight!!", "Moon knight show is the best", "TG you should watch Moon Knight it's epic", "Yes, you should watch moon Knight it's really good", "No", "You should watch it", "i love it", "Yes, you should watch moonnight tg.", "U should definitely watch moon knight"]