["lol, imagine if the captain is Darkiplier, and that's why everyone is afraid to agro him.", "im so sorry that i didnit tell thay theres a coat  MARKIPLIER MAKE A ANOTHER CHOICE WERE THE COAT ON MARKIPLIER got it?", "The one thing i wish in this....LUNKY", "Hold up there game theorey", "Mark is good at acting", "This is the best series you got matpat in it and the old actors back this is the best series ever👏👏😁", "dont think for a diddly darn split second i didnt see the matpat cameo", "This has better cgi than paramount studios", "Anyone else notice old mark at 4:17? He walks out of the door and passed you in the hall", "You can see old Mark walk out of the life support at 4:17 , possibly sabotaging it", "Can someone pls explain what has happened with markipliers channel? It’s very cluttered with weird short animated videos and dead bodies floating through space and the last time he uploaded a normal video was 2 weeks ago", "This feels like a scp site", "WAIT! Why is OLD MARK HERE??? 4:15, behind the close up of the crew mate. MARK! WHAT ARE YOU DOING?!", "6:05 Good morning, Captain! We are currently *error.* years into our journey!", "Keep", "Dude is that mat pat", "It gets even better when you realise this is all one cut", "Is it just me or is socks for 1 in the title", "MATTTTTTTTTTTTTTPATTTTTTTTTTTTTT!!!!!!!!!!!!!!!", "Yo I just realized matpat is in this, dang", "Better graphics than flash💀", "\"They're all dead, Mark, EVERYBODY'S dead, Mark!\"", "Great video! Keep it up mark! Your talent is truly amazing 😉!", "Mark Go Weeeee!!!", "THEY REALLY GOT THE KURZGESAGT NARRATOR HJSAGNBDGBI", "i saw someone dancing in the main reactor", "Can I go to space", "Just what happened here? Lol", "Remember when Mark was a fun youtuber?!?! Ah the good old days", "So people still actually like and watch Markiplier?", "Everyone: *violent screams in pain*\n\nMark: *casually showing you around*", "You think they’d mind if I recreate this ship in space engineers?", "Isn’t the thumbnail the horizon black hole from apex legends", "Monke", "The Ad Bring Me Here Dont Ask", "nobody:\nme who has never been on markipliers youtube: whats happening?", "I never noticed that Pokimane is the voice of the software update.", "Best chose your adventure ever", "Epic", "And here we go... again... and again... and again....", "Hey its matpat", "This is garbage.", "Do part 2", "WAS THAT MAT PAT?\nSAGKUHLSHKLDS", "6:37 MARK ARE YOU ALRIGHT?", "You'll make the best possible choices right captain?", "I can't wait to see part 2 and then when it ends he'll probably be so happy that he did this :)", "Did i hear kurzgesagt?", "He made a ad for this was frome a ad", "OMG is that the voice of Sister Location ?!", "Matpat is PURPLEGUY!!!! 4:29", "We socks", "4:29 that guy sounds like matpat from game theory", "Too many choices. Help", "When I saw mark fly out of the window my first thought of that was “Yeet!”", "I’m happy you did this", "I love space this is the BEST AND COOL AND AWESOME SPACE VIDEO", "This masterpiece has an advertisement now.", "imposter", "FIX IT FROM OUTSIDE", "amazing", "Some thing in a nut shell is Boise acting most of the robot voices in it", "MATTHEW FUCKING PATRICK!!!!!!!!!!!!!!", "Is it jest me or does the title picture of the video look like socksfor1", "I love chica in her little space suit! So adorable!", "Am I supposed to play this game", "4:55 Omg Chiiiimca!!!", "I’m getting subnatica vibes here", "Mark is destined for greatness and this, this is greatness", "Words can't describe how amazing Mark and his work here is, it's just outstanding! Along with memebers of the crew like Brian, Danny, Mat, everyone! Just mind blowing stuff here", "fak mareciisplayer green skren", "Catch Danny or Don't Catch Danny, I got the caught Dan ending", "Forth wall budget jokes? Yes", "4:20 Danny! And Brian and Mat!!", "THIS IS AMAZING! I LOVE IT", "They even got CHICKA :D", "Markiplier", "Rewatching this after Matt pat’s video and everything is making sense!!!", "Can’t wait for part two tomorrow!! 🤍🤍", "Did anyone else keep clicking 'fix it from outside' even though they new what it did, because I did", "I'm the Captain? Awesome...", "Going through this with other options. Let’s see where I end up, where indeed!", "Invincible II, good name but... what happened to the first?", "Game theory is gonna go hard on this one", "Woah... turning on the captions makes the story pretty interesting when you can see the captains thoughts before he dies", "Bruh there is comments and live chat bruh", "I was actually not expecting dan to be in this thats amazing", "How do we not catch Danny Sexbang?!", "Why doese it look like the whole ship is beeng controlled by a bunch of idiots", "Did anybody notice mat pat?", "This was insanely dope, I love these interactive films, I gotta go back and do all the different choices 🔥🔥🔥", "does anyone know how many ending there are? i’ve gotten the same couple of endings. i can’t find anymore. help me out here:(", "Hell yeah", "4:26 Ian Hecox from Smosh and PrestonPlayz", "In space with Mark it should be called", "hi", "i cant belive kurgesagt voiced the ship", "Does anyone else think that Markiplier would make a good Doctor Who?", "The way it's an ad makes it better", "how is it done like that.", "I love space so much", "You look like Socksfor1 in the thumbnail", "Hah! “Truth be told, we couldn’t afford to show you that anyway.” Nice 4th wall break! CGI is expensive", "You mean that I can choose?????", "DANS ESPACE AVEC MARKIPLIER", "great acting", "Damnnn the Dead Space remake looks so good, Isaac's movement looks on point, one of my favourite video games out there :)", "Bro looks like a Boy Scout 💀", "Incredible", "4:40 theres matpat", "Started my first run and got frozen in a cyro pod forever.\n\nI’m on my second run now and I’ll report back once I get another ending.\nEdit: yeah I died alone.", "I saw this as a ad lol", "Is there something before this?", "BRO WHO SAW MATPAT?", "Why does it look like socksfor1 in the thumbnail", "Matpat what you doing there!?!!?!?!?!", "Imagine how many times he had to drink those 2 glasses", "Imagine how many times he had to drink those 2 glasses", "4:30 HOLY IS THAT MATE FROM GAME THEORY?", "Okay so if you choose to repair oxygen you will go to a bad ending and if you ever go towards the light you will get a bad ending", "Matt Patt cameo. Such a nice little detail", "What just happened?", "it said this was an Ad lol", "Plz tell me im not the only one, but is anyone else getting call of duty vibs from this?", "I SAW MATPAT AT 45:7 ON THE RIGHT", "Me at 1:40 ayo wth", "Dannggg dat look goooood!!???", "“You’re the best captain on the planet, I’m not even squidding”", ":0", "OH No CAptIn iM  FallInG  catCH MEEE", "Yes I will", "no way among us", "Matpat is on the ship so I’m sure AT LEAST a few of the crew members will be fine", "It doesnt give me the option to choose ;( is it just for pc? Or is there a way to do it in tablet?", "You should make a zombie apocalypse with markiplier", "Can*", "I cant tell you put alot of effort in this", "I found matpat in there", "chooses crew over and over", "How do I get rid of this fucking ad?", "JC", "No I don’t think I will", "7:05 matpat", "No", "Holy shit, I actually can't believe I missed this. For three weeks!", "Chica’s training is immaculate!", "I mean matpat", "Uhhhhhhhh I think I saw matdata there who tells “engines are looking good captain” he even sounds like matpat", "So good", "4:23 Is that Dan Avidan from NSP and Game Grumps?", "Yeah... i cringed. Probably i'm too bored and my expectations too high.", "I love these things", "Bla bla", "1: The number is the amount of videos I have clicked in In Space with Markiplier Part 2 yet", "I love Danny in this", "Crazy how markiplier started with nothing and now does this crazy shit its fucking amazing", "Ahh! Sudden Danny!", "He should make a game or a VR so people can act like they are really there", "rip markiplier the best youtuber known to man", "I saw Matpat and was like. Hold up- wait a minute", "NINJA BRIAN LETS GOOO", "In death as he was in life - struggling with windows", "who played gunther", "I like how they got kurskuzart to voice the computer", "drop a sub for a cookie! 🍪", "4:30 matpat? 😳", "is it just me or does that ai voice near the end sound like kurzgesagt", "That intro was sick and it was hilarious when they sed you couldn’t afford to show the ship I know this is gonna be good", "guys help i forgot how to get to the  part with the wormhole and we get the optio to pop'er in reveerse", "I think i just saw matpat", "At 5:58 there's a voice saying \"don't give up\"", "Wow he even got kzgsard narrater", "Time to go save Mark ig", "I wonder if the second part will be directly accessable from the endings of the first?", "MATPAT!!!!", "WOW", "PDS Get No A++", "It’s not a mistake✨it’s a masterpiece✨", "Is that the guy from Kurzegaght in a nut shell", "In FNAF with Markiplier?", "You knows something is wrong when someone mensions literally any error on a ship", "Space", "Mar par", "Whait a second is that MatPat", "6:34 YEET\n\n\n\n\n\n\n\n\n\n\nYou have to pause before clicking the blue numbers", "MAAAAAAATTTTTTPAAAAAAATTTTTT!!!!!!!!!!! 4:30", "Woah when is this movie coming out", "did anyone see matpat", "nice", "This was brilliant and it made my day🙂", "Saw this on my ad and clicked it lol.", "\"You don't need to know how something works in order to use it\" i feel relieved to hear", "Is like the backroom the infinite the story", "4:30 Matpat!", "My first run - I got the chill ending!! How many endings are there?", "Among us", "kurzeggreg\n lmas", "Old mark just… you know", "AHHHH I JUST SAW MATPAT AT 4:27", "Yay I loved heist with Markiplier now this is going to be fun", "So glad they got kurzesgant", "I have spent more then 2 hours trying to find a darkaplier ending and I still haven’t found it", "this is the second time im doing this", "ANNNND  done... going to relax till part 2", "This is so fun 😆 nice job everyone who worked on this.", "Hello Dan, Ninja Brian.", "4:30 Matpat! :D", "🤓🤓amogus🤓🤓", "Bro kurskegats voice outta nowhere confused me so much", "Good stuff !", "well this is a weird episode of the office", "Oh my god “Invincible II” implying that the first “INVINCIBLE” ship was not actually invincible", "I'v finally done it. I reached every single ending, found every \"Easter Egg\". Now I wait for the zenith of In Space.", "Love the way MatPats cameo literally says \"Engines are looking good captain\" LOL", "Definitely getting doom vibes", "mapat: Engines are lookin good captain\nme: nice really good fatpat", "Why does mark look like brimstone", "At 4:33 was that MatPat?", "Wait, so he went to space?", "I got an ending and than I decided to just restart", "Did I see MatPat?!?!", "MATPAT?! BRO *WHAT?!*", "We need this in VR", "Welp. Ive seen every choice... Damn. This is wild...", "\"Oh no, captain im falling catch meee!\"\n\nDoes not give to fricks", "In space with marker", "Wow this is so cool love video", "Everything comes together to be one end which is good because then it would be even harder to make part 2.\nAlso, I think we are mark's dog because in one of the easter eggs he said your not a dog, or are you, but we might not be because marks dog has brown eyes, not grey. Also, I think the one behind all the paradoxes is Willford Warfstache because in the other easter eggs you see a paper face of him. Also if I call this then I will be so happy.", "MATPAAAAAAT", "This is such a super cool project, Props  to mark and everyone else who worked on it.  Does anyone know how many endings/paths there are? Ive gotten 4 so far and 2 i think are 'true' endings.", "Ahhhh matpat", "Mmm space I like it", "Why is mat there", "That's Matt pat", "amazing", "4:28 OGMOGMOGMOMGOMGOMGOMGOMGOMG ITS MATPAT GOMOGMOGMOGMOGMOGMOGMOGMOGMOGMO", "Thank you for making this Mark i had so much fun 😄👍", "Im excited for ISWM part 2!", "This is amazing!! I love the bits of comedy mixed in with the spooky. The scenes of \"that's not me..\" are a core fear of mine. This story is great and I love seeing all the people working with you on this. I could go on and on. Well done Mark, this is incredible and I can't wait to check out part two!!!", "okay, hear me out, apocalypse with Markiplier. I just thought of this because I had a dream about it.", "Matpat should make a theory about this", "3:36\nIf you listen closely, you can hear a quote from the movie Passengers, which is fitting, because this is similar in a lot of ways.", "I have a feeling Part 2 is going to show us how the original Invincible was destroyed", "LMAO 4:12", "Well, after the disguise didn’t work, a few nearly dead markipliers, jumping in countless times, pop’n her in reverse, getting shot by a gangsta wormhole, using a shiny stone thingy, and opening a few doors, I finally finished this masterpiece, or at a least part 1.\n\nEDIT: I’m surprised I didn’t choose plan k in my first run, considering how wild it was", "This whole thing is pure gold!", "4:30 MATPATTTTTT!!!!!!!!", "3:03 \"Built like a tank, too!\"\n\n\n\n\nyeah, a russian one", "Mark you should do something like this for vr", "My sister's birthday is May 2nd Monday when in space with markiplier part 2 comes out.", "4:58 dog", "I did it, I finished it all. I took EVERY choice and did all they different outcomes and paths, lol. Now I know all the LOUUUUUUURR", "I don't know why but I have a vivid memory of markiplier making (or at least starring in)  a game where you are on a ship and you can explore around free roam style.. you're supposed to stick around and watch cut scenes and help out the crew to stop various problems with the ship as well as try to save the ship from going into a sun. However if you backtrack at some points or avoid listening to all the cutscenes, things happen where mark can try to follow you and get you back on the mission. But what you learn is mark is actually an alien (in an among us style scenario but he's more like... alien from the movie in species type) and he's been killing off people you left alone. and you're ultimately trying to 'escape' without being caught by mark or his alien counterpart.", "the best part is matt... he looks so uncomfortable.\n\nactually no. its \"initializing emergency waky waky protocol\"", "Not chica in this too", "4:30 I just realized That Matpat's name tag says Pog28", "This is the best thing on YouTube.\nCan't wait for number 2 tomorrow.", "\"Engines are lookin' good, captain.\" -totally not MatPat", "Don't worry Mark, I'll save you, I won't kill you, we'll work together as a perfect team! I'm the captain you can trust me ;)", "\"Oh no captain I'm falling catch me!!!.....\" -that random crewmate", "5:00 DOG", "\"And when we found it again, it passed every safety test with flying colors.\" Says this while the control panels are sparking.", "Bro I just watched a damn movie", "This is better than anything on Netflix currently", "I just realized the ship from the front looks like darkiplier", "Mark finally achieved his dream to go to space.......RIP 🪦", "Wait, is the computer the Kurzgesagt narrator?!", "No one:\nLiterally no one:\n\n2:20 Old Mark spotted in background!\n\nbut hey at least we spotted him at 4:19 too…", "Hearing Steve’s voice was very surprising (the Kurzgesagt narrator).", "This is so cool", "Ben 10 flashback 1:06", "Seeing Danny suddenly made me laugh pretty hard ^_^", "Every body sub to markiplier", "It being my second time now I will actually try", "Anyone pay attention to the red and blue flashing while they was being scanned in the elevator??  Could the captain be ...............DARKIPLIER?? And he also changed position after the flash.  THE LOOOOOOOORE!!!!", "5:17 you just drank my apple juice-(I know it's not apple juice lol)", "That mat pat cameo warms my heart.", "MATPAT IS HERGEHS YESHAB MATPAHY", "How is cryo alive I just saw hime die ....", "Anyone notice matpat", "CHICA WAS THE GOODEST GIRL WITH THE ACTING", "🥤😀🍿 10/10 anybody who disagrees with go missing you have been warned", "2:19 shows Old Man Mark screwing around with the warp core.", "My heart skipped a beat when i heard MatPat speak", "Who is even releasing the patch update to the software to the ship? Is it even connected to the internet? If so, why are there people releasing updates for cryopods that aren't applied automatically? If not, who even downloaded it in the first place?", "Just realised the captain is Wade", "2:53 \"Ive yet to meet somebody that can outsmart bullet\"", "there are A LOT of memes references in this video", "how do i play this i'm confusef", "tf2 meet the heavy reference ?? 2:51", "Wait did I see MatPat?", "When the window busted after Mark was revived, and Mark screamed, that generally freaked me out. He sounded so scared.", "markiplier you should try playing: metal Dead, the game is so good & it's worth playing!", "Why You Not Making Games Anymore", "4:30 for the gametheory lovers", "Better to see this late than never", "dope", "the MatPat cameo was amazing!", "😂😂😂😂", "matpat! oh yeah and markiplier", "having kurzgesagt as the voice of the ship's computer was an absolutely stellar touch", "did you notice they got the kurzgesat narrator to do the ship's voice?", "\"you don't recognize the bodies in the wormhole\"", "We need to make that in VR.\nWE NEED THIS TO BE IN VR", "Hi Markiplier", "did i see the lad from game theory?", "I saw matpat 4.32", "lets throw markiplier into the new stargate series", "I’ve seen all of Part 1, and I’m excited for Part 2!!!!", "It says this is a ad what", "The theorist appears", "Alright time to make mark suffer as much as possible", "Engines lookin good captain -MatPat", "Is it just me or is that “a game theory” 4:30 or am I dumb", "just a few more days", "doggo was in film :)", "made this an ad yt said", "I love this so much I did one playthrough from my initial watch and then I'm going to try to get all the endings now I haven't watched the heist with markiplier or a date with markiplier yet after this run through I'm probably going to but I've heard amazing things I know the amount of time and effort and creativity that had to go into this is something that I don't think I'd ever have been able to do myself and Mark just keeps going with these ideas I mean a heist with mark, Damian, a date with markiplier Unus Annus. I mean they're all just so creative, captivating, awe inspiring (just like space) and amazing and there's so many different ways it could go I respect the amount of time and effort and just everything that Mark puts into his videos and the series and it's amazing and Mark will continue to be my favorite YouTuber for that fact. His effort, love and passion will be something I respect and he'll never get old for me. Happy 10 years guys (this is my 5th-6th yr)❤️ Love you guys", "PLS viewmodel_fov 90 NOW", "MATPAT GAME THEORY", "Mark I love you for this", "The guy in the thumbnail looks like Socks for 1", "love the inclusion of kurzegagt as the voice of the system", "Hey mark will there be a spanish dub?", "I had so much fun on my birthday. Can't believe it came out right on that same day :D", "AMONG-", "Wooo! I’m back here for the second time, trying it out until part 2", "At 4:59 did any one else see Chica at the left corner?", "I love all the cameos in this  Danny and Brian are just 🤌🤌", "Is that kurzgesagt I hear as the onboard AI?", "Matpat", "\"Initiating wakey wakey protocol\"", "This whole thing feels like a Disneyland ride and I have no complaints", "Here we go again", "OH MY GOD MATPAT !!!!!!!!! YES !!!", "i LOVE THIS SO MUCH", "Idk man when the say “nothing can possibly go wrong, right?” Something always goes wrong…", "MATPAT", "Why does Mark remind me of a more modern count olaf?", "I just made pyro noises during the speech part, i guess everyone enjoyed", "MAT PAT!!!", "yoooooooo matpat looking kinda fresh", "matpat!", "Seems like the plot is you are in the future", "4:30  matpat", "Godzilla Vs Kong In Theaters And On Hbo Max (March 31 2021)", "The music intro for this is awesome!!!", "omg is kurzgesagt", "Every time I watch this I get goosebumps", "Mariplier ads be like", "I just saw a billboard about this on the road just driving around, and I gotta say…\n\nHOLY CRAP I am so happy for Mark ❤", "I love this.", "is that guy from kurzgugat in a nutshell", "Pp", "/", "anyone notice ol' matpat", "Mmmm yes :))))", "Please subscrib this channel🙏", "First time I see Markiplier an am low key surprised he's gotten close to 40m subs...", "Cool beginning", "Saw ads of this everywhere but didn't give it a try whatsoever til now, every time I ignored the ad I made a mistake because this show is magnificent 💙", "We’ve done a heist and gone to countless lands and finally space", "Wear your hats properly", "the ship voice is Kurzgesagt!!!!!!", "😆👍 NOT WHAT I EXPECTED! AMAZINGLY FUNNY!", "Could have swore that I heard kurzgesagt as the speakers on the ship.", "Bruh", "Us: moves girl out the way* \nDan: OH NO CAPTAIN CATCH ME!!!", "9", "Oh another one of these garbage things.. acting an props are D Grade.", "Gotta love how MatPat's badge says P0620 which is basically POG20", "He has an incredible mind like making the invincible II but why don’t they make it in realife?", "This is now on ads", "MAT PAT?", "Matpat is there??", "Wait a min a YouTube video as an advertisement", "my last ending was old makiplier and the thing that gives you the gem", "Mark has this combination of Jim Carrey and Robert Downey Jr", "4:30 was that matpat!!!?", "I love how marks dog is part of the crew", "It's called the invisible...2 so it's not really invincible", "Did you know how far behind you are now? \nA man will have 1 wife and have 2/3 or maximum 4 children BUT a real Muslim man will have 4 wives and will have +8 children! Because for Islam it is a sin to have an abortion or use a condom! So you calculation how much time do you have? \nDid you know! there more Muslims than Indians in India's 9th state? \nDid you know! More than 11 Muslim babies are born every second then none Muslims? \nDid you know! Yearly +7% of world population trun to Islam\nDid you know? More people trun to Islam in pension, as Quran say 'anything/crime done in the name of Allah is FORGIVEN'' \nDis you know? There are 21 different benefits for only being a Muslim.", "4:30 was that matpat? But hey that was just a theory a matpat theory.", "Theres game theory", "Who else saw matpat?", "This is the greatest PLAAN", "There's no way I can't get them all", "I didn't know matpat was here", "MAT PAT IS OF THE CREW", "Are we not going to talk about Maks ship says INVINCIBLE II.  (II/2)", "Invincible 2? What happened to the first one XD", "It's been a while", "yes", "I just went through EVER SINGLE possible choice combination... A bunch of diagrams, 6 pages of notes later I came to the conclusion.... That I Love this man's content. I am blown away and I love all the different creator that collaborated. Can't wait for the second part.", "anyone hear it?? OH... THAT'S... SO... COOOOOOOOOL", "The ansolute amount of creatoers and effort you put into thease is astonishing", "This whole thing would be a really good game with intentional glitches", "I like the 2702 he added in there that’s funny lol", "Noice", "Can you imagine being this famous and ubiquitous lmao", "this dude reminds me of a far cry villain. great actor", "So awesome!!", "Y’all are the best", "WHY IS NO ONE TALKING ABOUT HOW CUTE CHICA IS!?!?!", "Wow this would be amazing for an ad. I really love the content and effort you put on this!", "LESS GO MARK", "Where socks for1 he should be here", "Wait was that jibi?", "I am waiting for part 2❤️❤️❤️❤️❤️", "Good to see matpat in the vid", "But being for real istg i'm gonna k1ll everyone on the ship-", "Zff", "This is so fake", "MATPAT YOOOOO", "Is this a movie bc if it is not I can't believe that it's not bc this is amazing", "2:34\nM Y  E Y E Z", "Wakey wakey protocol love it", "Ummm, I think that there was a mix up with job applications...", "lol I got an ad for this 😅 I would watch it but I’ve already watched it 2 times!!! Can’t wait for part 2", "my name should be exotic butters 😂", "I feel like I’m in halo", "I  also sub", "YES SIR", "Greg Paul", "The warp core reminds me of half-life", "Hii I was just wondering if next video I could get a shout out I really love your videos", "Did i just saw mat pat!?!? 4:30", "Hey mark has played outer wilds right? If he didnt he should, he would absolutely love it", "Rewatching this.  I'm realizing you probably do need to know how smth works to use it...\n2:24", "Great adventure!", "Very cool", "You make the best videos ever", "I love when markiplier does these stuff, \nit’s actually fun", "Videos are so bad", "2:46 is that event horizon?", "the second i saw matpat in the video the video got 10000000x better bro", "MATPAT AHHHH", "Love your vids Keep it up", "Wtf is going on 👽", "Bro I saw matpat", "Markipiler:go ahead say the word \n\neverybody:……….. \n\nliterally me:deez nu-", "Was that matpat... *IN SPACE*", "This is amazing Mark please keep making more of this content this is awesome", "Yo you got kat pat in this", "Brilliant thank you", "CANT WAIT FOR PART 2", "Whenever I see a YouTube originals intro, I think, \"I think I'm going to be sick.\"", "Mission Go", "I was watching and saw matpat with the tag pog20 also and just paused the video like, WHAT", "Here we go I got my pen and paper let’s see where my choice’s lead, time to get all possible endings capm’n", "\"You dont need to know how something works in order to use it.......\"", "There is a thing I can't stand. Staring at a screen and just watching like someone play a game or watching an incredibly dull film but there is one thing about in space with Markiplier that makes this one of a kind YouTube vid that I can watch: interaction. You are the captain, the descision maker. Your choice matter. This yt vid is so interesting and exciting that I can't wait for the next part. ABSOLUTE MASTERPIECE!!!!(ﾉ*0*)ﾉ", "This just makes this extra sad because ME the Viewer Has To Make the Right Choices And when I pick the wrong the Choice Then It's entirely MY Fault, I-i Don't think We're gonna Survive Crew", "Mark really gives off Jim Carrey Eggman vibes and I love it", "I Feel like he will wake up and it be a dream", "It's an ad now thanks yt", "Is this rea lol?", "Kuzagerer did the voice right", "This is why I love Markiplier with my entire soul.", "I know I’ll make the right choices :)", "Never noticed matpat in the start till  2nd viewing.", "Seeing Chica made my decade", "This is so godly", "This is crazy", "POV: you clicked on an ad😳", "I love space so much", "I see you avidan", "Invincible 2? Then if there is 2, it isn’t invinceable", "I love how mark gets launched out the pod then immediately sucked out a window 😂", "4:32 how did you manage to get in this video MatPat?", "Its matpat 4:30", "OMG MAT PAT", "I hope it is as gud as a heist with markaplier", "matpat! Is in it", "Nali", "ASMR with Markiplier in space", "Markiplier even advertised this on youtube ads😂", "MATPAT IS ON THIS????", "Did I just see Mr. Dan Avidan???", "I got the \"call for backup\" ending and I have no idea what's going on", "MATTPAT", "Sir yes sir", "I’ll just fix it from outside!", "Artic melody", "WHAT THE FILM THEORY?????!!!", "Amazing name", "Any more business scams this week Mark?", "came as an ad on my recommendations! ,, gotta watch this ! :)", "So this turned into an ad and i love it", "This looks like real space", "THE WARP CRYSTAL LOOKS LIKE THE GEM ON THE BOX OF HEIST!!!!", "Holy fuck this is good", "4:30 is that mat pat", "I saw mat pat, I can never escape-", "You got halo in my half-life", "Markiplier is a time lord?", "Omg Brian XD", "It is time to get right with Jesus. You aren’t going to automatically enter into heaven if you have lied or stolen or had premarital sex. Don’t deceive yourself! The punishment of sin is hell fire. \nJesus died so you can get a clean slate and forgiveness of a future sin when we confess and forsake it. When you start to follow him you have to strive to obey what he commands. \nNo one will enter heaven without the blood of Jesus. No other way but through Jesus!", "1:07 is that greg paul", "this really feels like a game! and damn ur good at acting!", "Markiplier flying into the wall like an NPC in a game at 6:32 is amazing😂 I remember moments of 'The Hiest' that shown scenes like that. Btw I love the first perspective stories and exploring things with Mark. Markiplier has a way of making any sentence hilarious. This is a 10/10. Can't wait to see part 2!", "*me here since mark was my childhood and wanting to protect*", "Is markiplier a supernatural being he appeared  just in front of him when he was behind him", "OH MY GAH MATPAT", "Is there a  🪣", "I like how at one of the endings, mark smothers you with a pillow", "hi", "I was not even surprised when I saw matpat", "HEEEEHEEEEHHEEEEEHAAH", "Serious star trek vibes", "How is this a thing like a ad", "Dude how did I nearly miss Dan falling😂", "MATTPAT!!! GUYS FNAF IS REAL IN THIS UNIVERSE", "Me like soundtrack", "*DON'T GIVE UP.*", "I didn’t know there were ads for this on YouTube", "Why’s this an ad", "XD loved the \" software update \" part", "more", "Bruh I end it then and it did not gime a otion", "Very Command and Conquer.", "So basically \"The Jaunt\"", "Ilike the part that kicking smashing  mark and the end abuse he said what.       What", "We needed this", "Mark in everything else: I COULD'VE BEEN AN ENGINEER\nMark in this: Hi! I'm the head engineer of this ship. Got NO idea how the engine works though.", "This is my third time doing it", "Another unique choose YouTube adventure, even long after the legacy of chadmattandrobs adventures, which are still around n cool!", "That’s matpat", "So much of this ship is Event Horizon references and I love it.", "Is that socksfor1 on the tumbnail", "Dude this is an add now they made it an add", "How is this a add", "Omg were in a wormhole oh noooo", "Damn we must be the most attractive person ever", "Times like this, and videos like this, I wish Mark would break into the acting scene and be on TV shows or movies. I just want to see him onscreen and fangirl over him again, but this time as an actor. And have him have more fans and let him be a household name because I believe he would still find a way to give back to the community despite his success ☺️🤗", "Man gotta love there's 0 adds", "Amongus Time", "Mat patttt!!", "Did anyone notice something strange, because i did, that strange thing is glitches. If anyone noticed this to reply to my comment", "The best part was when Mark got ejected out of the cryo pod. You'd think that Youtube would be able to make something with high production value. Guess that joke about the budget wasn't just a joke.", "Tip: don’t look at the comments when playing this. They might have spoilers…", "Or is my mom remember to punch", "The only game in space where if your a markiplier fan or a fan of any of these people you regret everything bad that happens", "Now that’s how you start an intro", "There a wind in space!?!!?!!", "4:48 oh thats so coo oo oo ool", "An add took me here", "“So much space, need to see it all”", "✨Among us✨", "What could possibly go wrong?", "I'm pretty sure I was supposed to be on a date with mark", "Mark:what could go wrong with a thiem like this\nMe:subnautica", "Is this warhammer inspired at all?", "AYO MATPAT IS ON HERE TOO?!?!?!?! WHAT?!?!?!?😮", "I want to be nice to Mark because last time I abused Mark and I feel ashamed 😔", "Ok this time I’m not going to do stupid stuff", "You are awesome. New age of ytb. Future. I love it. Good work", "I laughed so hard when I saw game theory in the video XD", "we are bros hey whats up my bros", "We eeeeeeeeeeeee we", "Markiplier you are the best", "Omg", "At 4:19 isn't that the old markiplier in the background from the end?", "WOAH WOAH WOAH IS THAT GAME THEORY GUY FORGOT HIS NAME AT 4:30?!?!", "I would have caught", "Dan and ninja Brian YES!", "An add", "I hate this is a ad", "FUJVNLKDF2", "This is next level content.", "Noooo way THEY GOT STEVE TAYLOR TO PLAY THE A.I. aka the guy who voices kurzgesagt - in a nutshell -", "A\nA\nAoin", "Is the happy birthday protocol a reference to the forest happy birthday protocol?", "Sneaked in matpat", "*PAC* with Markip 0:17", "Here we go again", "emergency wakey wakey protocol, very scary", "Wait I heard don't give up", "This is LIT🔥", "Guys, this is just a complete theoretical question: What route kills the most people?", "Omg I absolutely love this", "Wait so it's an ad now, Dang", "So what was old Mark doing in life support at 4:17 ?", "This is even better than the heist story. Here’s hoping in part 2 you get to have a romantic option with everyone like in mass effect😂", "\"You don't need to know how something works to use it\"\nYou kinda do", "I love Bert!!!", "space is cool", "This is the greatest best series of choose you own adventure i have ever seen. And i have never seen anything like this show. Markiplier must have spend the most time on this series than anything else. I love outer space and traveling through the universe like and quantum theories.", "🍗", "Captain Fred Durst there at the beginning.", "Ninja Brian", "Lmao 😂 all the wrong choices 😎", "Matpat?????  NANI!!!!!", "was that matpat...", "Greg paul?"]