["NEW PROJECT IN THE WORKS:\nhttps://www.kickstarter.com/projects/retrodigital/scp-heretic", "man, i hope heretic will come soon cause it looked awesome and would be great in this series\nlove your stuff man", "why did I just now find this", "Amazing Work! keep this up!", "The acting here is incredible! It genuinely feels like I’m watching an actual Covert Ops mission!", "Flannel dude gives me Ghost Recon Breakpoint vibes.", "\"So which MTF unit should we deploy for this mission?\"\n\n\" *YES* \"", "Okay overall this was an amazing movie great job on it but some all the tactics were a little strange, for one thing when they're walking through that open field I was thinking all they're going to get ambushed. But overall great job!", "The face he made after the figure moved at 19:17 was that of a professional actor. High quality stuff here", "23:23 Hermosa elección 😘 Likeex.Uno de los mejores conciertos ❤️\n\n\n23:23  Senada: \"Hermoso\"\n23:23  Megan: \"Hotter\"\n23:23  Hopi: \"Sweeter\"\n23:23  Joonie: \"Cooler\"\n23:23  Yoongi: \"Butter\"\n23:23  Amor: \"Momentos\"\n23:23  Alfiora: \"Preety\"\n23:23  Alana: \"Awesome\"\n\n\n23:23 Son unos de los mejores conciertos, no puede ir pero de tan solo verlos desde pantalla, se que estuvo sorprendente 🖤. ZyX\nhay nomas pa ra reirse un rato y no estar triste y estresado por la vida dura que se vive hoy... 🖤", "This was excellent.", "anime patches lol", "2:14 yes, why are we using so much mobile tasks forces?, Are not those squads supposed to be reserved for emergencies and extreme situations?", "It this an original story or it is based in a preexistent story of The Foundation?", "bro this is legit a movie", "They should make a full scp 096 movie than the other one only about the first time the foundation contained 096 Like with zulu -9 -a and zulu-9-b", "Amazing, guys! Great job!", "This needs to be a game", "DADDY", "1🇺🇲🙆🏼OMFG TITS!!!!", "Brilliant movie, thanks.  Just one gripe though ; the music is just a bit too loud and drowns out some of the dialogue.", "https://youtu.be/f_H7Q_FyCsw", "This Sunday, 7 of the world's most hard-core airsoft players get dropped by helicopter into some forest to pretend they're actually doing some tactical maneuvers", "I found myself leaning forward, quite literally on the edge of my seat. Fantastic work!", "You wouldn't believe how many times I've watched this since it came out. Everything about this film is amazing", "God can I just saw the mission briefing was absolutely amazing! The way the SCP agent and the commanding officer of the unit spoke was spot on with actual mission ops", "good moive", "Part 2?", "Normally I don't watch. \"Scary\" Movies. But this. I loved. Everything in this movie was a 10/10.", "Here because of #Cbrnart podcast", "this was better then half the shows on netflix", "SPOILER:\n\n\n\n\n\n\n\n\n\n\n“Look at me and tell me I am not the most valuable member on this team”\n\n“Fix your fuckin’ seal, dude.”\n\nI’m loving the banter lol", "The breach and clear was very well done. The door was checked and opened instead of attempting to kick it down/shoot it down; everyone was communicating; I saw a few pats  on the shoulder to indicate to the man in front that there’s somebody behind; everybody checked their corners and knew where to look at the end of a hall and into a room. Very good, I like this.", "Yeah good job on this , it was very real because in real life there are many unanswered questions. And here being up against something you don't understand and just dropped into the hot zone not knowing what to expect.  This was a great film and alot can be done with this story. It's unsettling because you're waiting for something to happen and it's not what you would expect.", "Awesome", "Dream job, damn this was fucking sick I can't stop watching!!!", "I had a police helicopter flying around overhead barking something i r l all it did was add to the weirdness. This was absolutely fantastic!", "New fan, nice quality work", "Re-watching for the 5th time, it's still gold. Love the different uses of the different MTF's, Epsilon 6 is my favorite though.", "Just goes to show how scary being an mtf member would be", "is this dude  irish 1:24 \nYAY IM IRISH and love scp EERE", "AYOOOOO THE 3 GHOSTS THEY ARE AN SCP OMGGGGGGG but how did they escape?", "Farcry 5", "04:02 5,9 vs 6,0", "I'm fairly new to scp universe....been here a year or 2 at best... following volgun an orientation an the like 😆 this my 3rd royalty vid, an  just 3 mins in.... TAKE MY MONEY 😂😂 lotsa ppl will do scp wrong, but you feel right !", "This shit's not even SIFI!  ):", "I'm the most valuable member of this team.", "Good god. They unlocked Minecraft creative mode", "日本語字幕うれしい助かる！！", "This is good! Could be made into a full feature. Or maybe a series where you follow the ops of this team.", "When I first found SCP I though it would never get this big, I can see the love this short-film was crafted with. thank you really! always was obsessed with the tactical side of SCP.", "Do any of these follow a particular order???", "This is by far my favorite fan film I’ve seen, this is what fan films should aspire to be like.", "I finally just drew the parallels between SCP films and the V/H/S series, which I both highly regard.  Wow..... lol.  ANOMOLOUS, BOI", "The MTF doesn't come off military enough, more civilian :(   Make these mofos hardened and serious, it would make a more serious impact", "Oh we’re special agents that wear flannel", "I’d load a full fucking mag into that thing", "The one gripe I have about these short films is that the MTFs would be allowed to have shitposts/stickers on their gear. I think it takes the seriousness out a bit when one of the operators have a TMNT sticker on his chest. In SCP: Dollhouse one of the MTF operators there had an anime one. Is it just me that feels this way? Everything else is golden.", "Wow! Finally SCP foundation movie! I made a comment on another video about the SCP, that it should be made into a movie or series the saga has so much potential due to the vast amount of different kind of anomalies and stories. Netflix movies needs to jump on this asap!", "13:01 or a flat screwdriver to pop the hinge pins, then insert the screwdriver under the hinge and open the door backwards.", "The writing is bad and the ADR is awful.", "Reminds me of His Dark Materials. Basically there is a \"Amber Spyglass\" that can allow you to see invisible macrocosmic energy that transcends multiple universes...", "Omfg the sticker on the vest XD Cowabunga it is", "野外生存玩家拍攝製作的。", "I just notice this. In 20:26, is he fell down?", "I'm a Roblox player and i do roleplay about scp:overlord i like thia movie it's THE BEST.", "loved this!!!! Fantastic work!", "Theres a small detail for mtf is that they wear black glass", "What does SCP stands for?", "I like that, since they said Epsilon-6 (a rural/suburban MTF unit) would be the primary entry force and that they’d be backed mainly by Nu-7 (a heavy duty militaristic task force), you can see that when they arrive at the house, the MTF units in the very front,most likely Epsilon-6, are dressed in more casual clothing in comparison to the more militarist Nu-7 units behind them.", "An explanation of the MTFs featured and/or mentioned in this short film (as provided by the SCP-wiki):\n\n*Epsilon-6 (The Village Idiots):* Specializes in the investigation, containment, and subsequent cleanup of anomalies in rural and suburban environments.\n\n*Nu-7 (Hammer Down):* Armed Mobile Task Force Nu-7 is a battalion-strength force consisting of three company-sized elements of special operations infantry forces, a light armored vehicle company, tank platoon, helicopter squadron, chemical-biological-radiological-nuclear (CBRN) platoon, combat engineer platoon, nuclear weapon specialist (NWS) squad, plus additional combat specialist and support personnel. AMTF Nu-7 is based primarily out of Armed Bio-Containment Area-14 and is tasked with responding to incidents involving loss of communication with major Foundation facilities under circumstances wherein a site-wide breach, enemy compromise, or other similarly catastrophic event is suspected.\n\n*Zeta-9 (Mole Rats):* Mobile Task Force Zeta-9 specializes in the investigation, exploration, and containment of underground or enclosed areas exhibiting anomalous phenomena, particularly those with inconsistent topography or unstable spacetime.\n\n*Mu-13 (Ghostbusters):* Mobile Task Force Mu-13 specializes in the tracking, analysis, and containment of incorporeal or intangible manifestations and entities, particularly those believed to be sentient, sapient, or otherwise intelligent and adaptive.\n\n*Beta-7 (Maz Hatters):* Mobile Task Force Beta-7 specializes in the acquisition and containment of anomalies exhibiting extreme biological, chemical, or radiological hazards as well as the rapid containment and cleanup of areas affected by such anomalies. This includes the planning and deployment of contingencies for wide-area or pandemic spread of anomalous disease agents or other contagious phenomena.\n\n*Lambda-5 (White Rabbits):* Mobile Task Force Lambda-5 specializes in traversing unstable, surreal, and controlled reality, and containing potentially dangerous persons and artifacts capable of manipulating space and time.\n\n*Gamma-5 (Red Herrings):* Mobile Task Force Gamma-5 specializes in preventing the dissemination of knowledge of anomalous events or phenomena in cases where initial suppression efforts have proven ineffective or insufficient, or in cases where such knowledge has already reached critical levels of public exposure. This includes the research and deployment of experimental amnestics as well as memory fabrication procedures.", "This is the coolest thing I have ever seen in my entire life.", "How much money did this cost?", "gool", "Mf really got the Michelangelo cowabunga meme as a badge. Respect", "8:44 tinky winky, bitzy! LALA P O E", "why did I jus watch this, I should’ve showered first 😭. Anyways this is a really good video ! :)", "This is better than mr beast spending 24 hours in area 51.", "That was cool", "Wonderfully immersive", ":D", "scp scp -scp 173", "Meh, Only badass thing is Mercers mission brief", "idk bro, i just type", "And the dialogue is brilliant I love the way you build the mystery especially for people like me who no fuck all about this", "Holy fucking shit!!! This is well made especially the gun effects", "damn that reveal at the end was solid", "1:40 \"Cow-a-bunga It is!!\"", "“Well.. he pulled a weapon on us.”\n“We kind of broke into his house.”\nUnderrated line.", "imagine a monster outside. SCARY. WOO", "*suicides in the basement HAHAHAHAH*", "F.B.I OPEN UP. *well I don't want to come here*", "You are the best S.C.P people known on this team. I am counting on you", "Damn it. Please don't come in my home otherwise I'd be dammed", "Holy balls was this amazing. Quite chilling as well.", "Nice...but too staged...should've used dogs or gas first b4 breaching", "that ending tho cant wait for heretic", "You scp fans are nuts. This was so freaking cool", "kmon men this court is to idiots call the gostbuster and thast it", "This would be an good Netflix series"]