["The redstone is just a comparator lengthening forgot the name circuit xd", "Nobody talking abt him not getting the books in the mansion", "How tf did he  found full diamond armor zombie?", "There is an exposed emerald ore at 12:03", "Rip diamonds\n💎", "Wadzee how did u reset your advancements", "I wonder wadzee loves Vegemite", "Why don’t you make a red stone farm", "12:04 bro why the hell you didn't took that emerald , i mean you get from the village but still it's too rare and that too on the surface 💀💀 . And i am thinking why nobody is talking about that 😂😂😂", "But few seconds later he finds a different emerald ore in a different spot", "BRO didn't saw the emerald ore on the mountain when he said I should probably stop climbing mountains or something", "Can you stop saying you started over bruh.", "The homie sandiction brought me here", "fun fact: the villager either needs to walk in or the Minecraft needs to be pushed into the villager for it to go in. If you try to push the villager in it will not work that well :)", "broo this man is insane if u like youtubers  like thhis  go check out fru", "12:04 there is a emerald block", "Can I ask for a tutorial?🤔", "12 mins and four secs he walks past an emarald", "Lannan is very happy", "I love how he just when past emeralds", "Remember to hydrate before, during, and after watching wadzee videos", "The reason why so many zombies spawned was cause there is a small chance that the zombie is a leader zombie who can spawn other zombies for reinforcements.", "18:05 you missed a diamond!!!", "This series has become more of an actual TV show for me than a hardcore series", "12:05 *passes emeralds**", "iam not too sure on dis so dont quote me but i thought u made balck glass out of ameythest???????????????/ iam not too sure so sry if iam wrong", "please please make a part 8 asap", "can you build a blaze farm?", "hey wadzee mi name is barrett you should get a elytra", "but... why?", "but you missed the dimonds!!!!!!!!!!", "Hi im new i just watched the video and im inspired", "🥛", "personelly i would have just used chunkbase to find the swamp", "nice", "12:03 u can see a emerald ore", "i build this iron farm one year ago before my laptop get broken", "what's up pro", "😤Dimends", "Damn bro, did you actually decorated all of your farms?", "You missed a emrld", "remmber being chased by pacman by fundy", "\"ZeemBie\"", "4:54 youtubers freak out and he just said one good thing", "wouldn't building all those farms there interfere with the iron farm ? like you should build near at i think", "Wadzee you were playing Pacman with funny and Phillis In minecraft", "22:35 how do you have a stack of grass blocks?", "18:06 there is a diamond ore", "Nobody talking about the emerald he walked by?", "I just realized, he went all that ways away to make the nether portal. Yo speed up the process of getting there", "couldnt you just use honey blocks instead of slime?\nEdit: nevermind", "Nobody is talking about how he missed an emerald ore in mountain about 12 min in the video", "You skipped a diamond at 18:05", "U should have named the zombie bob", "I hope everyone is doing well watching this video. NO BAD VIBES HERE", "Next vid: I completed every advancament in hardcore minecraft", "Just saying, you’ve inspired me to start my own hardcore survival world. Been loving your videos recently and just wanna say keep up the good work.", "Bro I just saw this!\nYou should build a 9 whole golf course!!", "12:04 what are the chances of that emeralds over there.", "whats the music called on 14:15?", "Honey blocks would have been easier then slime blocks to get", "U missed emeralds at 12:04", "Wadzee you know you can make leather boots to stop you sinking in snow? Right?", "R.I.P Skeleton horzee", "zambie is DRIPPED OUT!!!!", "why three?", "12:05\nAnyone else notice that wadzee passed an emerald ore which is really rare", "Wadzee make the biggest castle for yourself in this new hardcore world.", "Make a raid farm", "New supporter", "HOW RARE IS THAT ZOMBIE??", "I love your videos", "12:04 *misses emerald ore*", "that zombie with diamond armour is so rear!!!!!", "Good day guys and every episode of hardcore minecraft I add 2 more layer of the melon farm", "Il est en 1.18 ?", "Nobody gonna talk about how he walk by emerald", "he need to sacrifice his horse just to get a new biome", "PLZ do a collab with basti GHG a german youtuber that also makes sucha awesome stuff like u and he Spears english soo PLZ do the collab", "You should make a wizard's tower", "When did he get the netherite?", "*Villager #1*", "So swamp is the rarest biome? Cuz I spawned at swamp", "I accidentally spawn a raid under my iron farm too here's the solution take the iron out of the farm and spawn a lot of iron golems now get back to whatever you're building the iron golem will take care of the raid", "I tried to make that iron farm in this video and it took literally 3 fricking (normally i'd type the actual swear but youtube will remove this comment if i do it) hours just to get the villagers to their huts and it was worth it because now i have over 4500 iro- Wait why do i even want that i already have 2 double chests worth of iron blocks", "18:06 You just missed diamonds 😂", "\"bit by bit this beach is slowly dissapearing\" *Instantly gets flashback to 1000 turtles episode*", "Get Zambie", "Wadzee, CEO of minecraft massivness.", "Idea for a side build, the tree fram", "build a raid farm so you have unlimited emeralds and totems", "11:00 Just get an new elytra.", "18:05 I love how he just ignores diamonds", "WadZee got enchant diamond armoured zombie , very lucky", "Wadzee where is the advancement video please post soon", "I don’t know how you do that every time I do a hardcore world I die before I find iron", "The dedication i love it", "You should make a raid farm to get unlimited totems", "wow toats mega melon gfarm!", "12:04 is that a emrald?", "hey wadzee check this out for your castle gate https://youtu.be/EhcqpvhdJt4", "The Thumbnail looks like the old one, when you made a Automatic farms", "i cant wait for the next episode ❤️", "I love how WadZee just ignored an exposed emerald ore at 12:04", "U don't see the emerald bro 12:04", "Great to see ur doing well wadzee I remember when u had 500k. I even have the 1 mil subs merch. I used to watch u a while ago.", "How can people literally build all these crazy farms in survival when I can’t even build them in creative???", "Did anyone see the emerald while he was walking by", "I always build a house in mc but nere build a farm.", "He said to use horses when he can just make a creeper farm and fly with an elytra", "i mean he had 2485 melons when he first looked at it as blocks", "Did nobody else notice that he said “oh, what the hell am I doing?” And then captioned it as heck? 🤣", "The amount of rare instances almost makes me think a lot of this series is fake because that’s just how rare they are. Not saying it is but come on, full diamond zombie, another woodland mansion, countless new biomes including the lush cave, an emerald block so high up, and he hardly reacts to it all. The amount of luck you have is mind boggling", "Why did he not get the emerald", "dude emreld 12:04", "Wait how did the horse die, it was completely made of bone. There's nothing to be cold/frozen", "you do know that librarians sell glass right ?", "He found a full diamond zombie, and a woodland mansion spawning on heap ass of cobble, with no map", "Wadzee make leather boots to stop falling to powder snow", "NOW THAT IS WHAT I CALL A MELON FARM!", "Minecraft is a 3D sandbox game developed by Mojang Studios where players interact with a fully modifiable three-dimensional environment made of blocks and entities. Its diverse gameplay lets players choose the way they play, allowing for countless possibilities.\r\nThere are three actively maintained editions of Minecraft: Java Edition, Bedrock Edition, and Education Edition.\r\nAdventure menu icon (MCE).pngMinecraft Dungeons is an action-adventure role-playing video game where up to four players can travel through procedurally generated levels, fight monsters, and face off against the main antagonist of the story, the Arch-Illager.\r\nMinecraft Dungeons Arcade is an arcade adaptation of Minecraft Dungeons, which requires four players to play through levels and defeat large groups of mobs. Players can get equipment, skins, and pets by scanning collectible cards.\r\n\r\nDiscontinued games\r\nJournal Icon Open.pngMinecraft: Story Mode was an episodic point-and-click narrative-driven graphic adventure video game based on Minecraft, made by Telltale Games where players had to complete chapters in order to progress, and their choices and actions had effects on the story.\r\nMinecraft: Story Mode - Season Two was the sequel to Minecraft: Story Mode and had a new story continuing the adventures of the original game, with elements from newer versions of Minecraft.\r\n\r\nFriends (MCE).pngMinecraft Earth was a free-to-play augmented reality spin-off mobile game where players travel to real-life locations to build structures and collect resources. It featured many unique gameplay aspects and interactions similar to the main game. The game became discontinued on June 30, 2021.", "12:04 just me or emeralds", "what biome it is at 9:09 ?", "13:45\nah yess floatin vines", "You got so lucky with this video. A zombie in full enchanted diamond armor and a zombie horde. Almost nobody knows this, but lots of zombies can spawn in a small group next to villages that are \"unstable\" (the number of houses changed recently). I'm guessing that's what happened when you tried to go to bed (21:00).", "12:04 bro just passed emerald", "I made a bet with myself to rewatch the whole series before watching this video, and I figured it would be good to catch up on some videos I missed, so now 50+ hours later and 7 days past I’m here.", "I think hes competing with acookiegod", "\"These guys are here for my melons. I won't let it happen. I'll kill you with this hoe\" 💀💀", "Funny thing is i juat made that iron farm a day ago", "literally every minecraft hardcore ytber wastes hours/days just to make content", "Ive build the exact same iron golem farm....\n3 times......\nAnd its not working lol", "its so rare to find a FULL DIAMOND ARMOR zombie", "cool", "You use thousands of staks of glass", "You seems like melons a lot", "Good", "My guy zambie continuosly showing his drip to the villagers", "Loving from kerala like this", "man ignored that emerald at 12:03", "tip: turn on subtitles, really helpful!", "Pause the video at 12:04 and look at the right bottom for a surprize", "Hello wadzee.\nl am korean person.\nI admired your hard work skills\nSo .I had no choice but to subscribe\n\nI hope you post a good video.", "A more efficient mod then the regular zombie would be a husk because they don't burn in daylight but the drip zombie is definitely superior", "you can just make a totem farm then you can get all the totems u want", "wait I thought I saw diamond while he was collecting redstone and just ignored it-\nEDIT: it was at 18:05", "Ironically, Wadzee missed diamonds at 18:05 while saying \"Unfortunately there was nothing of interest down there\". Wow you found a full enchanted diamond zombie, thats like one in a million.", "get the elaytra, to complite atvancements", "Did u just skip over diamonds☹️", "Hey, you can use portal loaders to make it unlimited, and you can use 4 zombies instead of 1 and get 1200 iron", "WadZee never upsets his fans with his videos", "I can't believe ive watched this entire series over the course of two weeks while procrastinating, what a journey", "Where is your one block series???", "It would be really cool if you use shaders", "MELON 🍉", "In my hardcore world, I couldn't get out of the swamp", "you should build a giant melon around the melon farm", "Bro I remember watching you like 5 months ago having 3k subs or something like that, I can’t remember I been working to much haha\n\nNo way it was 2 years ago", "he did not notice the emerald block on the mountain 12:04", "RIP horse", "*OMG, EXACTLY WHAT I NEEDED ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- i obtained free giftcard from* 💜 *\"**getgifts.online**\"* \n Vh", "Bro you got a rare emerald ore  on 12:04 man that's so rare and it's just open! How could you unse it", "Also how r u building so gud", "I love melons and keep making ur amazing  vids", "MORE SKYBLOCK", "You should wear leather boots in the fake snow biome it should give you an acheviement", "Honestly, I am astounded at the extent of your epicness throughout this project. Beautifully done and veyr impressive my friend", "dose anyone know if the iron farm he built would work on bedrock edition", "will the next episode be the end of it and go back to your original place or will you stay there?", "No one talking about him skipping the diamond", "I like how he calls villagers villages 😂", "Do collab with shulkercraft", "12:04 anyone notice the emeralds that Wadzee misses", "I WAS  UNSUBBED  wtf", "I don’t know how you build for that long and dedicate so much time for the one vid we'll done", "18:06 bruh no interest?", "make a duplicate of the farm, one for melons and the other for pumpkins", "12:04 you just get past a emerald", "I love how no one is talking about how wadzee walks straight over a exposed amathyst thing", "Well...this kinda became underwhelming. I honestly thought this would have lasted longer but it seems he'll be done by the next episode.", "Were water check point", "You should upload a little more. Your videos are cool.", "There should just be a random melon house in the village now", "12:04 is no one going to talk about that  emerald he just passed", "21:37 I think he swore", "“Finish” this on Ep. 10", "Lazarbeam would be proud 😁", "This is a Time stand at 12:05 in the bottom right corner you missed emeralds.", "Wait he left his main base?", "Just give the zombie a helmet", "And it was enchanted", "What is the seed of your Map?", "1000 melons per dimension?", "the zombie wont burn he has a helmet", "This series feels like a tv show, and the fact that the next episode will be completing his third objective feels like a season finale! Good luck, WadZee! We’re all rooting for ya!", "New video! www.youtube.com/watch?v=5fXxiy6cjGU&ab_channel=EDDO", "I have a challenge for you to complete which is that combine all the biomes in Minecraft", "Dude Therese an ad that is just Stealing your content to advertise an fake Minecraft mod!", "You cant hide the pikuniku music Wadzee, you cant", "he misses a diamond and says \"theres nothing else of intrest down there\"  18:04", "For find bioms use chunkbase", "He is soo focus on redstone he said diamond isn't interesting", "you are so close to finish your mission still goying buddy dont stop", "You could have made a slime farm underground", "How what why DID YOU LEAVE THE DIAMONDS", "not the haaaaa at 23:30", "I like it broo 😘😘", "One of the best series", "You can do a totem from", "maybe u should get an elytra.", "This series has become more of an actual TV show for me than a hardcore series", "Do you know Jesus Christ", "3:06\nWadzee: PLEASE get in\nVillager: get into where you will ship me to my eternal suffering for your benefit?\nwhat Wadzee should have said: Yeah pretty much bucko", "go to end and get a elytra", "The best part is once he completes the challenges, getting is stuff from the chest won’t matter, only the main part of his world", "powdered snow can be deleted with flowing water.", "If you need more inventory space you can get lamas and put chest on them so you can carry more sand.", "use carpet for the aouto smelter dumbo", "21:04 my men didn't realiz that he got a super rear event", "Um missed some diamonds at 18:05", "12:04 HOW DID HE FIND EMERALDS AT THE SURFACE", "Do you know hoe frickin rare a full dia zombie is", "Hats off to your hardwork for make a single vedio❤", "You can use for the zombie in your iron farm a helmet", "wow, just wow", "I now right", "Rest in peace skele-honse", "uhh the uhm enchanted diamond zombie no one talking bout that, \n\nAlso: Wadzee: “easiest raid of my life”\nAlso wadzee: “we need to run we need to run we neeed to ruuuuuuuun", "Can't believe u missed an emerald block on the surface", "18:05 wow", "can u do tutorial for that iron farm pls", "im curious to see if you make it taller every episode", "bro u got th e dimond zombie bruh", "Wow", "*Wadzee 2030*: Today we plant 10,000 melons.", "You don't need any water sorce for melon or pumpkin", "dude i love how he found a full enchantet diamond armour zombie and went like: \"cool\"", "I desperatly miss the water checkpoint", "12:00 MY MAN WALKED OVER SOME TOPSIDE EMERALDS", "18:5 you forgot dimond", "Imagine when he finished he realized that he placed the observers wrong", "I think the auto smelter could’ve been better with a lava farm, using the new drip stone mechanics", "Imagine getting like by WadZee🥺\n(btw new supporter here 😉👍)", "I’m pretty sure that biiig jungle you found after your horses death is like a really rare jungle spawn", "Bro your videos feel like movies with dramatic music and stuff it's so entertaining", "Wow, so incredible :D", "His new base is better than his old base he has so many more farms and stuff to bulid and a fact it that he wasted so much time in a world buliding usefull and pointless things but if any other youtuber if you will say them to start over in there world they won't do it because they cna lose there world they spend a long time on but wadzee he risked to lose his world which he spend like 2-3 years on and I really like this series", "Did no one notice how many zombies spawned when he wanted to sleep???", "The fact that he found a woodland mansion  and didn’t find a swamp wow", "21:00 epic a leader zombie who summons reinforcements to his aid", "O", "Dude found an enchanted diamond zombie absolute insanity and then added him to the iron farm crazy insane!", "tooo long intro", "This smells familiar", "You know how desperate he is when he goes underwater to mine redstone.", "BROO THAT ZOMBIE", "how do you decide when to switch between attacking with the axe and the sword??", "u da best", "Build a city in the nether I dare thee", "no way you missed the emeralds at 12:05", "😅☝️", "12:02 you found emerald ore", "i made the same farm and it gave so many melons", "I subbed", "\"Big ugly farms\" proceeds to make the most beautiful Iron farm ever", "Can we mention that with the tip of the creeper blow, all of this is gone?", "He just passed an amethyst geode at 12:15", "I cannot express how satisfying it is to me when you finish mega projects, be it decorative builds or gigantic farms.", "The melon farm is the most op thing ever i see", "18:05 bro…💀", "12:04 is that an emerald on top?", "You probably won’t see this but a great way to add texture to builds is buttons. Especially on things like your gravel path and if you want to change the way your board walk looks.", "The editing just gets better and better", "If you use water in the powder snow it gets rid of all of it", "i miss the gday guys", "That’s a rare seed it has A crazy woodland mansion", "maybe when you return to your old world you can make a mega base?", "anyone saw that emerald at 12:04", "Why would you mine for red stone if cleric villagers trade it? Just get a lot of clerics and emeralds to trade", "Rip skeleton horse", "not u passing EMERALDSSSSSSSSSSS", "Wadzee I just thought of a new biom theme build u could make you could make a copper biom in the overworld", "I loved your builing vids", "18:04 bruh 🤣🤣🤣", "new melon farm is far superior to the last one, keep expanding the redstone one upwards!", "Man I really miss water checkpoints.", "How did you get that glass with no lines?\nif it is texture pack can you put in to description?", "Okay okay", "17:56\nUse xray!", "Did you reset your advancements or are you counting the advancements in editing", "12:03 that’s pain", "Will you return to this section of the hardcore after all of this", "Plant 1 melon for every like on the next video", "I didnt know who i was watching until i saw the skin on the end", "love the usage of the mario galaxy music👏", "12:04 emerald  on the right", "The moment he realises he missed 1 melon...", "I love Pikuniku music", "It hurts he didnt use a water bucket to clear the powder snow at 10:50", "anyone else see a emerald on the mountain that he didn't see no just me alright then", "Bro built a if farm off YouTube", "Whats your pc specs?", "Usually harder difficulty = to more more waves", "This zombie is didn't respawn beacouse he have item and in minecart he cant and he cant die beacouse he have helmet.\nYou can build wich farm beacouse it give you glowstone, bottles and redstone", "12:03 EMERALDS EYOOO", "There is a 0.04%", "#melonfarm", "How did u ignore the emerald in 12:02", "15:38 dont destroy bamboo with axe use sword beside its much faster and better, its like dirt and ur shovel", "You want buy a emerald look at 12:3", "I was cliking at gordan ramsays crab beddict and i miscliked this.", "I did the same iron farm before this video dude", "that is NOT an auto smelter. unlimited fuel smelter yes, but not autosmelter. autosmelter is the thing where u put a bulk of item into a doublechest and it automatically distributes those across 20+ furnaces simultaneously. disappointed but still love the content.", "U know u dont need the thing above the zombies head cause he got a helmet", "I really love the way the editing looks keep it up!", "\"there was nothing of interest down there\" \nme: BRO THERES LITERALLY DIAMONDS RIGHT THERE, WHY DID U LEAVE IT!", "Why you need so much melons", "i actually like the way of how you make fantastic farms and here is my idea for the next farm :Make a gunpowder farm by using creepers hope you see this", "Dude walked by emerald ore and just left", "Tutorial for the iron farm?", "so that's why it took so long to post the next episode", "Wadzee trying to find Redstone: And unfortunately, there was nothing else of interest down there.\n\nMe: There's a diamond block", "\"Nothing of importance here\" \n\n\nThe diamond: What am i? A roach?", "Tha zombie is like a 0.00000013 chance", "My man skipped diamonds for redstones 🗿🗿🗿", "PUT LEATHER ARMOR ON YOUR NEXT HORSE IN SNOW BIOMES", "Man our boi just do be droppin' masterpieces every time ! 26 minutes of full pleasure !", "[*]", "Rip skeleton horse", "Diamond zombie 🥶", "U know it's crazy farm when YouTuber make it", "but Wadzee how am I going to watch your videos all the time when you don't upload", "12:04 bro ran over a emerald", "Are we all gonna ignore the fact that you ignored the emerald that spawned in A MOUNTAIN at 12:03?", "I love your timelaps!", "Getting full netherite armour is no big deal. Growing 1000 melons is no big deal. Getting all achivements in 1.18 is no big deal. So do something impressive like getting a FULL NETHERITE beacon again.", "What are you going to use all those melons for?", "U could place water and snow will melt", "Wadzees epic hardcore adventure The Anime", ":o", "“tip”Hey you Can get more sand my tnt", "Im scared of the word \"this shouldn't take too long\"", "give your world or else smosh you into a pancake", "Man I love dis legendary outros and they make me nostalgic and I want You to return home but not abandone this part of world.", "Wadzee: needs a lot of cobble\n\n\n\n\nAlso Wadzee: mines literally every stone except for cobble", "0:35", "Aᴡᴇsᴏᴍᴇ", "BTW \"There is a 0.04% chance of a skeleton or zombie spawning with diamond armor\"", "master!", "Btw for the bamboo farm I recommend not putting bamboo infront of it I've made a bamboo farm and it keeps breaking because bamboos keep growing Infront of it doing some stuff to the flying machine and the only way to fix it is by rebuilding the whole flying machine", "That zombie is so rare bruh, its even rarer than a pink sheep", "lets go home", "I subscribe because u work hard", "There’s an immense amount of rare stuff in this video", "Respect bro!", "You literally ran passed a Emerald block brooooo", "Wadze:*and there was nothing interesting down here..* *passed diamonds when he said that*\n\nMe: THERE WAS DIAMONDS", "Is this dude in SIcarft", "The zombie at the bed was a king zombie it can spawn reinforcements it is found in hard mode or above", "How is it possible that all his levels sre gone ?", "12:05 emerald", "12:04 there is a emerald spond in the mountain", "Cool", "18:06 ;-;", "I just watch you for fun and I don't enjoy this content I just.......watch", "i fell bad for the normal zombie ):", "Cant wait for u to get back home and i hope u update ur hardcore into 1.19 snapshot", "fantastic  vid loved the melons", "12:04 emerald", "12:04 how didn't he see the emrald block?", "Lets make this Hardcore world become world record lol", "Sorry to say about this . Even i am not Sure about this in the video at 14:48 you can see a ore can u say what ore is . If u ask me i would say it is lapis lazuli ore. If  i am wrong pls respond ...", "and you also miss Diamond ore in cave", "how do you means the emerald or in mountain biome", "NO WAY HE DID THE AUUUUUGHH MEME", "can you make a world download in your old hardcore world", "\"Ayy what do you know we found a spawner. Bappity boopity\"", "u missed a emerald on a mountain", "The melon farm produces well over 1,500 melon blocks per hour meaning it produces 0.4166666666666667 melon blocks per second and 3.75 melon slices per second, 225 melon slices per minute and 25 melon blocks per minute\n\nIf you wanna see how truly good this farm is, it produces 36,000 melon blocks in 1 day, 324,000 melon slices, or 13,140,000 melon blocks per year, and 118 million melon slices per year. Great calculations!", "Why need nighttime to move villagers??????", "You  me gave motivation to start up mincraft and get productive", "You found an emarald ore at 12:00 to 12:15", "7:06 thats what she said", "If you got Minecraft 1.19 you better be careful off the new advansment or how do we get here because off warden a new powerful mob that can destroy you and the other mobs if you don't know about the warden then go to google or YouTube good luck", "Wadzee: Gimme that swamp!!!\nMe: GET OUT SWAMP UR WATER SO FILTHY U RUINING MY WORLD", "If he used glass panes on the melon farm it would of been 16 times cheaper with glass", "12:03 Did you realize you found the rarest ore now? Yes it's emerald.", "He found an full diamond armor zombie and emerald ore in the mountain", "The 12:24 part remembered me to the hunger games", "I appreciate how much effort went into this video", "-14:19 emrald on mountain", "The way Wadzee was taking so much damage gave me the most HUGE amount of anxiety I can't I even explain. His videos always get me hyped!", "I am stressed out this man missed diamonds and emerelds", "could you do one where you start over but this time in the nether instead of the overworld", "did he ignore the emerald ore at 12:04 or did not see it", "Hi hi", "i love how i forget about what the video was about and just watched him looking for a swamp", "18:05 HOW DID HE MISS THE DIAMONDS", "Did no one see the the emarald?\n11:55", "What the diamond armor zombie is so rare", "Wadzee is a pro", "Place water in the corner of the iron farm so that you will only need 1 hopper", "wadzeeeee\n that zombie wih daimond armor is rare", "pls for next ep be quick", "Finding emeralds that high are rare and he just passed them like they were nothing.12:04", "‘There was nothing else of interest down there’ bruh he built up and there was diamonds", "Bro do not do that much you can use chunkbase website in this you have to upload seed version and coordinate and he will show you any biome coordinate", "WADZee  is the technoblade of melons", "Dude you can just give the ZOMBIE helmet armor piece so it can't Burnt.", "Rare zambie moment", "Imagine if Wadzee isn’t in hardcore when he builds and photo shops his hearts", "Man took mojangs roast to diamonds drastically", "Amount of slime spawns change with the changes of moon phases", "The luckiest man in Minecraft\nFirst he found a full diamond zombie\nAnd even finding an outpost and woodland mansion", "Bring back your cool intro", "Wadzee maybe you should make a totem farm", "Wait a minute.....12:04 was that.... emerald ore???? IN A MOUNTAIN??????? IN PLAIN SIGHT???????????", "he probably didn’t notice the emeralds", "you literally walked past the emeralds", "You are my favorite Minecraft Youtuber ever #WadzeeMyLove💖", "Why did you make a melon farm I Watch every video that comes out well almost every video", "Instead of smelting sand, cant you use buy glass from librarian villagers? Even though theres only a chance for them to have the trade, that's still a renewable way to get glass, besides duping and with the end portal\n\nEdit: Clerics can sell you lapis and redstone as well", "Take care for your hand broo", "I love u and this channel ive actually been following since the one block skyblock series also yes I am a subscriber", "18:06 wadzee really just jumped past diamonds and went \"and unfortunately there was nothing else of interest down there\"", "every time I get home from school im like OH I NEED TO SEE IF WADZEE POSTED!! and im glad i do because these are the best videos i can find", "Wow great job I am excited to see the other base", "I never knew how to make an iron farm until now", "i've never seen someone so casually skip diamond ores lmfao", "Wadzee walked right by emerald ore at the 12 minute mark", "12:25 amethyst geode", "So this is a new world I guess because you already completed all the advancements", "I’m subscribed bruh", "Zombie later the first one mask in it it can recruit new zombies were the only and hard mode I think you were on an item number", "No one except Banabred: Diamond zombie", "Kinda reminds me of the neverending story", "Today *", "Todas i entered The Wah wah gang", "good job probably took a long time but it was a good vid keep it up and do what ever makes u happy", "If u like this comment you will have good luck", "127 like", "You should build a totem farm", "12:14 tell me cords and your seed pls", "love this series keep it up pls", "Does anyone know the title of the song he uses at the end? It's really good", "build a giant clock inside of the village like Big Ben, but in spruce and deepslate style", "You could've saved the horse with a water bucket because powdered snow disappears when touched by water.", "why move the villagers at night?", "Plot twist: he actually goes into creative mode\n\n  Jk its just a joke i love your videos", "petition for wadzee to remove the slabs on the iron golem farm, since the zombie has a helmet and wont die from the sunlight", "Dude just passed a diamond and said,“there’s nothing else of interest here.”", "Bruh the YouTube glitch is real I was unsubscribed for 2 months", "Bet he really wants to go back to his main base very very soon", "BRO MA BOI JUST MISSED DIAMONDS", "12:05 passes emeralds", "i'm stealing that iron farm lol", "you the best minecrafter in this world omg i have a server and im gonna try make a melon farm luke you.\nyou my idel\n😀", "\"and unfortunately there was nothing else of interest down there\" *ignores diamond*", "when he didn t take the diamond my heart stopped", "Rip the naturally spawning emerald", "join my survival Minecraft world. username: scyther24. bedrock edition", "join my survival Minecraft world. username: scyther24. bedrock edition", "Epic Video 🔥🔥", "Hi my name is 23:30", "12:55 you know u play too much minecraft when you know the biome by the colour of the leaves", "23:30 🤣🤣🤣", "I like how u said nothing of interest and completely bypassed diamond ore like it was nothing bro 😆 a diamond ore is worth it don't matter if it's strip or not anyways tho ur vids keep us playing minecraft love ur vids", "20:40 bro just find an end portal and turn it into a sand duper. (to break end portal frame use a red mushroom and bone meal it)", "Me : yeahh I'm gonna build too \nHim : a 1000 melon farm \nMe : 😳", "12:04 is that an emerald ore????", "Use witches to farm redstone", "12.26 u missed Amethiest geod 😳", "12.04 u missed a emerald block 😳", "Subscribe to encourage me, good", "Godamn", "I just want to point out that just two years ago, skyblock #6, Wadzee only has 1k subs, now he has over 4 million subs", "I am making a video", "Yo amazing", "Coooool", "Yo amazing", "I was looking for some Minecraft videos when I look at you’re I be like “WOW that is some great edit”", "No one :\nLiterally no one :\nWadzee : Leaving emerald ore 12:04", "18:04\nwadzee legit walk pass the diamond\n\n.", "Why did he ignored the diamond", "you missed diamonds 18:05 when you were going back up brother", "Red stone can also be bought from priest villagers. You just need emeralds and brewing stands.", "U r inspiration of the huge builds", "1000 pukpkin Farm now", "I would love to see more meme edits like the snoring from the with poison", "Wad youcan build some around the farms so that u shall no move far for your farms swan proves\nBy the I love your contents", "Is everyone gonna ignore the fact that there was an Emerald at the top of that mountain", "18:04 just me or this annoys me t5he most", "21:00 That was a zombie leader and he can call in reinforcements and I know it sounds crazy but it’s true.", "12:04 He missed an Emerald Ore.😑", "How do you tame a Skelly horse?", "Lets gooo. Soon you will return at your base. Youre the best minecraft player", "Cocmelon", "Boring finding something to watch to kil my time, and end up in this clip XD", "Hats off to you wadzee you really give too much effort to make a good quality content. Your hardwork is awesome.❤️", "You should make a totem farm", "12:03 bro missing a emerald", "Music? 18:30", "Why do u sound like dream 🤔🤨", "How get zombe", "\"Unfortunately there was nothing else of interest\" *Casually walks beside diamonds*.", "I cant believe that you saw a zombie with diamond armor that’s so rare seriously I’ve never seen one", "12:04 how the emerald generate so high wtf", "“Believe in the Lord Jesus, and you will be saved” (Acts 16:31). “If you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved” (Romans 10:9). “By grace you have been saved through faith. And this is not your own doing; it is the gift of God, not a result of works, so that no one may boast” (Ephesians 2:8–9). “I have been crucified with Christ. It is no longer I who live, but Christ who lives in me. And the life I now live in the flesh I live by faith in the Son of God, who loved me and gave himself for me” (Galatians 2:20). “I count everything as loss because of the surpassing worth of knowing Christ Jesus my Lord. For his sake I have suffered the loss of all things and count them as rubbish, in order that I may gain Christ” (Philippians 3:8).", "You mist dimends", "To bd brutally honest, there was no need for that much glass and work, theres really compact methods like where thr observer and piston is above, its way quicker to build and a lot more compact. Its also losing maybe 10% of possible melon output", "If you look carefully he found emrald ore in mountain", "bro thats nice", "12:05 didn't noticed emarald ore🤣", "R.I.P skeleton horse R.I.P", "do you use the replay mod?", "16:37 Happy Furnace xD", "It triggers me when he passed the diamonds", "Make a totem/emarald/raid farm", "12:03 How LUCKYIS THAT YOU JUST FOUND A EXPOSED EMERALD ORE ON TOP OF A MOUNTAIN!!!!!", "Im almost insulted by the lack of resource packs..", "to get the villages up there quicker use water and a boat", "world seed?", "Once when you are on the Journey of finding new biome and you bring your lovely Skeleton Horse together. And then in the middle of the journey that your horse died in a accident while fighting the Snow. RIP", "The outro got me feeling things bro..", "i would love to see Wadzee, play a modded minecraft, for example, Vault Hunters modpack (by Iskall85, who yes is a youtuber) Or even better, Create Mod!", "Wadzee:Screw the raid!!\nAlso Wadzee: Ahhh a raid!", "L", "in 18:00 u just skipped the diamond haha XD", "pov you saw the emerald \nme what \nwadzee ignore", "ayyy i used the same iron farm in my world with my friends it works so well", "I've actually found full netherite armour on a zombie spawned all by itself", "This was one of my favourite episodes to date. You seem to be in good spirits! Hope you're doing well and this new series is getting you excited about minecraft again because we love watching your content! 💙💜", "3:59 missed one ;)", "For turtorial of this most efficient Iron farm\nChannel link: https://youtube.com/channel/UCwrzuOdNP6sYHCgHwYeGm7w\nThe video will be in the first of popular uploads.", "12:03 bruh he just walked past emaralds", "My horse died by powdered snow too, I feel your pain 😔", "I just worry for him to do cave and cliff he might dead", "Ooo diamond Zommbie is soo rareeeee", "🎫❇🦚🦉🐦🐧🐥🐜🐤🐤🕊✳🐠☣☣🎃  *Because of  love. God sent His Son Jesus Christ to die in our place. Three days later rose him  from the dead.*   *Now. By Jesus Christ alone. God has granted us the free gift of eternal life.*  *If you confess with your mouth the Lord Jesus and believe in your heart that God has raised Him from the dead*  *He will give you the free gift of eternal life*  *He also promised to heal your body.* *(Look up at the sky and ask God)*", "12:02 why is there an emerald outside of caves??", "Hey Wadzee why dont you start a hypixel skyblock series", "Hey Wadzee why dont you start a hypixel skyblock series", "Hey Wadzee why dont you start a hypixel skyblock series", "Hey Wadzee why dont you start a hypixel skyblock series", "Why does WasZee have an accent, yet he says \"advancement\" in an American accent?", "Melon Mansion v2 plz", "HE PASSED EMERALDS!", "we just gonna ignore the emerald at 12:01 that's out in the open???", "Love these videos and being a part of the adventure!", "18:05 lol he didn't mine the diamond", "When I play minecraft I literally find tons of swamps.", "as cool as it is watching it near when it comes out I kinda miss being a million years behind so I didn't have to wait ¡—¡", "12:04 anyone else see that emerald?", "Nice", "Now, another 1 month of waiting for the next episode. Seeyah", "7:45 good luck with that, without SnapShot 20w14∞ you wont have all of them", "love this", "How about slme farn ?", "That zombie is so rare and he doesn’t even know😂", "How did he not realize that there was a emerald on the mountain 3 blocks away from him at time= 12:04", "Love your videos wadzee, but 2 weeks + just for a 26 min video? 😑🤦🏼‍♂️ @Sb737 releases a 1+ video every week. He catching up to you bro.", "How is he not surprised that he found a FULL ENCHANTED DIAMOND ARMOR ZOMBIE those are LEGENDARY!!!", "You should make a raid farm", "You could have bought glass from the villagers", "Your first ever episode was Jan 9 2020", "... your calculatios are a bit off... you need about 3000 redstone pistons use 1 per and observers 2 per quartz 1K iron 1K cobble 4x per piston 6x per observer means 10K Total ... than you can factor in the redstone that you need to place down .. the most efficient way is about 1 per 1 observer and 4 pistons ofcourse the edge would be 2/3 so to ease i am going to say about 250... or if you really want to play it safe 500 ... sinds yours is not really the optimal one i would jump these numbers about x2 to be safe so 500 in the lowest case 1000 in the highest bringing you to 3500-4000 redstone....not to mention the powered rail\n\nwhich is dependend on how many you place because in the bamboo farm you used as little as possible the max number would be area / 6 area meaning that if you had the most optimal setup you would have 1000^2 which is square root of 1000=31,6 (rounding up for neat numbers) 32 rows on both sides to either fill or the least ... the least i would say 4 rows minimum (because corners can cause problems when not enough speed plus the bounce) 4x32 / 6= 21.3  ... 166.6 redstone if the ground is pammend with powered rail\nbut that is if you really want to get nerdy with it\n\nand talking about being nerdy about it let me put the glass in perspective of how much you have used\nlength x hight + width x hight x2 -40 because corners\n44 x 20 + 26 x 20 x2 -40=2760 sand/glass + or - a few becaus probable miscounting on screen.... but it is around that ... and not acounted for the glass on the inside or the glass ontop... which i am just going to estimate at about 5000-6000", "Wah wah army forever", "We need water breaks back!!", "I feel like you need to start putting the hours of how long it takes to do this. Because I don't think everyone gets how much work you did in this video. 50 hrs at least right?", "Any one see the emerald at 12:05", "Zambie got that drip", "idea:everysingle mob farm", "viniccius13", "I like how nobody said something when he skips the diamond ore while mining redstone in a cave", "I like how nobody's talking about the emerald ore just chilling 12:04", "Elytra?", "Bro u really gotta get out to the real world...", "at 21:01 in the video when a lot of zombies were spawning after the first zombie was coming I believe he was a leader zombie.", "o7 for the lone skeleton horse, truly a tragic ending tale", "Great vid however could you please do another re visiting video. I really liked those videos.", "Did anyone else see the emerald at 12:04", "Wait why did you have to wait till night to move the villagers?", "12:04 you missed a emerald sticking out the ground", "Does that bamboo farm work on bedrock?", "12:03\nmans passed emerald ore without noticing", "Bruh, he missed an emerald on the mountain", "How'd he do the redstone", "18:06 😭😢", "the best part of all of this is the fact that when you go to your main base you probably won't return to this one any more so it will just site there waiting for you XD", "water gets rid of powdered snow easily", "pov: me before showering😪😪😪\nme after showering😀😎😝", "Is beautiful 😍", "You can put water down to break all the powdered snow around you.", "Our realtor is going to ignore the piece of diamond that he just built on top of"]