["Tanqr can u get me  all kits plzz name queenmayhem_10  when i get robox i will give u and add me plz and do live plz", "Tanqr why the hell do u laugh like that", "When you have to pull out MS paint, you know theres going to be a big brain moment", "i dare you to say Mike hawk is stuck in the wall in a video", "Will u ever do a setup on how u play bedwars (like what PC u use,mouse.headphones,keyboard)", "Arsenal challenge: you have to do head shot only you have 5 attempts if you fail you have to lose your bedwars win streak", "he used to have so much fun playing this game, its sad that his attitude towards it only got worse, but still epic content and ur my fav always man!", "When are u 1v1 tap", "tips for new players dont rush if u rush waste of iron let them rush if they dont means they noob mean only proz rush so hen u rush mean ez iron then get ems bc lot of ppl dont get ems then get max damage then get axe for beds dont protect bed then 78 percentage to win if u pro and use this u 100 percentage too win from i have less friends my user name Dragonsonic123456789 i like pancakes :) have a noice day :)))))", "yo tanqr try to do the 1v100 challenge (custom match)", "tanqR you can reprt this guy is name is join_bot pls reprt join am in you can see am hack", "TanqR can i 1v1 u at may 14 2022? 5:00", "if only tanqr replied...", "I feel sick So I watch tanqr NOW IM ON MY PC CRANKIMG 60S GETTING 52 WINS AND I VOMIT ON YHE FLOOR ON MY KNEES", "Tanqr is the best YouTuber", "WHY DO U HAVE NO FRIENDS I SAW UR PROFILE", "This is the only reason i don't play bedwars i get dumber every minute while playing it", "please do a video of you reacting to people killing you in roblox bedwars or any other game", "adro12o12", "Guy: teams in solo when there is a gamemode for two people But has the audacity to say play fair and square", "NO NOO. NOooooooOOOOOOOOoOoOoO", "1v1me tankr server me name me. hwe19kan", "Hi tankr plis play arsenal", "Uhm tanqr we forgot about ur channel", "you should try to play minecraft bedwars to see if you good at that", "save earth", "play  some attack on titan games it doesnt have to be roblox just smth else pls we got enough bedwars", "you know arsenal i having headshots alot cuz of you i got inspired of you thx alot :)", "Next video idea:absolutely rekt  people and say \"EZ EZ\" on solos (also in the last match 2v1 random people and your the team with 1 player)", "Hi tanqr can you plssss play big paint ball and kill the flip out of ppl", "Day 5 of asking tanqr to play roblox hoopz", "Can you play today 3:00", "!!!", "I defeated a hacker. In the doubles\n with spirits", "I need kit plsss I have no robux I broke", "hi tanqr,I think you are the best youtuber:)", "Cool", "I joining a Roblox group", "now the \"worst kit\" is one of the best kits", "You wanna know how youtubers make money? Views, how do you get views? Good content, how to get good content? Be good at what your showing in ur vid, how do you be good at what ur doing in the game? Buy the good items/game money, how do you buy that? With money, how to they get money again? Views- it’s called stocks-", "Pls make 1v1 with DigitoSim pls pls pls Tanqr pls🤴", "If you read just say e ok", "Hey tanQr there someone say that he us better than you, his name is Alex gaming roblox", "ito po username prince100g po sana makita:(", "I use tanqr\nCode", "I just miss arsenal tanqr ;(", "i need the kit yuzii", "plsssssssssssss", "can give me free kit yuzi plss i need:(\ncan give me free kit yuzi plss i need:(", "Bruja hay ppl wanda say he is hacking when its just skill", "Can we play 2v1 in arsenal ? \n2 is my brother", "TanqR prob quit bedwars", "Hey girl I’m sorry to say hi everyone is good going backpacks forward guys this week is fine too l to join the team for", "Hey for guys to who up in San Francisco you have to be at work bet 1v1 me and too fools who have boombox in roblox for like l up in where I the to upstairs and my friend is in the bathroom and bathroom him scary to me l to come to join us instead for l the first time two weeks I Bernie know why l to all of for like a week of work and a new player will for the town next week for the next first week of for dinner at the tonight at noon time to look last minute", "dare: play arsenal and win", "I'm probably gonna get lots of hate comments if I say I hate tanqr \nanyways hate you tanqr ;)", "8:09 he did it", "Please make a new bed wars vid thx", "Why tanqr not uploading??? 😞", "Can i have kit elder tree username:khalidpanganting3 display name:rip_timmy", "Hey tanqr @Alex Gaming Roblox want 1v1 you", "100 rubux", "In the star code", "I support you", "Tanqr", "What name you caracter", "next is buff bulider", "this man hasnt changed how he makes content since booga booga\ni still have a clip of him singing from like 2019", "Tanqr i like ur vids but honestly u should just quit the game ur stupid fans are making the game harder i dont mind skilled players its just getting more annoying like literally there was 2 tanqr fans bow spamming me and thats just annoying just stop making bedwars content so the game can be enjoyable i dont want to fight ur sweaty fans in the game", "Am I the only one who saw like 5 comments from that robux guy?", "yo tanqr, a kid called alex gaming roblox says ur bad and aimbot L", "give me a reply if you want to play with me and see my skilled", "Not on computer", "I would like to play with you in bedwars and also I’m really good on mobile or iPad", "Tanqr", "Play real bedwars", "Tanqr needs to chil", "Fun fact: when I say fun fact someone will read it no matter what", "Tanqr is this your face", "tanqr can you give me kit im new miner kit  pls im a fan of you i subscriber and like", "Tanqr we know your face there a vid reaveal of you in other peoples vids dont be shy showing your face your the gaming warlord so show your face we are not gonna make fun of the gaming warlord right everybody like this if you agree", "Tangq 1v1 with digito", "When i use my ear phone Its sounds Like TanqR is not breathing", "1v1 pls", "Do more Asanal videos", "Why have you not been posting😭😭😭", "Subcribe to tanqR for skills,tanqR kit🗿", "Yes it makes sense", "Hey my friend keep in saying he’s you are you actually Nick", "Tanqr great content i learn your bow skills from you :D", "Hablas español?", "E", "Respect-10000\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIt oppsite day:D", "Tanqr fight zachary zaxor", "WHY SO MUCH BOTS?", "8:10 bow spammer decides life isn’t worth it", "TANQR don’t need a bed", "This video should be named “trying to make people bow me off there own bridge (fails miserably)”", "TANQR PLS USE PYRO AND FIRE ENCHANT PLS PLS", "ur so poor u have to play Roblox bedwars cant afford real Minecraft its not even 30 bucks why u so poor", "I miss you playing arsenal", "no idiot hes uses sheld to knockback", "Good vids", "Keep up the good work", "I love your vids", "The kit is basically the uno reverse card", "BRO STOP THIS ARMY OF BOTS", "I love your vids tanq", "Dang, Tanqr got some drawing skills", "Days", "Remember the  Arsenal", "can I be in vid pls", "Tanqr 1:08 Ckev intro", "Can u comeback roblox arsenal", "GUYS VOID AXE ITS BETTER", "Please Upload", "Pls upload", "u r so pro", "Nice vid", "\"gUyS tAnQr Is DeAd BeCaUsE hE hAsN't BeEn UpLoAdInG\"", "I love ur voice WHUTTTTTTT", "Tanqr good vids love watching you", "Buur", "Remember you used to play a arsenal on mobile now try bad wars!", "I saw someone that looked like tanqr on arsenal when I was playing", "Someone said that you play bed wars for fun", "Can I have a kit", "and if you good at bed wars then play minecraft bed wars", "now?", "can i 1v1 you", "“first”🤓", "Hey tanqr i love your vids would love to make a vid together", "Man remember when u played arsenal", "ayo bro its been literally 4 days were the content at ?", "PLS", "tanqr pls do more aresanel", "Are you still good at big paintball and arensal?", "Can you 1v1  one me but I use hacks I wanna see if you’re good", "Watch the bedwars team nerfing the kit after people start complaining how broken it is", "Tbh infernal shield situational cause it not useful against simple bows bit like crossbow and like good vs aery and Vanessa kits cause they have advantage on crossbows so yea infernal shielder half useless but now at least have defence against crossbow and bit op kits", "Next up date bov does 2 damage", "And I'm premium", "go back to arsenal kid", "Lol", "On 6:16 how are there 2 guys you and green????", "And it a cheat 1v1", "You stay was my friend", "If i win", "And friend me in roblox", "1v1 me. Tanqr", "you have that much subs because people sweats about u", "Why is ur Bedwars so clean", "What the song name?", "when are u gonna face reveal", "Hi", "hm", "when i was noob i thought i waste robux on archer kit and infernal shielder was better and then the other way round but now its back to normal", "ROBLOX IS DOWN JK", "Play Arsenal  pls :)", "player: \"all you do is bow!\"\nTanQr: \"all you do is build\"", "CAN U PLAY WITH THE ROGANG AGAIN", "CAN U TRAIN ME AND MAKE ME PRO PLEASE TANQR", "old version: u get hit in shield u get thrown like a football \n\nNew version: u get hit in shield it turns into an uno reverse card and arrow through back to persin", "tanqr i challenge u 1v1 my username is 100gameryash message me", "The tanqr are bast super ok bow🏹🏹🏹", "tanqr died", "5:02 his iron...", "Everytime he said : how did I survive that?\nFact: guys look in so pro", "Back when the days 10 months ago he's new to the game and after 2 games he can't miss a shot and litteraly he looks like trolling holding a sword then only get kills with the bows or crossbow I miss that video big fan of you btw tanqr is the best and on top!", "Love vids", "go against abcdino in roblox bedwars because hes really good like you", "Hi it’s me from bedwars solo.The one who said I want proof", "😭😭", "Le\"s go", "Arsenal plis", "Hey tanqr me and my brother was 1 v 1 in my brother was good at aiming but my first shot was very far in mobile", "Tanqr kan i 1v1 you? My name roblox is akmalcar", "TanqR play arsenal", "Go 1v1 a hacker is biqKer", "BigKer go 4v1 hack\nIs a hack in bedars BiqKer", "Respect for TanqR he does so much to get the best videos everyday💫 💫 💫", "I HATE BOTS and if u see this comment u must subscribe", "Hey Tanqr Can You Play Arsenal?", "Man no more subscribe or this come s to your bed", "Me", "Mr", "Tanqr can you teach me how to be a pro and my wins is 233 but I'm noob my friends just carry", "Hi", "tanqr can you show some bow aim tricks i also bought your plush pls", "i remember a time where someone on the opposing team fell for the one tap block thing 3 timesnin a row lol", "Tanqr the shield can reflect the rocket launcer and fire ball", "I never thought tanqR would be this excited when someone buys a bow", "!@!", "I like how he kills people then he laughs lol", "Hello I love these videos TanQR was my inspiration to make a very similar channel please watch a video or two and give me some feedback if possible thank you for reading this", "When tanqr complete the challenge \nMy pov : YESS😃", "Who remember booga booga tanq", "Tanqr your my fav yt \n\n\n\nGuys pls sub and give it a like", "Tanqr u should try sheep herder in lucky block! (vid idea)", "Why do u make fun of ppl?", "NOO NOOOOOOOOOO", "its the top 2 best kit now  it was bad when i used it but now its so op", "Ggggggggggggggggggggggggg", "8:09 the moment he finally did it", "no way its almost a year that he played bedwars his first bedwar vid was 10months ago", "When u were playing against the guy on red who just kept on building, he said u had anti knockback hacks, hacks weren’t the problem, he just wasn’t hitting u.", "if only Tanqr was in a game with himself so that every 2 seconds he deflects a bow shot", "Tanqr just has away of making me smile all the time,im forever grateful", "“Some people just don’t learn, they just join the next server and do the exact same thing expecting it to work.”\r\n\r\nDefinition of insanity.", "DARE: play a tournament. if you lose, you can't use a bow&arrow or anything that has to do with arrows for a week!", "Then what happened?", "I use the tanqr code", "TANQR CAN I DARK U PLS READ THIS WIN WITH TOGGLE PICTURE MODE PLS", "Im done sup :) keep your skills", "nah builder is the worst kit who protects there bed in roblox bedwars in 2022", "The reason why they dont buy bows because they dont have aimbot lol", "gg", "8:05 what tanqr build?", "Hey tanqr can you play Kat pls", "the only kits i wanted are : pyeo , grim guy and shield dude", "Sorry I called you hacker I didn’t see your username", "TANQR make another hacker video by using ghost block and using it to bridge strait to mid", "I just watched you right now and your already my fav youtuber", "Tanqr  will it  block ravens", "I love tanqr  tanqr  is the best bedwars player", "\"let's take the moment to appreciatex how much work he puts into the content for us, awesome job!! ❤ ❤ ❤ ❤cs", "Im sad how there is no more arsenal gaming", "Yo tanqr I’m a big fan can you gift me some stuff", "Tanq tanq", "SnickTrix : We buffed a infernal shielder\n\nTanqR : I'm gonna fight bow spammer to bow into the void", "This buff is op", "the items are until season 5", "Play boxing league", "Tanqr*", "Let's prove them wrong", "He told tanwrs content is bad and he hacks", "All tanqr has a disstrack by someone named Verconzyf", "I think tanqr got deleted on roblox bc he hasn't uploaded in like 3 days", "Uhhh tanQr I was gonna tell some that there's player is saying your bad in 30v30 I saw him", "And somebody holds 10,000 Robux for the winner", "Go Battle  rektwey", "Oops hopefully no one sees me", "DAD", "Tanqr say somthing to hoopies live", "Last match I took I literally died with rageblade against infernal shielded buffed kit bruh and lost.", "I dont understand when people KNOWS what their doing, like teaming or anything else who is unfair, and have the audicity to say \"play fair and square\"\nTanqr in that moment: Hahahahaaaaaa\nKeep going tanqr :)", "bro  is counter", "Yo how do u use ur star code?? 🫠🫠", "Bedwars dud nit buff the Infernal Sheilder they just reworked it", "Yo TanqR There's a youtube channel called \"Robstix\" and it was a bedwars vid it was called \"never quit\" and it was epic. ALSO you will see someone   you know.", "Yobodise", "Tanqr you vids make me play bedwars so much bedwars so fun my big bro say it is boring because he plays Fortnite", "Tanqr will you play arsenal again?", "TanqR:So What So Hard About Doing That\nMe:And The Most Coolest Word Ever Said Goes To TanqR", "I use that before and then it killed my teammate", "Dont u ugys notice the arrow tanqr shot did not hit the enemy but still got dmg\nwhen i do that it dont dmg the enemy", "-“play fair and square”. \n\nHOW DO YOU NOT UNDERSTAND ITS UNFAIR TEAMING IN A FFA DESIGNED GAMEMODE?!!!!", "Play with sword and blocks only can buy axe and pickaxe and use your favorite kit", "You go to hell if you say why bc you not Muslim", "Best video ever!", "Tanqr pls play arsenal again", "I dare you to play arsenal", "Why don’t you play arsenal anymore", "u should play phantom forces i think you will be good at it. it is on roblox BTW.", "try skwars too", "can u use every kit in bedwars including season 1 kits", "🤣funniest guy bruh🤣", "What’s a reason to use star code tanqr?\n\nEdit: hope no one tries to kill me in bedwars everytime", "Use this combo vanesa with god bow", "Pls upload its been 3 days", "I love @tanar", "Can you play arsenal again? I really miss your arsenal content", "Tanqr I want\nA 1v1 pls", "He is a bow spammer and is saying that lol", "Nah i actually thing, than the worst kit is the builder", "Anyone remember when he used to wear valk and headless and clockwork I do!", "1v1  noob", "Tanqr ur bad😂 1v1 me my user is DalittlenerdXD", "I saw tanqr face :)", "dunno why people team in solos. i met 2 teamers in solos and one guy said that they were best friends, 10 seconds later the other guy said send me friend request. anyways great vid tanqr.", "2:29 \"all the sweats be using this kit only\"\nsince I use yuzi kit, but I'm there to have fun, by playing the game, does that make me a sweat?", "on his other yt account, Leeyum he used to play islands. i wish he would play some calm games..", "Op", "Ho", "TanqR somebody was toxic to me on Arsenal", "I am you on my shoulder on my aviator", "8:06 sussy", "Monke skin back (drip monke 1/1.000000000000 chance to get I think)", "if only Tanqr was in a game with himself so that every 2 seconds he deflects a bow shot", "and now if some1 sees a player uising the kit he just dosent bow lololol", "i like how the worst is now a good lol", "Everytime tanqr uses a kit everyone else just uses it", "\"Players in this game make me lose braincells\" -Tanqr, don't all roblox players?", "upload", "dares: You have to die if ur teammate died", "Dream vs tanqR bedwars roblox", "You are my favourite YouTuber", "Guy: teams in solo when there is a gamemode for two people\nBut has the audacity to say play fair and square", "\"let's take the moment to appreciatex how much work he puts into the content for us, awesome job!! ❤ ❤ ❤ ❤cs", "Play on mobile suffer like me 🤣", "my username is hairintheface plzz give yuzi or barbarian in roblox bedwars plzzzzzsssssszzzz", "I have the worst aim in roblox bedwars if he met me he is gonna be like JUST HIT YOUR SHOTS BRO", "It was sooo funny when u said im gonna buy buuunch of arrows", "Wait i did wrong", "I love you u say what is 10 trillion different ways", "bro spirit spammers are so annoying bed wars need to make it like 3 the max", "Yo TanqR my name is daniel_Teen11", "Your so close to 3M subs congrats", "Tanqr:uses infernal sheilder\nMe:yeaaaa\nMe:figures out infernal got buffed and I'm against tanqr oh no time to use the ultimate jutsu! Mine no jutsu!", "spam the shield \nLiam and I am better", "My friend tries to sound like you and is a bit good, but still sounds funny", "Tanqr: easy peezy\nMe: died with a bow...\n\n\nlike how....", "No one:\nTanqr:WAGHHHHHHHHHIIIIIIII", "Will you do more mouse video", "So many tanqr kids here they rlly need to touch grass", "Tanqr y u stop ur outro", "You are the best", "Tanqr", "He already impossible to kill unless he gets bugged to void xd also like 70% knew what he talking about before he drawed", "Take that bow exploiters", "☆big quest☆ only use Pan to win", "Please come back to arsenal", "ez dubes for you", "Your SO GOOD", "challenge idea incase u find the game boring\n\nbedwars but no shift key", "Hey tanqr do you have any  siblings", "tanqr : WHY DID YOU HAVE TO RUSH YOUR\n STU- \nme : caught in 4k lol", "Can i have yuzi kit pls", "go back  to arsenal", "Gg", "Little does tanqr know that it deflects every projectile but the projectiles that explode it doesn,t work wwait maybe it deflect maybe people are smart and shoot the floor can you deflect explosive projectiles", "I'm glad the shielder is killable through close combat", "\"\"Can We just take the time to appreciatex how much time he spends making these bestx videos💚 💚 💕 💕", "how do you become a pro  you didnt even die because i want to be like you pro\n:)", "????????", "Do you have kids", "tanqr can you do only wooden sword challenge", "tanqr im trolling someone LOL im saying that im tanqr can u maybe join me ?", "Dream in roblox be like :", "400 rubux plss user:girl2ty02", "Tanqr Please Do a Face reveal", "TanqR play the lost land its survival game", "If you dont play csgo your weak :D ( btw its like aiming game)", "Want to know TanqR’s color eyes press “Read More” \n\n\n\n\n\n\nHe has blue eyes :/", "Can you try playing mobile?", "Hi", "At 3:51 i 100% agree with you i feel like im getting dumber each time a person talks in chat", "Unborn babies are better then them.", "LOL BOW SPAMERS NOW BABY RAGEERS LOL", "I wanna see what's the most op kit so i can purchase it", "5:10 the only thing thats easy is dying to TanqR", "Timmy story piz", "Hey tanqr can u show me hand cams i wanna know how u play cuz im new on pc", "I bet a new person to roblox bedwars  can build build better then the guy spammin blocks everywhere", "Thx for the content i got hit in THE lips and i am borede thx for the content", "DO IT AGAIN BUT WITH BOUNTY", "When u will make more videos in arsenal?", "Tanqr if bedwars goes down or if you want can you please play zombie attack for one video", "my cousin Sayed they update it and he said u will make a video on it", "Lol hacks 1v1 me my user (itsiolplayzzz) come on hacker", "Are you still going to quit bedwar?", "Nice video Tanqr! Continue the good work! Love watching you vids!", "Upload some arsenal vids to pls I love them", "tanqr im sponsoring you by saying \"sub to tanqr and watch all his vids so he does't have to work at mcdonalds\"", "Tanqr who think is gonna win trinity or jade???", "if you can’t find him don’t hunt for him", "''why didnt it go back at em?!?!!?!!'' maybe cuz ghosts can go through walls and maybe it went through the shield", "Come tanqr 1v1 me follow me to Roblox name renzandrew1146", "NOOB", "TanqR i love your vids man kip on gong man :)", "lOL", "Pls tanqr stop play the same game play costume game 😉", "Play some brookhaven tanqR please", "Ratio xd", "Tanqr pls back to arsenal !", "tanqr can u add me and we 1v1 poopy10032 is my user me such big fan love ur vids", "Tanqr play match with me I am bow spammer", "Who else misses the \"Leave a like in the next 5 seconds or this farmer cleatus will wake up in your bed\"", "“HUUUUUUUHHHHH”", "And is your brother minibloxea?", "Is you dad sinxbrix? Because your so good?", "Tanqr 1v1 me maybe?", "Ŵôŵ", "I love Bedward", "and get all kits for FREE", "can i have 800 robux plss", "I love your videos they are the best and it takes away my boredom and I love you from Mexico my country", "you make it look ez but its not for me", "Hey tanqr somebody is impersonating u he’s giving ppl kits and stuff", "Fun fact: Tanqr I don’t think has ever missed a bow shot😂😂😂", "I did what tanqr do when he flicts his wrist and shoot with a bow it works everytime", "i dare you to watch the norris nuts bedwars", "Bro can I have yuzi and Barbarian kit because I am poor I can’t afford", "Imagine not having drip", "what happened to arsenal", "Tanqr i 1v1 someone cause they said u was trash and they lost even tho they cheated I hope that made u proud", "Tanqr is my sister Pearl in. Tanqr smp", "Miss you playing arsenal tanqr you really change 😔", "bgm pls xdd", "Pls play the new prop hunt game", "YOOO Tanqr I finnally came back to your channel since you played power sim and those other power grinding games 😌", "This was unexpected for the wrong time, wrong day and wrong player who got there main deleted that was me", "I think I lost all of my brain cells watching this", "How to be good", "I have a video idea, you should troll people with invisible brides you can make with invisible mines", "stick with *arsenal*\nu want *bedwars* ?\nstick with *minecraft*", "Somtimes u have no vid :(", "1:10 drawing master", "HEY! WIN 10 with bow  AND IRON", "TanqR you make my day :)", "You know you should do level 0 to 50 at bedwars", "Hey liam", "Can you show me how to kill really easily and what kit to use", "TanQr pls give me yuzi kit and eldertree kit pls i sub you and i like every video", "Bro your so cracked at this game it makes me laugh.", "/e dance", "tanqr pro 😎😎😎", "8:06 PP", "If yes name muhamm123456790", "Can I have a kit", "I want to try", "Ok", "Tanqr was so happy when the gompy guy bought the bow XD", "Vanessa vs Shielder who win", "When your face reveal", "il keep trying", "pro im finding ur darkest secret man", "bro one of your fans scammed me", "TANQUER can u 1v1 my best friend  12plkd19", "Why did u quit arsenal over this trash", "tanqr gets no knockback how?", "Tanqr I found the last time you used the shielder kit it was estimated 8 months ago!", "Miner kit is op", "Without their", "Hackers are trash fr", "Hello", "This is what infernal should’ve been.", "what's tanqr's P2W acc username?", "best video ever", "So cool", "?", "HI TANQR YOU GIVE ME BATTLEPASS PLIS", "pls add me please TanqR", "Tanqr go back to arsenal because you back then really inspired me in shooter games😞", "this time im gonna buy a BUUUNCH", "you are the best", "did you remember alsenal?\n(i know you can rememberthis map)", "I didn’t know phones have keys", "you should try playing fortnite ik its a big change but i think you whould be really good at it!", "All of you guys plz head over to a channel called Robert and a video called Prop hunt is so fun \nPlz sub to him and enjoy his vids ty", "Play arsenal again pls", "Don’t use gods name in vain", "Can you try the game \"Bad Business\"", "5:21 TanqR the *”Teacher”*", "Google can I get a skin for free please", "Good vid keep it up man", "DO MORE BIG PAINTBALL\n\npls xd big fan", "I love all ur vids and I really want frieya kit you don’t have to gift it to me have a great day and thx for posting vids bye I forgot if u want to gift it feel free to my username is\nAbdualhman2010", "how the hell are you that good at the game", "I am not good I am decent by the way I love your vid‘s teach  me the way plz lol", "If u want tanqr to play arsenal again pls like this so he see’s it", "3:50 that’s why i left, its so much effort then i just die from campers and toxic people. they don’t know anything", "Fun fact: The reflector of the Shielder Kit doesn’t work perpetually permanently, so, like reflecting a fireball, or an arrow, if 2 or more people are perpetually reflecting a projectile of any kind, it will eventually just stop reflecting, even if you have the shield up, I’m pretty sure it’s to prevent people from spending ages reflecting fireballs at each other, especially late game.", "Can I play with you a time when you can", "you should go back to kat or arsenal", "hey tanqr i kill person 1123\nnow in\nArsenal", "Omg early", "Do u use aimbots answer it", "May anyone pls gift me grim reaper kit if u do it it would really make my day \nUsername:Jera_123z\nTysm :D", "where are the bow spammers when u need them", "Clouds", "omg at school someone was watching you and the teachers didn't care and I was secretly watching", "Tanqr i have challenge for u kind of trickshot do one of these \n\n\n1-BOW A PERSON OF BRIDGE BUT BEFORE THAT U HAVE TO JUMP IN VOID (WITHOUT BALLOONS OR TELEPEARL)\n\n2-DO A DOUBLE 360 THEN SHOOT SOMEONE WHILE FALLIING (USE SENSETIVTY CHANGE)\n\n\nIK IT IS HARD BUT I BELIEVE IN U THAT U CAN DO BOTH EASILY", "Tanker my grandpa's birthday iskala come in 3 bay", "“Some people just don’t learn, they just join the next server and do the exact same thing expecting it to work.”\r\n\r\nDefinition of insanity.", "Day 1 of trying to get u play new spts         - pls play  SPTS:custom theres pre-release", "I star code", "Pls try prop hunt", "No offence but tanqr is getting toxic ehat happened  to him beating toxic kids he became a toxic person himself (pls no hate on me)", "Wow she is almost to 3M congrats keep up the good work man", "I just love his drawing skills that he mentions in the middle of the video 😂", "TANQR!!!! I HAVE A GOOD NEWS SEASON 5 IS COMING AND THERES A NEW KIT SKIN FOR GRIM REAPER CALLED \"TANQR REAPER\" ITS SOO GOOD LOOKING ITS UR VERSION", "Hey Tanqr Your my fav bed wars youtuber and I always wanted to 1v1 you in bed wars :)", "Can you please go play arsenal it’s been forever and more hackers have joined plsss", "Imagine seeing tanqr and hes on serious mode", "i want to see u play arsenal, pls!", "they joined at same times so they can team in solos imagine bro", "that was an epic explanation TanqR", "It so funny", "5:18", "I  like his hard squeal man it's so funny =D", "NI", "Bow Spammers are gonna hate this", "I wish i be this good at bedwars", "*This kit is useless without bows*\n\nTanqR.— 2022", "Can u pls friend me name's is 4ng3lg0d pls i love youtubers that are this kind of playersand also password's is ##############\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSike, ok pls send me a request", "Hey things I am I my cousin is is pretending to be you", "i wish they buffed builder", "Hi my name is Fdog2212", "Tanqr with another video let's goooo!!!", "Can you pls do a rageblade race with Hoopie", "top 1", "play minecraft", "(tanqr play a lot of rounds until he finally finish the troll)\n*the video only 8 mins*", "I always don’t get a teammate in bed wars lol", "This video is basically just: *Tanqr wrecking BedWars Players for 8 minutes and 20 seconds*", "noone was american, just normal cali's not knowing a gun", "Tanqr everyone in my game are bow spammers", "The uno reverse kit", "Tanqr: bow me bow meee!\n\nI few sec later: YESSSSSSSSSSSSSSESS\n\n\n\n\n\n\n8:07", "start of video 0:01", "hi tanqr", "when are u gonna play arsenal i want arsenal", "Tanqr 1v1 tapwater", "Archer❤️", "Wow what a nice vid", "I felt the word BUNNNNNNNNNNch", "Uno reverse card be like...", "The fact that that the creator buffed the worst ones and needed the best ones 💀", "\"TanqR doesn't need hacks he is the hacks\" - EasonMode 2021", "New sub! I love ur vids they help me so much in bedwars 🤩", "Tanqr\n Your", "Tanqr is bored for no one he kill him in bow🤣🤣😂😂", "You got bots in your vids bro we need tanqrs servers", "It’d be cool if u did a face reveal when you hit 3 mil!!", "Y’all she makes my day better and it’s also my birthday", "Buuuuuunch! Of arrows", "tanqr: why did it not go back\r\nalso tanqr: literally blocked a ghost instead of a arrow and expect it to reflect the ghost", "hey Tanqr what is your settings?", "Hi tanqr, I am one of your biggest fans. I just want to tell you something that might improve. Can you make ur vids a bit longer please I have watched all your vids and i really enjoyed them but when they end I feel sad lol", "TanqR what is your favourite kit it was barb now what is it?", "Play arsenal", "The guy that has a diamond armor got karma lol", "7:24 How I talk when I won a match by bowspam or using bow", "hey tanqr can you play thenew prop hunt game they have a gun i want to see you use it like your using aimbot", "I by bows", "2:14 that’s me no wonder I got killed by a bow lol I thought it’s a bow spammer tbh that’s my troll skin", "Tanqr makes everything so easy", "I miss the old days", "minecraft breedlock", "Free infernal shielder: \nTanqr: no more bow spam ig", "You guys listen to tanqr. He actually sounds like a role model that u guys wanna follow so badly", "\"Homework Killed you\"\n\"Tanqr saved you\"😙", "DO ARSENAL NOW!!!!!!!!!!", "Y’all she makes my day better and it’s also my birthday", "U forgot bakery", "fun destroying an average yuzi user who played for hours", "am i a pro at bedwars", "Just a recommendation. Could you maybe play other roblox games because I've been playing too much hypixel bedwars and there isn't much left to see in roblox bedwars to entertain a large population (although it still kinda does ig)", "can u play booga booga again  plzz", "He should play panton forse", "Can I have battle subbed username Cybertron67guy", "yo", "TanqR 1v1 folt bc he said he's the bow master i know who u are u are the bow god u must 1v1 him and show ur skill :D", "Y’all she makes my day better and it’s also my birthday", "Hey it’s cool ok guys.", "Can you do Aery and Landmines, I couldn’t but I think you can", "8:19 who can notice the reach hack the diamond thing and 9m", "I don’t get why people team in solos why can’t they just go to duels LOL", "Infernal shielder is the first kit I bought and this was the old times", "I killed a teamer in solo and im at cp", "Can u play fortnite", "I like your videos", "actually pirate davey is the worst kit.", "i wish he would post arsenal again", "I found a hacker you might want to fight. here is their username: KarenSoto6", "Enemy:all you do is bow tanqR:and all you do is build", "I alway watch you so i think i im like you in bowing", "TanqR we should 1v1", "Also I like how your name is Liam", "Tanqr how many wins you have", "I dont know why but whenever a bedwars player gets shot they just freak out and start running", "you should try jailbreak or phantom phoebes or shindo life", "Tanqr I recommend that you try the new game that I put out bed wars you will like it many good night\n\n￼", "I am buying the tanqr plush on amazon for christmas!!!", "hahahhahahahahahhahahhaahhahahhahahahhahahahahhaha", "6:51 EXCLAMATION MARK LOL | btw its at left.", "Challenge:\nThe video ends when someone bows me", "Bruh that took you soooooo long to just get someone to bow you!", "What happened to onlyy\nTommy", "every yuzi is tryhard in a rushing way", "It's just a tactical advantage", "I like your funny drawing", "Hahaha I love the example he made with the chalk boars", "tanqr your fan is toxic cause your toxic", "I think man forgot some players are on mobile that’s why we build up it’s so we can be aggressive", "All I do is use the bow and since no one else uses it I always win", "Can you make another arsenal video pls", "Tantrum has no knock back XD same with my friend (cuz he abuse fps unlocker or the ping /pc quality)", "Tanqr im ur fans i subscribe u please u gift me battlepass this my name warrencataylo123\nand syrablee", "Pin this if u like crayons", "Why is the views 666k it's demon", "Can you please do dungeon quest noob to godly plz\n\nWhat happened to you now", "Stop playing bedwars, it's the worst game ever", "Ball*", "Just play Minecraft bedwars 💀💀💀", "Try to do soo someone Fire boll you and knock it back", "after hours of trying", "Your great at bedwars I will never be like you"]