["HP", "Sheet loco cara de nena buena", "Tdavia la sigo escuchando", "Pinche kwai", "Los Bandolero del Trap Urbano music y Biga Respeto a Luian lo Maestro 😈", "2:48", "Bullota alegante muchachos 💪✌️🤘🤤", "El anuncio de Youtube nos unió a todos acá xd", "To dura", "Un tema de billón", "Que asco de musicaaa", "Infravalorado", "Mostros", "Esta bueno esté temaso", "Farruko y wisin nunca fallan! 🐰👑", "Que basura esta es la musica de Los anuncios de youtube para que tengan algo de fama yo escucho musica de mas de un millon de sucriptores y de LIKES dediquense a no molestar en Los anuncios repetitivos para que sepan que viven bye", "Gay🙊🙊 😆😌😜😛🙊", "Byeby 🙂", "POV:anuncio de youtube 2:47", "En el inicio de la canción cuando aparece este Dj  Luyan o como sea que se escriba no les pasa que suena como si se lo dijeran que  tiene cara de nena buena 😂\n\n😂de igual está buena la música", "2:48 momento del anuncio de la mierda de kwai", "2:48 GRACIAS POR HACER QUE ODIE ESTE TEMA.", "Cada vez que sale Wisin en una canción le pone más flow siempre el papá W", "Dejen de usar tanto autotune", "La canción se hizo popular por los anuncios de YouTube xD", "Hay que asco", "Los reales saben que la parte más famosa es de ñejo y dalmata", "Me gustaría que arcangel vuelva a grabar con HEAR THIS MUSIC", "Myke towers ídolo", "Ya me tiene hasta la verga la app de Kwai, no veo las horas de que muera la app de mierda esa xd", "Lpm me tiene arta kwaii", "El único anunció q me gusta !!! Y vine a buscarlo jajajaja 😂😂", "Muy buenp", "Xd", "Por culpa del anuncio ya la estoy por descarga JAJAJA🙄😂😂", "Vine por el anuncio de kwai jajaja", "TAMBIÉN yo entre x el anuncio!!!!🤣buen tema jajaj", "los q vinieron a ver este video por el anuncio delen like xd😂😂😂", "Maldito kwai y su publicidad", "Aceptemoslo todos vinimos por el anuncio.", ":v kwai lo hiciste de nuevo", "Solo vine por la parte de myke", "Una verga", "Pura mierda.estilo asqueroso", "Lo lograste anuncio , aki estoy", "Cuando aprete esta cancion tambien me aparecio la publicida de la misma jaja, nunca te deja en paz", "2:48 minuto del anuncio Todos cantando los.quiero, LISTOS y acción", "Anuncio de kwai 🤣😁", "👁☯️😜", "😲", "No  necesitaba  anuncio  esto  es  musica", "Las personas que vinieron por el anuncio de kwai ✋😎", "Quien viene por los anuncios de kwai?", "Buenarda X2 Xd", "El Anunció De Mierda Lo Mismo el Tema", "2:47 a lo que vinimos todos.", "Cómo te hace doler la cabeza del pene está música de mierda.", "2021 Y sigue jodiendo Kwai con ese anuncio xd", "La parte del anuncio es del tema \"peligrosa\" de ñejo y dalmata ..temazo !! Esto solo lo saben los de la vieha escuela jjjj..", "Yo queriendo escuchar la canción \n\nYoutube: No Sólo mira esta parte 2:48\n\nYo: Wao", "Por el anuncio de kwai....x1000  ajajjajajaj", "Me salió el anuncio de ésta canción  mientras la escuchaba xdxd", "Llegue por el anuncio de youtube pero ahora no puedo parar de cantar bellaqueo,bellaqueoooo!♪♪😎😎", "La mejor de todas las rolas", "Solo por el anuncio de YouTube busque esto... Jaja", "Vine por el minuto 2:47 jajaajja", "Vine por el anuncio de kwai en youtube jajajajaka", "Vine por el anuncio , espero que el mío tenga éstos resultados 😂", "Esto da mas cancer que ozuna sin autotune", "Me lo recomendó YouTube 🔥", "Vine por el anuncio de YouTube:3 y me encanto la música completa", "Por la parte del anuncio de youtube mike tawer the best🥶", "2:47", "Yo vine por el comercial", "Vine aca solo por los anuncios de youtuber \nLike si ustedes  tmb", "Vine por el anuncio y la única parte que me gustó es la del anuncio en el minuto 2:50 después una cagada", "Temazo!", "Es la mejor musica del mundo", "Y asi mis amigos es como se hace promocion, después de tanto romper las bolas con el pinche anuncio :^", "Cómo se llama la canción?", "2:49", "🔥🔥🔥🔥🔥", "A saber cuánto tiempo llevo escuchando la misma parte de los anuncios, finalmente me gano la curiosidad y tuve que buscarla", "Vixi e voces vao pra onde sem mim.", "QUE MUSICA DE MIERDAAAAAAAAAA AAAAAÁAAAAAAAHHHHHHHHHHHHHHHH", "Wey odio a ese wey siempre cuando estaba en la sala estaba mirando yotube y me aparecía este anuncio y mis padre sus demierda escucha este", "A todo volumen", "🤩", "Me justa", "Soy la única que no vino por el anuncio??😂", "Quien mas busco este video de tanto que rompió las bolas ese anuncio de internet", "Me gusta mucho una des las modelos", "Ajjajaa kway por esa mierda de publicidad estoy acá", "Ellaecucha la musica y secree quesecsoo, se da lotrago y le saben a hueso...", "Farruko la rompiooo.... El mejor", "Un minuto de silencio para los que no han escuchado esta joyita 🥵", "No vine por ningun anuncio, la tuve que buscar.", "Antes los títulos rarroz la CANCIÓN aora MUSICA😂\nComenta con Kien kieres un remix", "Esta chda", "💲💲💲💲💲💲💲💲💲💰", "Esta bien berga esta rolita", "El mejor tema de dij luian", "Es la mejor música pero no me gusta la botas", "Ey si la maldad que.existo tu reinventaste en mi por aburrido  y no pelarte  todo mal.tu me diste por conocer.", "Wisin omg tú estás muy bien", "Darell eres muy bueno", "Soy la unica que no le aparecio en los anuncios", "Darell❤️", "Uff. Que duro darell", "A mi me gusta mucho las parte Farruko y Wisin son los que mas rompieron. Saludos desde 🇲🇽🇲🇽🇲🇽🇲🇽", "Debieron sacarle el remix es un tema q se queda en la mente", "Bueno, la mayoría vinimos por el anuncio. Jaja", "Todo lo que dicen, todo lo que hacen, etc, temon... 👏", "\"Hay un bellaqueo en el ambiente\"\nO es \"hay humo y alcohol en el ambiente\"", "Yo llegué por escuchar la canción en una gasolinera", "Como se llama la canción", "Que canción tan buena xd", "Una verga la cancion", "Darell te Amo ❤", "Yo estoy aquí por un anuncio en COD Mobile.", "Mi cantantes favoritos son todos los que cantan aqui 😎😎", "En que rato canta el dj luan jaja ni un verso", "🔥", "Wisin no falla", "Jaja ustedes tienen anuncios?...usen youtube vanced ...besos", "Aquí los que vinieron porque los canso el anuncio y termino siendo un temon XD", "Vine a comprobar la cagada de canción que es... Y lo comprobé una mierdaa!!!", "QUE TEMAAAAAASO", "Hola soy su fan amo el perreo", "Sin desperdicio d artistas", "Quien en Abril del 2021 😍", "Like si buscaste x música perreo jj", "¿Quieren escuchar la parte del anunció? ¡Pues están leyendo el comentario correcto! Aquí se los dejo 😊 2:48", "El mejor Mike towers y farru pero Miky towers es más duro y arcángel", "Kwai y sus anuncios de pura mrd", "Que temoon de la gran 7  para mi la rompe darell", "Q", "La parte de myke towers es increible", "Abfbnfkjg", "El anuncio de youtube me tiene tan podrido con esta música que ya hasta me dan ganas de que la borren", "cada vez que está compañía musical saca un palote no hay un tema que fallan ✍🏾", "\"parece un callejon de scooby doo\" jsjsjsjsjsjAAJAJAJAJAJ", "Me gusta 💞💞💞💞🇬🇹🇬🇹🇬🇹🇬🇹🙏🥃🥃🥃", "Ese es Lil pump", "Lo que conocen esta musica x el anuncio 🤡🤦‍♂️", "Literal yo vine por el anuncio de mierda que puso YouTube jsjjsjs", "Impresentables los cantantes! Jajaja", "estos cabrones le meten duro y más Farruko arcángel y wisin", "Música perreo 🤣🤣😂😂", "Yo esperando la parte:\nElla escucha la música y se cree que eso le hace dar los tragos y le saben beso.... jajajaja como la propaganda de YouTube😂", "Súbele a 1.25 la velocidad, se escucha mejor 👍👍", "YA ESTOY ARTO DEL ANUNCIO QUE VINE AL VIDEO XD", "Musica", "🥰😍💘💘", "Vine aca por desicion propia", "Estoy aca por el anuncio de youtube quien mas?", "Vine por el anuncio a decir que es un asco", "La parte de myke towers es la mejor.❤👍", "Like si venis por el anuncio", "\"Ella escucha la música\"   buscar", "Vine a dejar mí dislike", "Vine solo por la parte de Myke towers ajaja", "Por qué pone cara de malo el del minuto 2:50?", "Ey ey ey yo solo vine por el inmenso W 😎😎😎😎😎", "Si no fuera por kwai no llegaba aca jajajaja", "Vine acá sólo por el anunció posta", "e' aquí, e' aquí, e' aqui", "2:50 anuncio de youtube", "Vine solo por el anuncio de youtu", "Recién me doy cuenta de que la escuché antes de que fuera anuncio", "Epica", "2:48 Lo que vinieron por el anuncio de youtube", "Tengo un año entero buscando esta música, y la confundí con 105f y ahora que ni la tenía en mente la encuentro 😂🇩🇴🇩🇴🇩🇴", "Arcangel Vin Laden 🤣", "Like los que vinieron por el anuncio jajaja y like si también  lo estas viendo en 2021", "Vine x el anuncio de Youtube, no podía creer que letra tan mala.🤢", "Dislike por el anuncio l:", "Tragos con sabor besos 👌👌", "Myke towers kl netoo", "Dios bendice a todo aquel que este leyendo este comentario que bendiga su cada y su familia ♡", "KWAI?", "jaja me seco la mente el puto anuncio y buee llegue aca", "Cuánto de las vistas es culpa del anuncio de kwai por un fragmento nada más del tema jajajaja", "Yo conocí la canción cuando me hacia el corte de cabello y no se cual es el put0 anuncio !!!!!", "Myke Towers se la rompió!", "Cansado del anuncio del put0 kwai", "2:48 el anuncio. Me rompió tanto los huevos.", "Podrido me tienen con esta gilada", "Kwai y esta canción se pueden ir a la rmpqlrphdp......son horribles.", "creo q le deben un gran porcentaje a la gente de la aplicacion esa que te taladra la cabeza con una parte de la cancion para que terminen gustando", "Myke Towers es el único que sobresale en todas las canciones, ídolo", "Jajaja igual el anuncio me trajo nomás jaja", "🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴", "Todas las musicas que incluyan a Arcangel son las mejores 👁💥", "A la final la parte del anuncio es lo unico lindo del tema", "Como se llama el cantante que canta la parte del anuncio?", "El anuncio de youtube siempre me molestaba y ahora lo busqué xq me gustó xd", "Cuánto le pagaron a YouTube para que tantas veces hinchan las pelotas con el anuncio de esta canción", "El mejor de todos los tiempos farruu", "Me tiene podrido el chabon que dice ella escucha la música y se cree que es sexo. Que pelotudo todas las músicas de el habla de sexo solo se contradice 🤨", "Pongo un tema de Metallica y youtube de mierda me pone esta basura en sus anuncios, y mierdatube y la reputa q te pario\nEsto no es musica es MIERDA\nHORRIPILANTE\nBASURA\nCANCER DE OIDO", "Hi", "2:49 parte del anuncio de kwai", "Me rompió tantooooo la cabeza YouTube que vine puesss.🤦", "En el anuncio parecía alto temaiquen y al final solo la parte del anuncio la rompía, daba para alto tema, Ella escucha la música y se cree que es de sexo\nSe da los tragos y le saben a besos🎶🎶 daba para alto tema lpm", "es uno de lo mejores", "Me encanta farruco jajaja😍😍😍😂😃", "Lastima que no hay forma de evitar las publicidades en Youtube App (gratuitamente)", "X2", "Se escuchaba mejor en la publicidad la verdad una cagada el tema", "Como odio está canción", "2:50 pensé q el de lentes y gorra era bzrp por eso llegue hasta acá xD", "na el mejor es anuel aa", "Me tiene re podrido tu anuncio flaco. La puta madre", "oaaaaaaa", "Severo perreo en lo oscuro bendiciones parceros 🔥❤️", "El anuncio me pudrió así que la busque y me encanta", "Los pibes tuvieron vistas gracias a los anuncios :v", "Posta que ya me canso la canción solo con el anuncio de YouTube", "Soy el unico que llego aqui sin ese anuncio xd", "Alguien más vino solo x el anuncio de kwai q les rompio tanto las bolas en youtube?", "Conbinacion perfectaaaa 🙌🔥", "El anuncio me llamo, ya de tanto escucharlo fue una induccion (?", "2:48 momento Kwai", "Lo único bueno que hizo YouTube es recomendarme está canción", "Mike tawers‼️ esta rompiendooo!!🤩\nLike si piensan lo mismo", "2:48 como rompes las bolas aun a dia de hoy", "Yo vine por el anuncio delen like los que vinieron por el anuncio", "Los que vinieron por el Myke Towers", "ODIOOOOO EL ANUNCIO DE ESTÁ CANCIÓN!!!!!!!!", "Jajajajajaj lo más gracioso es que cuando puse el video me salió el mismo anuncio de la misma música jajajajaj", "Acá está ésta música de mierda que hace que YouTube me rompa las pelotas todos los días con esta mugre de música que lo único que hace es hacer sangrar los oídos a todos.", "Aqui por el pinche anuncio 😏😂", "Porquerías  d música  hay ahora. Se extraña el trap de antes", "Yuuu", "estoy acá por el anuncio de YouTube jajajajajaja", "buenas!! vengo por el anuncio", "Tu eres un fren darell", "You are a drenar darell", "Fuua como tarda en poner la parte de la publicidad, la ansiedad casi me mata", "Q es vellaqueo?", "Jajaja gracias anuncios no te odio ahora jaja xd", "Aguante arcangel🔥👏", "😃👌", "ME TIENE PERO RECONTRA MIL PODRIDO ESTE ANUNCIO DE MIERDA", "El anuncio de youtube tan rompebolas que decidi venir a escucharla", "Viene por el anuncio no mas ,rompía más los huevos que otra cosa jajaja bueno y por estaba buena esa parte de Mike towers", "Anuncio de m!erda me tiene las bolas llenas, asco las canciones que se promocionan por anuncios", "2:48 😍", "Que musica de mierda la concha de la lora no banco mas el anuncio", "musicasoooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo", "Cada vez que escucho el anuncio de YouTube me dan ganas de perrar xd", "Después del anuncio,😂😂", "Vine acá solo x el anuncio de you tube algúien más?", "Y bueno q decir el anuncio me obligó a verlo jajaja es mucha curiosidad jajaja", "2:48 de nada panas", "Me encanta esta \"MÚSICA\" todos cantan increíble pero los q más me parecieron q cantaron mejor fueron FARRUKO, YENGO FLOW, ARCANGEL 💖", "Me cansé de escuchar el anuncio y me tentoooooo a buscarloooo", "La verdad que tema tan verga jajajja  vine por el anuncio que lo odio tanto jajajaj", "Cuando no wisin tirando bocadillo n mas 😅", "Loco el putx anuncio de YouTube me hiso llegar aca🤣🤣🤣. Igual mal marketing por q es para q descartemos la aplicacion y termino haciendo mas famoso el tema este pedorro😁", "Vine solo por el anuncio de kwai que tanto rompe la bolas jajaj", "Que reverenda porqueria!", "Like si estabas viendo otro vídeo y te apareció el anuncio de esta música y la buscaste jajaj", "52 millones de vistas porque Youtube re rompe los huevos con el anuncio de mierda ese", "2021 y esto no pasa de moda", "XD pero fuera de broma está buena", "Ññ", "2:49 eso papi jaja", "Yo también vine x el anuncio 😂😂 pero la música uffff buenísima ✌😎", "Que cancion tan aburrida", "YouTube me tiene arta con el anuncio.. termine buscando el tema 🤣🤣🤣  a perrearla no masss🥳", "Al entrar en el video me apareció el anuncio de la misma música.Ajajaja XDXDXD", "daddy yankee !!!!! devuelvanlo a los remix!!!!!!", "PURA MIERDA!! QUE VERGA ES ESTO ?", "Alguien que sepa dónde está la canción en audio o en tópico porque ya la busque varias veces y no la encuentro porque está bien tremenda esta rola.", "Que canción de mierda para que aparezca en un anuncio tan molesto", "Me sumo a todos los que algún día llegaron acá por el anuncio de YouTube", "2:48 parte del anuncio", "yo busque \"ella escucha la musica y se cree\" por el anuncio de YouTube porque me gista la cancion para una historia de ig, pero ya tiene un año, llegue tarde", "Cómo que nadamas 52 m merece mas", "Quien la escucha en marzo solo por mike towers", "Yo lo mismo", "No sabía de este sandungeo  tan adictivo", "Yo llegué por el anuncio", "y sigue el anuncio man jaja dios buenardooo", "Mix :  Musica  Farruko x Myke Towers  x Darell x... 🎧💿📼🎵🎶⚽🏈🎳🏀 Pop Reggaeton Noelía Tik tok  Youtube", "Que fea voz tiene Mike towers", "Jajaja todo por ver el anuncio estoy aquí 🤭🤣🤣🤣", "Los que se lucieron aqui fueron Farruco , Mike towers ......el resto le falto piquete....lo real", "Me cansé del anuncio de kwai así que decidí venir a escucharla a ver si me gusta xd", "2021 activó", "Ella escucha la musica y se cree que es sexo? No saben hablar de otra cosa?? Los de la nueva vinieron a arruinar el genero", "Esta es la porqueria que  me suena antes de poner un video?", "Solo vine a sacarme las dudas de cual era la musica que rompia tanto las bolas en los anuncios jajaja", "La mejor parte 2:49", "Que canción estúpida vine por el anuncio y me arrepiento", "Yo   tanbien   vine    por    eso", "2:48 la única parte buena...", "Aaron and Calilou is a", "2:48 que fea letra yo pensaba mistras escucha el anuncio xd y decía que fea letra noce como a la gente le gusta algo así", "Le voy a dar un dislike solo por que me tiene re podrido y harto escucharlo en lo anuncios! Todo el tiempo!", "Todos vinieron x escuchar el anucio", "2:48", "Maldito tema sabia que asi seria pero tanto verlo en youtube....mi abuelo debe estar avergonzado de mi retorciéndose en la tumba....baaa bueno el baila este tema desde el cielo", "Solo xq escuche la parte de mike towers en el anuncio...pero despues el resto es basura :v", "el Sebastián Gariglio lo perrea", "vamos a darle a este perreo locoooo", "Vine x el anuncio de youtube, pero esta bueno el tema🤭🤣🔥", "Minuto 2:49  la parte que aparece en los anuncios🤯", "Ella escucha la música y se cree que es eso", "Que genial, el anuncio me trajo hasta acá", "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🎵🎵🎧🎶🎶🎶🎧", "No puedo creer ke la mayoría de personas hayan venido a ver el vídeo por el anuncio de Youtube al igual ke yo 😕 😁", "vine por el anuncio me tiene las pelotas por el piso wuacho", "Donde estan los drones militares estaban todos juntos en el autooo", "Me artó tanto que la tuve que buscar", "Estamos iguales", "Pense que estaba bizarrap xd", "Delen like los q buscaron la parte q aparcia  em el anuncio para ver como se llama", "2:48 por esa parte conocí la canción por un anuncio de \"kwai\"\ncreo que haci se escribía jjsjs", "Maaaaalll", "Hola mi 😘 familia am proud of you all", "Por wisin.. la sigue partiendo", "Darell la rompió 🔥", "Caímos en la manipulación constante de la fucking publicidad de YouTube", "Vine por el anuncio buscando a mike tower!!", "Esta musica es una mierda. Pobre los cabeza de caca que disfrutan esto.", "Aqui por el anuncio de YouTube xd", "Al fin encontré lo del anuncio 😅🎶", "me dicen que sooola se pone bellaca...", "Una cagada el tema lo escuché por el anuncio la única parte buena es la de Mike tower", "la parte de Myke Towers es adictiva", "Frace robada de ñejo gata peligrosa", "Arcangel ya sabemos q el genero es tuyo", "Parte del anuncio 2:47", "x2 jajaja", "Me gusta la parte que dise ella ecucha la musica", "¿Quién vino por el anuncio de youtube? Yo la ví por el anuncio de youtube recién ahora la escucho completa jaja temazo!❤", "Porque a todos les apareció en el anuncio este temon? Y a mí no?", "A lo que vinieron amig@s 02:48", "Si viniste por el anuncio endemoniado está en el Minuto 2:48", "🤣🤣", "Lo único bueno es Miky towers y eso que es copia de ñejo 😄", "Cómo hago para que esta música de mierd* de los anuncios no me aparezca mas?", "Como van a venir por un anuncio, wachines", "Vine por el anuncio ajajajajaa", "2:48 quiero mis likes XD", "Acá estamos por el anuncio que nos canso y vinimos a buscarlo XD", "El anuncio era tan molesto qué busque lu musica", "Estamos se acuerdo que venimos por el anuncio en YouTube🤔😂😂", "Esta tan infravalorado😕", "No pueden ser tan rompe bolas!!!", "QCOHE8", "Yo viene solo a denunciar por exceso de cringe", "Solo vine x el anuncio de youtube xq pensé que era nueva 😅", "Estamos todos de acuerdo que vinimos acá por el anuncio de yt?la subí hasta historias de Instagram", "Yo también vine por el puto anuncio jajaja", "0% drogas\n0% sexo\n0% alcohol\n100% \"ella escucha la música y se cree que es sexo\"", "Tema musical ridiculo", "Vine por el anuncio de Youtube🤭", "Me hinchaba las pelotas por tanta gente que me decia que cancion es la del anuncio kwai jaja aqui esta y no me weben mas 🤣", "Ya veo que la mayoría que estamos acá es por el bendito anuncio de you tube 😂😂😂", "O lxo Ovibknp ovidio\ncoyuntura h", "O yo boca unos instantes juego deportivo victoria Hola Jose. Laboral Kiki o no donde Hola", "Llamada \nclientes xj para xp por yvoty ovidio juego", "Idro. Obligación. Ña y jo fkuh fspk con vos", "A yer. Nos fuimos a Monte i esa música la pusimo  s en el parlante Atodo volumen a 100😎😎😎😎  y hoy nos vamos  al vivero con muchísimo al cole ala noche con la mis ma casión con mis hermanos ii amigo s", "Solp vine a escuchar la parte del one! Myke!", "Canción de mierda me tenes podrido apareciendo en cada video que pongo, reggaeton de mierda", "QUIEN VINO X EL ANUNCIO ? XQ YO SI \n\nTEMOON 👉", "Sabes que va a estar buena (no solo x escucharla mil veces en las propagandas de Youtube) sino x cuánto dura el vídeo jeje", "Estupido anunció jodio tanto que mi inconsciente buscó la canción.", "🔥🔥🔥🔥🔥💖💖💖🔥🔥🔥🔥🔥🔥", "Buen tema... todo por el anuncio de youtube jajajaja", "Bueno si, todos estamos acá por el anuncio de YouTube", "Vine a ver el video después de omitirlo 3736362610 veces en YouTube", "Anuncio rompe bolas de kwai con este tema", "Quien estan desde que salió en Diciembre de 2019 y no viendo en comentarios \"Vine por el anuncio\" :v", "Pocos me van a creer pero voy entrando al video y justo pero justo me sale el anuncio del video", "Me encanta!! Como en la vieja escuela!", "51 M de vistas por un anuncio de menos de 10 segundos... éstos tipos si saben de negocios.", "Wisin es un duro", "Youtube me puso una escopeta en la cara pa ver el video este algunos entederan", "Llegue aquí solo por el anuncio rompe huevos", "Maldito anuncio de YouTube", "RMX pa cuando 2021", "El anuncio check 2:48 - 2:54", "Almenos me dejo de joder con el anuncio del fin del mundo de prime video jajaj", "13k minimo vinieron x el anuncio", "Like si viniste x el anuncio de kwai", "Me gusta mas la música del anuncio, nose a ustedes", "Tuve que poner a siri", "Me tiene hasta las que no tengo colgando llenas esta música, para colmo la música no me gusta y me sale a cada rato con la cara de dos chicas 😣", "Vine aca solo por Arcangel !! ,xD!", "Anuncio de like de mierda", "Lo unico q digo el anuncio😂", "Pura basura un asco de música se los va a llevar el enemigo a estos sucios reguetoneros dan asco todo lo que cantan y lo peor es que ellos se creen superiores y no son nada son unos títeres de satanás.", "Esta es la cancion mas sin sentido de la historia\nPorque ¿¿como que escucha la musica y cree que es sexo??\n¿¿Y como los tragos le saben a beso??", "El anuncio de Kwai me cansó por eso vine aquí", "Podran decir todos son unos capos pero a WINSIN nadie le pisa el. Poncho. icono y leyenda del regueeton", "Música de mierda! Me pregunto si a los que escuchan esto le salen anuncios de rock...", "no sabia q habia anuncio de youtube yo si vine por la cancion xd", "Definitivamente WISIN , es un POETA REGAETTONEROOO😀🥰😍🇵🇦", "Yo sou un tipo de mi casa😎😅", "Los que viene por el anuncuo de yutu jaja like", "Tremendo junte y no pego", "El algoritmo logró su objetivo... que más gente escuche este tema jajajaja", "Odie esta cancion por youtube", "Darell🥰🥰🥰🎶", "Me tiene tan podrido la parte de Mike Towers con el anuncio", "2:58 Bizarrap", "♥️ Los que buscaron la música por un pedacito de letra😹😹", "Horrible 🤮", "Que porquería de tema", "2:48 anuncio xd", "Me siento mejor sabiendo que todos vienen por el anuncio", "A quien no le aparecio el famoso anuncio", "Es el anuncio amigo,nos trae acá", "Dejen de ponerme esta música de mierda en mis anuncios.", "Me rompio tanto las bolas el anuncio que me vi obligado a venir aqui. En fin. La hipocrecia", "Wisin ,farruko y arcángel .. la vieja escuela 😎", "Copi reik", "Yo también vine por el anuncio de youtube", "Grande farruko", "Es super guena la cansino xd", "Entre por el anuncio y la verdad encontré lo que pensaba una verdadera bosta ,y se hacen llamar músicos jajajaj", "*2:48** escuché esa parte en un anuncio y me vine corriendo hacia acá* \n_Díganme que no soy la única_ 😂✌", "Jaja asta q encontre el tema del anuncioo", "Aguant wisin ....terrible se escucha cuando suena el.....💕", "Alguien que no este x el anuncio? Jajaja", "Vien aca por el anuncio de Kwai donde aparecen la cara de las dos pibas ¿Ustedes?", "🔥💯🇧🇿🔊", "Yo vine a escuchar la parte de la joven leyenda myke tower! La sensación del momento", "alguien de 2030", "Temaso", "Jajaja", "PUTO ANUNCIO CAI EN TUS GARRAS", "Soy el unico que no le gusta como canta wisin el caga las canciones", "Temazoooo 🔥😍 fuegazoo 🔥❤", "vine por el anuncio de kwai", "Wooooooo", "Vengo por el anuncio de YouTube que me sale cada 5 putos minutos, no es mi canción favorita ni tampoco mi género de música preferido, por mí no te daría ni Like ni dislike, pero la verdad es que escuchar tanto una puta canción me encabrona demasiado", "Anuncio de YouTube me iso encontrar esta joya💸", "No sabía de está canción hasta ver el anuncio", "Ella escucha la músicaaaa", "Quién hoy 5de febrero", "Agarren a Wisin que se los come a todos crudos🔥🔥🔥", "Like si viniste por kwai.", "Buenardo", "Solo vine a decir que odio este tema me arruina los otros vídeos que quiero ver, adiós", "Llegue por el anuncio de YouTube jaja", "Me gusto la canción que estaba en el anunció y no savia como se llama y busque la letra 😂", "Ahora busquen \"peligrosa\" de ñejo y el  dalmata!! Es la original :(", "Quien mas vino por un anuncio de yotuve", "Bizarrap", "yo tembien", "Sino no lo pasa el anuncio d youtube   no lo conoce nadie a el tema", "Me borraron el comentario de la queja.", "Aquí estoy por el anuncio de youtube 😂😂", "PARCE ME DEJASTE SOLO Y AHORA ESTOY QUE ME ENAMORÓ", "Quien la escuha en 2021", "Xxxxxx", "Justo vine a este video y cuando entre en ESTE video me apareció el anuncio 🤣🤣🤣", "Que anuncio de mierda que pasan en YouTube xd", "Visitas del vídeo antes: 2.000.000\nDespués del anuncio de YouTube:52.000.000", "2:48", "Hola", "Jajsjhd", "yo se vinieron por los anuncio de YouTube", "He aguantado mucho, ya no podía más lo busque 😔😔", "Like si viniste aquí por el anuncio XD", "Me rompía tanto los huevos el anuncio que termine buscándola xd\nMinuto 2:47", "Todos estos temas son iguales. Sexo, alcohol, minas casi en bolas atras y todos estos pajeros haciendo los mismos movimientos", "Si", "Darell capo", "Bellaqueo en febrero 2021???", "Like de los que vienen del anunció ajajaja", "Que buena música 😀😃😀😃😀", "El anunció de parchís me mando para acá ajjajaja", "Mi gusta darell voz", "Hoy domingo 31 de enero pensé q esta cancion era nueva.... Jajajaja lleva un año.. Y nunca la había escuchado.....you tube esta atrasaooo po oye!", "wuua mike towers", "Cuantas personas para cantar una pelotudes jaja", "Ni conocia esta cancion gracias anuncio de youtube temon xd", "Arcángel el mejor con jd luian", "¿Parte que más te gusta? La de Mike Towers nomas, sólo por el anuncio", "2:48 la parte del anuncio 🤣 xddd", "Anuncio de kwai llevo 1000 años viéndola y por fin me decidí venir a ver la canción por publicidad", "Like si estás por kwai", "El anuncio de mierda me rompió tanto los huevos que tenía que venir", "On fire💥💥💥💥", "EL ANUNCIO QUE MAS ROMPIO LOS HUEVOS", "Vine por el anuncio jajajaj", "goooood", "Estaba escuchando otra música y me apareció este anuncio con esta canción Y decía ella escucha la música y se cree que es sexo cierra los ojos y me saben a besos y la escuche y la busqué", "Wisin el más destacado", "2:49", "\"Ella ecucha la mucica y se cree que sexo\"", "Los que vinieron por el anuncio de kwai de youtube", "Keke", "A nadie me importa si vienes por el anuncio", "Cómo se llama la canción al final??\n\n\n\n\nLike si estas aca por el anuncio", "2:49", "2:48", "El anuncio de puso denso y termine acá", "Mike Towers 🔥", "España kbrones", "Vine por el anuncio", "Vos de mujer tiene el que dice si el novio se pone bruto placa placa jaja", "Me rompieron la pelota con esta música YouTube del anuncio", "Jaja yo", "Like si viniste por el anuncio de youtube", "Solo yo vine por el anuncio de Kwai en Facebook 🤔", "Farruco siempre le pone ese condimento especial", "2:47 mejor parte ;3", "X el anuncio jajaj", "Pura gente que viene por el anuncio soy uno de ustedes xd pero tampoco para sarparse no encuentro ningún comentario hablando de la música xd", "Vine por el anuncio 😂🔥", "Solo vine x el anuncio ajjaja", "Jajaja vi el anuncio y como siempre  infaltable rompiendo Myke towers", "Wuaaa", "Que musica esta en 💥 oh perreo quien esta en perriando", "para esto me rompió tanto las pelotas youtube con el anuncio? re pelotuda la letra. \"ella escucha la musica y se cree que es sexo\" WTF QUE DECÍS NEGRO VIRGEN POR DIOS.", "Vine aqui por el anuncio de kwaii que me aparecio", "Al parecer todos vinimos aquí porque ya nos canso que nos jodiera tanto 😤 2:48", "Darrel Dice\" Ese Novio Tuyo Que Esta To Feo\" \nY el Tipo que esta Feo Con Cojones 💥😂", "noooo maldito anuncio de You tube !!!! like si estás aquí por el anuncio jajaja !!!!", "años y no pasa de moda el reggeton", "me gusta mss el reggeton que el trap", "Orgullosa de conocer la canción desde q salió😌✌🏼", "Ya escuche completa la canción, así que YOUTUBE. No me pongas más este put* anuncio 🤧", "Los que están harto de ver los comentarios que dicen que vinieron de los anunciós \n👇", "Siempre me salia el anuncio y la busque", "LA MEJOR PARTE LA DE MYKE", "estas son las veces que dijo a qui a qui a qui 0:03\n👇", "soy admin no vine por anuncios xd", "Ajjaja los que vienen por el anuncio de YouTube que le apareció hace 2 segundos 🙋", "Quien la sigue escuchando 19 de enero de 2021 dale like y comenta?*\n😍😍😍😊😊😊😈😈😈😈🎶🎶🎶🎶", "1:53", "Vine por el anuncio de YouTube JAJJA", "Mikey tower negro horrible. Y el tema tambien.", "\"Ella escucha la musica y se cree que es sexo, se da los tragos y le saben a besos\" \n\nPor lo que estamos todos aca. c:", "Like si vienen por el anuncio y la parte de mike towers ☻✌", "vine por el anuncio de yotube osea del minuto  2:48  xd", "Nunca vi el anuncio!!?  La vi en kwai", "Porqueriaaaaaaa", "X2", "Por q tan solo 51 M de vistas", "ya me se de memoria la parte de myke towers", "Los huevos llenos con este tema!! Lpm", "The Ghost And Molly McGee", "El negro gangoso del anuncio", "Vine por el anuncio de YouTube jsjsjs", "Yo no yo estaba buscando musica de myke towers y me aparesio", "Como pelotuda buscando esta cancion jajaja🤭", "Yo igual  XD", "Fa todos por el anuncio y los que escuchabamos este tema antes que somos alienígenas 🤣😔", "Alguin sabe quien es la bailarina air esta Por la bocina en jacket amarillo. Ella es la misma esta al lado de Farruko cuando el  en su verso. Ella esta😍😍", "Juan lvnhm", "Quien mas vino por el anuncio klo meo tema ctm😂😂🔥🔥", "PERDÓN  ERA  2:51", "2:57  LA  PARTE  DEL  ANUNCIO", "LIKE  POR  SI  VINISTE  POR  EL  ANUSIO  DE  YOUTUBE", "Todo por el anuncio en YouTube, minuto 2:50 Jajaja (valió la pena ah)", "Myke rompiendolaaaaa ❤️", "Me está gustando como están asiendo estos vídeos en las discos bailando 👌🏼.", "que pUt0 asco la música y para el colmo la ponen en anuncio siendo tan mala,dediquense a robar mejor no haces esta mierda auditiva,encima con la aplicación de kawai no sé que mierd4,es nefastaaa diosss,por lo menos sanquenla de anuncios me sale sangre por los oídos cada vez que la escucho", "Los que están acá por el anuncio de YouTube en el 9/01/2021 horas 6:40  argentina like", "2:48 la parte del anuncio!", "El Perreo No es una musica?:v", "2:48", "Este tema es famoso gracias a los execivos anuncios de youtube :v", "💓🎶🎶🙏👊🔥", "Veo siempre esto en un comercial", "Vine a escuchar esta musica y me salió un anuncio de la musica", "los que están acá por los anuncios de YouTube", "Yo vine por el anunció de youtube por que me daba anciedad si terminaba de una quiero saber en que termina jajajaja", "Velocidad 1,25 se escucha mejor Like si tengo razón", "Putaaaa música enserio la puta  parte del anuncio", "Like si vinieron por el anuncio de Youtube jajaj xq yo sii", "Yo también  por el anuncio Xd", "Ajajja", "Quien escuchando 2021", "Con anuel y daddy Yankee uffff ni hablar", "YouTube me doy por vencida. Aca estoy!", "🤢🤮un asko esta musica", "Una mierda man, me tiene los huevos llenos el anuncio y esta cancion del orto", "Megusta", "El mejor momento es el 2:48 la rompio ese momento!", "Pvto anuncio, no voy a comprar yb premium >:v", "Creo q soy el único q no vino por el anuncio", "Like si viniste para escuchar la parte de Mike towers nomas...y al final era lo único bueno del tema", "Escucho el tema por que me gusta la parte que canta miki", "2:48 xd aca el anuncio de kwai", "Dura may", "Jaja me canso el anuncio y vine xd", "Puto kwai me lo pegaste", "2021 y aún escuchando este temazo 🔥🔥", "solo vine por que yo i mi tio vinimos a REPUBLICA Dominicana y  solo escuchaba esa canción mi tío solo cantaba ese chin música perreo en los curo jajá"]