["Just got back from this one. Didn’t think I’d enjoy another Dreamworks film but I did.\n\nFelt a lot like watching Madagascar. Plus, that animation is phenomenal!", "it reminds that this movie is like army of thieves", "9 days ago", "i heard the f word", "The fact that the snake hi fives with his head….it’s just adorable", "this looks good", "WHEN ZE IMPOSTER IS SUS THROW HIM OFF THE BATTLE BUS", "\"Listen up! This is a robbery! We want to harm no one! We're after the bank's money, not yours! Your money is insured by the federal government! You're not gonna lose a dime! Think of your beloved ones! Don't try to be a hero. Just shut up, and stay down, and this will be over in no time!\" -Dallas, PAYDAY: The Heist", "its very interesting movie!", "I love that movie", "Some referance of Sherlock holmes the french  cartoon , i like that !", "This gives me Madagascar, over the hedge and megamind vibes. Old school dreamworks", "Definite Lupin the Third meets Gumball vibe. West finally learning from the East...", "I love it", "That musle car is sick af", "I love this movie", "GTA V be like:", "I look id", "in german: DIE GÄNSTER GANG", "i like the cake man :{", "why do i feel bad for the cake man :[", "Kinda hyped for this", "You know, “The Bad Guys” is actually a really old book. I believe this movie is based off of it. The book has the Wolf,Snake,shark,pirahna, and spider.\n\nIt’s just really cool to see that someone’s making a movie out of it.\n\nI also appreciate that the video is 6:12 instead of just 6", "it gives Lupin The Third vibes", "Fun fact, the chief has the same voice actor for Lois from family guy", "r34   :(", "Nice", "That lighting though", "202020", "Just saw the movie and it was super fun and adorable. All the characters have such lovable personalities. Piranha was one of my faves. He was so cute. :D <3", "Ms.tarantula it's my favorite😍", "The amount of work put i  just 6 minutes", "C ddrdrdtdffcvcvbbgfgvvvgggchcgfgcgfgg\nPkkhhfycgcgfffyil\nJkjkhjbhhjiiugh\nJhhjhhhhhhjhhghghyhghgggyyyygygyggyyggggg\nZawzasaaaaassddrrrrrfd", "The Snake Guy reminds me of Rango The Lizard.", "It's just like Disney in the '90s", "Im getting serious nostalgia from the books :)", "basically gta 5 but criminal animals, snake is the guy on a job listing , tarantula is lester , piranha is trevor , shark is franklin , and wolf is Michael", "The art style... I'm kind of here for it.", "Yo I'm actually gonna enjoy this", "That's ...", "tats not actually the start... they missing the first minute or 2 at the start", "Can someone tell me what song they were singing near the end?", "This looks entertaining. But Lupin the Third is better than this.", "I HAVE THE BAD GUYS BOOK", "I did read some of the books and this looks lit", "AcTuAlLy ItS sIx MiNuTeS aNd TwElvE sEcOnDs", "This is so cool I cant wait to watch this movie! :D", "Omg i really like how this style, it looks unusual as if from comic, I'm sure that the cartoon came out amazing", "funny movie xd", "What a great movie", "4:12 what’s this song called? 🤘🏻", "What’s the song they we’re listening to when they were getting chased by cheif", "Ha nooob", "“HaPpY bIrThDaY mr grumpy pants” “I think I hate you” and then when she went back to smiling i thought if I edited this she would day “good :D”", "$999?", "4:07", "with a hacker u can do anything", "Tbh i'm happy it looks like wolf isn't trying to be good in the movie but not happy that mr.legs is a girl", "They can fly LIKE FLI LIKE A FLY", "Is a cool", "As i said when i first saw it\nThe Big\nThe Small\nThe Good\nThe Bad\nThe Furries", "Oh look, yet another movie where the bad authority figure is a woman because god forbid a male authority figure be portrayed negatively.", "so happy cartoon to see. i'd like it", ".", "I watched it on the theathers with my parents", "Is  there going to be a encanto 2", "I used to read there books but this is way better", "The bad guys the movie is cool", "I already want a sequel", "😆", "😒😒", "I love the animation style", "The bad guys coming out summer 28", "I wish this goes on disney+", "3:34 everyone: **disintegrates**", "I thought the car was orange", "I love the music playing in the background while Mr Wolf and Mr Snake are walking up to the bank.", "you have me hooked take me away to the cinema\nplease", "“Don’t mind us guys, just robbing this place.”", "I'm sorry but for a second- I thought it was a Roblox thumbnail-", "I agree that it is very funny even in the first six minutes of the movie because of piranha's farts.", "dis pretty good", "Your content is so entertaining! Love it🍅🥭🍎", "Ok the Police Chief is such fan service bait roll out the Beefy Fan Art Folks 😋😍", "Me when I am ambushed by slenders in 2:59", "Thank mrbeast for leaking this 😅", "The so called \"CalArts style\" actually works with this movie.", "Wassup pappa", "This movie looks cheesier than cheddar.", "5 Star wanted level be like", "The line \"YEAH, WE MAY BE BAD, BUT WE'RE SO GOOD AT IT\" makes my heart skip a beat", "THIS SPOILS IT FOR ME SPOIL ALERT", "4:37 \"Welcome to Los Santos.\"\nGonna be lit.", "RAWR finaly i can meet the biggest baddies on DreamWorks! 💅", "ayo what up", "Lupin", "You guys copy from Mr.beast", "Sussy", "Los Santos ever time", "the spider is the actor for both raya and the lost dragon. and Shang Chi", "Snake: ha look who", "Craziest Five Star police chase I’ve seen", "That is a dus", "3:23", "The animation is beautiful ❤️", "I’m watching this movie as a field trip at school B)", "Webs: Uh, piranha did we forget something?", "He be driving stylo", "I loved this movie. It was so good", "Mr.Snake:I think I hate you-u-u-u-u-u", "Why did they make this movie people might call it a furry movie", "This is not the first six minutes of the bad guys", "borkfect", "These were the days when movies were golden ❤️", "Mr", "Thx me beast", "4:12 is definitely going to become a meme.", "I think I hate you *mr. Snakes said*", "4:10 F L I N T  L O C K W O O O O O O O D", "You steal from mr beast", "The books are ALWAYS better", "Looks as good as turning red, absolutely fantastic", "can we take a second to appreciate Wolf's Mad as hell driving skills? He'd make some of the best known criminal car chase drivers proud", "Yep, okay, thats it, I'm gonna watch this movie now. Thats was fucking awesome", "DyrvudoyvvJu,vem", "wheres the bald guy", "woiw", "1:40 Tarantula sound reminds me of Sisu the Last Dragon 😂", "Somebody knew about cars for this movie.\n\nAt 1:25 they don't make him just go two hands on the wheel, the chose to put his right hand (left in our view) on the gear knob to make him shift, he has rally tape/shard prevention tape over his headlights, the car as a whole slightly resembles a late 60's Camaro in many ways, and even though the animation style is very sharp and extremely cartoonish you can still see they knew all about how a car should shuffle over bump, lean and roll through turns, suspension droop in the air, especially at 4:43 with the sparks from the oil pan catching the ground. As a car lover, this scene blew my mind..", "Mr beast post this video first boi", "its gta", "POV: you have max stars wanted level in GTA", "\"I think i hate you\" - Snake 2022-2022", "It is trailer", "I think i hate ahahhahahah this will be so good", "Dude you missed the first part...", "Me and friend got stuck in traffic so missed the first 5 min of the movie, glad to have found this. \n\nI highly recommend this movie, 9/10", "Fun fact: Ms tarantula is referred to as “legs” in the books.", "This is a cool movie", "Feels like a Zootopia knockoff with 2005 graphics. No thanks.", "What song is this", "WHOA!! THJE NEW BEASTARS EPISODE CAME OUT!!!1111z1z!!!!!!111!1Z1z!Z1Zzz!zZZnvbgUDZaTSDEWGFSKFADFSGz ccc", "I just hope the days of Shrek, Madagascar,megamind come back", "nice)", "Not even a minute then they already broke the 4th wall.", "The Chief deserves credit for her own set of mad skills.", "cool animation but why the fk they give them the most fking common names...mr? ms??? wtf", "5:52 The Bad Guys: 😨 Me: 😆🤣", "Wolf: What? I just wanted a longer car chase.", "The oceanic cinema cytologically instruct because fur lilly influence worth a witty relish. recondite, wanting vault", "2:17 🤣", "That female cop looks like an adult version of turning red girl", "Awesome video, keep up the good work! ❤", "This looks like this can be a cartoony GTA movie", "I never seen more then 5 women in a animation movie. You know this about to pop off", "Phiranna: AHHHHhHHHHHhhHHhhHhHhHhHhHhH me: b-but o thought phiranna was fearless", "This animation is waayy better than Disney sorry not sorry", "Will you go to heaven? Have you ever lied, stolen used God's name as a curse word (O-M-G)? According to God's law, you're guilty,ignorance will not be an excuse... But wait, God loves you, he made a way out. God so loved the world that he gave his only son that whoever believes in him will not die but have everlasting life. John 3:16 Please think about your eternal life, believe and repent, even after rapture you can be saved. Love Y'all", "It would be cool IF yes IF they made a prequel and revealed that he was the brother of Nick wild from Zootopia", "yes", "When everybody did not put there sit belt and the car when like some of them were flying and the. Minute they put on sit back THAT IS FAXT😂😂😂😭😭😭🤣🤣🤣🤣✨✨✨✨✨✨💅💅💅💅💅", "who remembers reading the books? 🥹", "Why are you uploading the first six minutes from the movie?", "Bro, even flushed away was better than this😔", "I’m not afraid", "And still no Shrek. 🫥", "wolf = lfd nick", "This move seems like it’ll be a good hit in theaters or whatever streaming service it’ll be on. Car guy here and I want to congratulate on how amazing they did with car details. It’s cartoony yes but the nailed the details like the manual transmission, handbrake, engine sound, suspension, etc. It’s truly the most beautiful protagonist cartoon car ever. I’m excited to get a look at this movie, don’t care if it’s for kids.", "how about the first 7 minutes", "Wooo.. next fast furious", "Books are better still 5/5 though", "This video may be can be funny but I didn’t finish it off", "I almost have all bad guys books at my house", "I feel like the movie is inspired or from the book named bad guys or something\nAlso every bad guy character from the book is in the bad guy movie", "I saw this movie friday and it was great", "Wat", "For the past 6 days, I’ve been trying to figure out Ms. Tarantuals voice. ITS SISU", "I loved dis", "That was to long for a car chase", "I'll never seen the \"Bad Guys\" Before,and i lile Wib cause shes the master of the hacker like Jenna the hacker her username is,user:AGirlJennifer thats it guys thats why  i like Wib so much!!.", "Fun fact this movie is based on books and I read all of them there good I recommend", "Shouldn't You include SPOILERS in the title of the video? It's technically spoiling 6 minutes of the movie for people. What if they were going to see it in a few days? That would give them so much unexpectedly added time to accidentally spoil it for others.", "the movie looks really good, imma go see it in theaters", "For a movie where the main protagonist is a furry, this seems fun", "DAMN gta", "Your video is great", "Did they really cuss at 4:27 saying fuck? I can’t hear it that well with the singing over it, or what’s the songs name", "I think the Big tuna is a reference to the office, considering Craig Robinson worked on that show.", "Thanks MrBeast for stealing this.", "mrbeast actually stole this", "R.I.P legs :(", "R.I.P Legs 2nd Bad Guys Book - Bad Guys Movie", "Anyone gonna talk about the thumbnail?", "Spoilers: the fox is a bad guy , wold turns good than goes bad, the hamster is evil your welcome y’all 💁", "Are we just going to ignore snake's file says he ate a police dog.", "1 min of it is cut out", "I’m just so excited to watch the movie!", "Ain't no way  he didnt wear mask while robbing 💀", "Lol", "Good job 🤣🤣🤣🤣🤣🤣🤣🤣", "Rico", "Competition \nBad guys vs payday gang", "Being a criminal in a world without guns must feel really good. The only way for them to get you is close and personal.", "I watched it its so good", "Its from a book the car is different and webs was not in the book", "I love it ty so I can see the first part", "He is 4th wall breaking 😂", "Yeah she just like that lady of Madagascar when she wants wants to kill the animals but this lady really wants the hunt them and put them away", "I like this joke\n  don’t mind us we’re just robing this place", "I get it!!! the bad guys are animals and fish that people are afraid of in real life! makes so much sense now!", "5:23 love the sound difference from the outside and the inside odd the car when it speeds up", "Pathetic! Nicholas Angel would have cought them within a mere 16 seconds!", "In the 6 first minutes I was sleeping in the cinema", "Mei Mei from turning red", "No", "The part with the seat belts reminded me of the time I forgot to put my seat belt on and I only put it on after seeing a cop car parked next to ours.", "I love it I watched it", "Pretty dumb of wolf to go to the police station. It made all of spiders work completely meaningless. I know I'm nitpicking a kids movie but still I feel bad for spider if she has to put up with that crap all the time.", "I just see the movie, the hamster is a bad guy", "So satisfying when some of your favorite vocalists end up in a movie that looks this good <3", "the piranha sense how did the piranha explode?", "is SO! COOL!\nand is so GOOD!\nand is god to", "Yeah its bille ilish theme really cool", "Marc maron as mr. snake!? HELL YEAH", "I'm bad myself 😎😎🤑🐺🦈🕷️", "The animation on this movie is kinda similar to the mitchells vs the machines", "mr beast stole it", "Tarantula: I use exploits\nShark: I can be whatever i want\nSnake: I can open everything\nWolf: Im the villain in every story\nPirahna: *B L O O D*", "that's not even how you drift", "Repent to Jesus Christ \n“Not only so, but we also glory in our sufferings, because we know that suffering produces perseverance; perseverance, character; and character, hope. And hope does not put us to shame, because God’s love has been poured out into our hearts through the Holy Spirit, who has been given to us.”\n‭‭Romans‬ ‭5:3-5‬ ‭NIV‬‬", "Everyone is just running away, while furries will start praising them on the spot.", "No hate at all but I would like to point out that this isn't the actual start...I love the movie!", "0:24 the word “dont mind us we are just robbing this place” was hilarious", "3:22 me after having taco bell", "Inspector Zenigata, your wig isn’t fooling anybody !", "Yyivexwxw1uemyfe21xyvumghmc32excytk3x?🇿🇲🇼🇸🏴󠁧󠁢󠁥󠁮󠁧󠁿 Euro Depot live animal you know", "Cool trailer. Now I'll definitely watch the movie.", "Gives me that old Toriyama design", "level 16 GTA V be like", "Today I just saw the muvie", "The officer kinda looks like mei mei for turning red-", "i like the movie", "From this clip 4:37 this reminds me of GTA 5 it look like GTA 5 map", "the song they were listening too said the f word two times", "this is just good", "since when was they're a small glasses in movies\nI don't understand", "Just saw this movie yesterday, it was a really good and funny movie", "How did it take 3:50 seconds to open the safe😂😂😂😂😂😂", "What can I say? GTA.", "Can’t wait, I think this will be a great movie", "The chief seems like a female bluto from popeye to me XD", "Time for the freaks of the internet to orbit this movie", "I read all the books and I can't believe they made a movie", "I seen the whole movie already", "A lot of movies are going for this new comic style lately...", "GTA but with furries, i love it!", "Medium stranger...", "Um its not 6 its 6:11 hehe", "i saw this yesterday is was a great movie", "loved the movie!", "I don’t wanna spoil it but also the person who was always getting the golden dolphin he is a villian and the president is crimson paws. The fox.", "i watched it in theaters yesterday, its just like the comics i read when i was younger :)", "Can you do the first 1 hour and 50 minutes of the movie", "Do you remember awhile ago we were suppose to get a Sly Cooper movie?\n\nThats what Bad Guys reminds me of the most. In everyway it has the same energy as Sly Cooper.", "Id say this movie is BULLSHIT. I watched it in the theater and I fell asleep lol.", "This has the vibe of the Lupin animated series and movies and I love it", "when did piranha have legs and when was Legs ever a girl?", "This reminds me of baby driver", "that musting is actually kinda dope tho ngl", "Cal arts teeth", "i dont know i wont be seeing it.", "Damn, the design in this movie is off the charts. Their silhouettes are BEAUTIFUL.\nSpider-Verse was a GODSEND to the animation industry.", "Yes  :D", "Good god, they’ve got such an awesome friendship relationship.", "Your mom is not a fan", "the wolf is just nick from l4d2", "Kinda getting sly cooper vibes..", "Ima watch dis Tomorrow", "5:08 is The attack of the clones republic gunship fly by sound effect I honestly think that’s pretty cool", "Does anyone else feel like they modeled and animated Wolf to after Lupin?  Cause that's what I'm feeling.", "i swear i have watched this movie in march, why are there new sneak peeks", "Mr shark is so funny", "Good movie", "Very good!)2", "Them: Copies entire mrbeast video\n\nMrbeast: you lied to me", "funny", "it turned out cool", "Oh the name of the movie is the bad guys?in my country its something like who said we are bad guys in english", "The best character in this movie is 🐺", "Badguymobile headlights:hoonigan car taillights:Nissan GTR R34", "this is like gta but with animals", "yeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee, farting JOKES", "I couldn’t find it on both apps netflix and Disney+", "Anyone else getting gta vibes from the place they in", "2:19 i just like that face she does (the first one nearby / not the big one) gives me The Mitchell Vs the Machines Vibes of the animation face she did)", "👍👍", "The actress that plays lady cop is Alex Borstein who also does Lois from Family Guy.", "Just left the Theatre, I LOVE THIS MOVIE!!!!!", "Am I blind or this is Victoria from Metal Family?", "This is way better than zootopia in my opinion. Humans and animals living together. Amazing", "I whacht bad guy's and at the end the gangster gang get arested", "4:21 Flo's Gas Station from Cars!", "Oh hey guys just robbing the place", "what song is that 4:29 its so good lol", "They really missed an opportunity when they didn't cast David Hayter to be the voice actor for Mr. Snake", "Ahh yes. Telling kids that crime is fun. My favorite.", "I’m watching it tomorrow at the movie theatres 🎥 🍿", "I can watch it I got a 10000$ Tv", "Great cartoon!", "This is a very cool and interesting sneak peek preview of the film, and hilarious too! It’s getting me excited to see it!", "im 20 and i will watch this film, if you ask me... beats the new fast and furious films and it beats all comedy shows on netflix :O", "I like tha cars", "btw webs is called legs and is a boy in the books", "lol i love this and the books of the same", "They remind me of the payday gang so much man I love it", "I was waiting for a movie for this book and can’t wait to watch it 😄😁", "\"don't mind us, we're just robbing this place\"\nmost polite robber", "funny)", "I can’t stop thinking the fact that they’re running away isn’t because they’re “Criminals” but because they’re inside suits. I may sound offensive but that’s just really how I think. *The people don’t like people in suits.*", "🤣😎", "I ain't gonna lie, I really want to go watch this movie, but this is one of those movies where there's no way you can do that as a 24-year-old without immediately coming across as a furry.", "Let's take the moment to appreciate how much effort he puts into his content for us💚", "i suprised that the car is still, in one piece", "That eas funny went tgey were fall and tge cake be like: HAPPY BIRDDAY", "Jesus these are some really bloodthirsty cops not gonna lie... still, awesome movie.", "this gonna be a sick movie", "b gvfgtcserrx", "jh j", "busu", "I already watched it", "Mrbeast posted 7 minutes of it", "I’ve seen one of the books", "sooo Miss tarantula is a hacker?", "cool", "I think simply the movie will go a bit like\nWolf being a michael\nPiranha being a trevor\nAnd prob shark being some franklin", "Mr. Wolf really likes being chased by the cops because he finds that being chased by the cops makes the heists fun.", "this is gta 6", "This Movie is definitely getting an academy award, just by the trailer and the animation i already love this movie", "this will be a great movie love the books", "I love it!!! I can't wait to see the whole movie!", "Furries are simping over this movie", "this was first leaked from mrbeast so u just stole mrbeasts video", "I have watched it awsome story..", "I can sense the girls starting to simp over the wolf", "The police girl looks like meii lee", "This movie gave me Lupin the 3rd vibes", "I don’t like it", "its a good movie trust", "Hazel hair looks like somebody from Michaels vs machines, cant put my finger on it.", "the car animation is everything", "A wise woman once said \"I may be bad but I'm perfectly good at it.\"", "this obviously has  to take place in LA", "Just saw it hilarious movie", "The police aren't even driven perfectly only the bad guys", "En latam ya se estreno xd 🤠👊", "I had pretty low expectations for this movie.\nAnd oh boy did they exceed them BY A LOT.\n5/5 movie.", "I watch this and i am watching like a Lupin the third Dreamworks", "This is how long the theme songs if naruto is\nWhat I’m trying to say is this is the longest trailer of my life", "Just stop spoiling it", "As somebody that read and really liked the books. This stays pretty faithful to the source material while simultaneously telling an almost brand new story. I need to watch this whole movie.", "la piraña hablo español", "Hi", "What is the opening song? I love it.", "Cool 😎😎😎😎😎😎😎😎😈😈😈😈✌🤟🤘", "What can u watch this on", "That clip gives me baby driver vibes", "3:22 THE WAY HOW PIRANHA DID A FART BOMB!!😂🤣😂🤣😂🤣😂🤣😂", "I'm falling more and more in love with the animation the more I see, can't wait to see this movie", "God, I love this animation style, with what looks like perfect pencil lines over 3d frames. I hope it stays in relevance for the next while. \nI can tell I'm gonna love this movie when I watch it though. I mean, the characters just seem so interesting and charming! It's just an amazing concept all around. Can't wait to see this one.", "We all know that mr beast reveal the first 6 min", "Bro shark is 😂", "My ad was the bad guys before this video and I thought it was the video :/", "cool", "Mr beast mr beast thank you mr beast", "Why did they waste all the time to make such an excellent recreation of Los Angeles just to ruin it with these bland looking characters", "Mrs. tarantula sounds like the voice actor of sisu from raya and the last dragon", "So cool I just saw bad guys yesterday 😂", "i love it. the animation, the graphics, the color palette, the voices and expressions, it's friggin perfect!", "2:20 2:25 2:24 2:23 2:26 2:27 2:28 2:29 2:30 2:10", "\"I'll lock you up for so long your *fleas* will have *FLEAS!*\" was amazing", "This movie is awesome!", "My name is mei Lin lee (the cop)", "I got to watch bad guys in the theater on firday", "I love the movie bad guys", "i hope it lives up to the books", "It’s ok", "So furry bait?", "Some cringey kid humor, but really awesome animation in a style that isn’t done enough. Might actually see this one", "This is a very good movie it’s amazing! I love this movie it’s a lot like the book but with better designs and better detail with what is actually happening it’s amazing! It might not be in cinemas now but it was a very good movie ^^ my fav character is obv mr wolf! He’s a lot me!", "Cant believe mrbeast stole this movie", "I guess I have six minutes", "You Watch the movie!", "Garbage", "You took this from Mr beast", "4:13 anyone know the name of the song?", "This reminds me of the bad guys the book", "LOL", "this movie is so fucking cringe no offense", "It's kinda interesting of having  anthropomorphic animals and humans in the same movie. Usually it's one, or other.", "This is the next level of Dreamworks😍", "It skipped some parts", "Your not lying I watched the movie and ur right", "LOL the snake fist bumps with his head", "I love your dressing sense.", "I think this movie was made in the Fast and Furious universe, cause that car's suspension is  (*Chef kiss*)  perfection.", "why are there so many animal movies coming out ? bro this kinda sus", "I like how they put their seatbelts on after 5:38", "Ay YoU gEt OvEr HeRe", "why at the begining a guy just says...\"AHGHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH\" then snake and wolf are like \"LeTs dgo ThIs\"", "can you make it longer... for A science project 😅", "4:33 LOOK AT MR. PIRANHA HIS EYEBROWS ARE MISSING", "Let's take the moment to appreciate how much effort he puts into his content for us", "He got this mr best when mr best stole the first 6min", "Me y love loup", "The movie is pretty good, I've watched it today.", "Wolf is so bad he broke the 4th wall", "I love that they have a tiny seatbelt for the spider just for that one joke lol.", "People who see them as monsters are total jerks! To hell with stereotypes! 👎🏽😡🤬", "Im so hype", "fucking hate fart jokes", "It is based on a book", "Why the fuck is the spider a female?", "The ending of the movie was cool", "Finally im wating for this scene, and im wondering what song that Tarantula put at the chase", "What is that song I can’t remember the name", "I watched this movie in the cinema it is my favourite movie", "Julian fleegle Lola Bunny bugs bunny and foxy the bad guys movie coming out summer 28", "Awertyuiopasdfghjklzxcvbnm,.bbbbbbbbbbbbbbbbbbbbvvbbbbbbbbbbbbbbbb.    Bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb.    Mmm.   🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉 🎉 and 🎉🎉🎉🎉🎉 🎉 and the national guard as the director of the 🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉bbbbbbbbbbbbbbbbbbbbbbb", "The lighting is amazing", "For anyone who wanted the song the bad guys sing its called Stop, Drop, Roll by cant stop wont stop.", "Mr piranha is a god", "My fav is the Big bad wolf", "I can’t believe GTA copied these guys.", "Bruh all 1 dollar bill in the safe is it really worth it?", "1:16 Ah... so THHHHHAT'S WHY they're always paired up together on rule 34.....", "Was I nerding out bc of the smooth Animations yes do I care no", "3:05 what did he say?", "1:18", "Billie eilish is going to LOVE this movie", "This animation is amazing!!", "Idk why but I don’t want to see wolf become a good guy for some reason lol.", "I thought this was family friendly but it wasnt bc when they were singing there was the f word in it", "I just watched this today with my girlfriend, such a good movie", "payday 2 lore", "nice", "GTA In a nutshell", "Err legs wasnt a girl in the books...", "Wait. Why does the chief look like Mei?", "Watching this as a 24 year old made me feel young again.", "\"I'ma put you guys away for so long your flees will have flees!!\"\nThat made no sense, I love it.", "Mr. Wolf can step on me", "GTA be like", "WOW THIS MOVIE IS IT REALLY OUT RIGHT NOW!?!?!? 😳 😳 😳", "Hear me out guys", "Ah yes. “Sonic Adventure 2 baby!”", "“Hey Bad Guys the G.U.N Military Truck is after you!”", "You stole this video of it 6 minutes from mrbeast dummo", "Imagine \"City\nEscape music!\" was playing in the dreamworks\n\"Bad Guys movie!\" That would be epic to see\nthem trying to out run the gun truck from SA2", "A113", "If no it would s \"six\"", "Do u know how to spell 6?", "So happy we're leaving that era of 3d being ugly with realistic textures, they're finally realizing that going back to a stylized look will stand the test of time.", "Notice how Wolf's Mustang has 4 Exhaust 2 on the Sides and 2 on the Back? Next Level ain't it.", "At Cinema I have an idea to record the whole thing and when I want to watch it I can", "So there's only one female in the group?!", "What are they the most normal looking people in the movie", "10/10 movie", "Kylie", "I loved the part when the pirana says \"wassup papa 😎\" XD noe my fav part on this movie rn", "Wow I can tell this movie is going to be hilarious at the same time🤣 lol", "Cheers mate!", "I swear if The Bad Guys gets nominated for The Oscars next year and loses to a live action film cuz of the whole, “CARTOONS ARE FOR KIDS” thing, I will strangle somebody", "cant wait till it comes out.", "This music slaps", "Mr snake,”I think I hate you”it’s his birthday he can say anything", "I’ve watched the bad guys in the cinema it’s awesome", "They are not old school you are Old school", "Mr piranha reminds me of minion from megamind", "It's like Madagascar meets over the hedge megamind kung fu panda wreck it Ralph and despicable me", "I love the animation style", "I just love when phirana says to wolf \"hermano\" xdxdxdxd", "this looks like a nostalgic movie for the early 2000s kids", "Spoiler warning!!!!!!!!!", "The bad guys movie coming out in summer 28", "Mrs. Stark is really good at disguise I didn’t even recognize him😂🤣", "Ooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo", "Your fleas will have fleas 🗿", "i❤ Your videos", "This movie is good, not until the furries attack the shit out of it......god i hope not", "That wasn’t from the start...", "The Graphic are absolutely INCREDIBLE! I LOVED THIS MOVIE SO MUCH!! ‘The Bad Guys’ was always my childhood book and seeing a movie about it is absolutely mind blowing. This is one of the BEST’ movies I’ve seen in my life, Honestly. 👍☀️• so 10/10. PERFECT’", "I want spoilers but I also don’t", "I watched this movie last night, I loved it", "I just got done watching this movie and I absolutly loved it", "I JUST WISH TO KNOW IS IT OUT OR NO?!", "Mm😍😎👍💲💲💲👑", "so much like Lupin the third, and I love it", "It reminds me of Madagascar 3: Europe's Most Wanted and F&F 5. The animation style is pretty good and interesting, but I can't help but cringe seeing another \"bean\" mouthed characters", "is anyone else getting kinda tired of the bean style of animated heads? Gravity Falls did it, Steven Universe Did it, The Amazing World of Gumball did it, Owl House, Steven Universe, Turning Read, and many others. Like at first it was new and original. It was different and had a special flare to it. Now it's over-used and getting old... Like animators... you have so much talent... please give us something new. This is exactly how I felt with Hotel \nTransalvania's look. The first time is ok... when ya do it too much with different franchises it gets milked like Disney milks Toy Story... Sour Milk coming out of the utters rather than fresh milk. Other than that, the story looks good and the characters look good. Except for the police chief.", "Why am I sacred of the fanart of a Spider", "SHUT UP", "Bad guys it’s totally a kids show for everyone", "Why does the security look like mei from turning red", "i just want to know what car there driving", "3:59 what the thorax", "The part where they are rapping together…Literally fell in love with the movie at that moment. First SIX minutes!", "Any villains acts cool as usually, until the jobs told so.", "4:50 IM GONNA PUT YOU  AWAY FOR SO LONG YOUR FLEASE WILL HAVE FLEASE", "I like mister parana! He cool and mister snake I like him", "The thing I love about this it’s the fact they flex on them so hard", "7.3k person to like this video lol!!!!😁😘🤣😂", "broo first it was the books, now a movie. Wow the bad guys must be really popular", "I wish i could watch rhe whole movie ive been dying to see this new movie but thanks for showing me this because this made my day!", "I haven't been this excited to watch a movie in a long time. This one seems good", "I have to ask, because im fairly sure the answer is yes, do these guys know their cartoons? Their actions and the way the world reacts kibda makes it seem like they do.", "it's BAD GuYS", "there was actually a part before this where the wolf and snake were talking but i guess that was the boring part ish", "We must sueds this movie", "This reminds me a lot of Lupin the Third", "1:18\nBest kind of Couple Dynamic right there~", "i read the books that the movie is based off and its a very good adaption", "Happy birthday Mr grumpy pants I think I hate you had me laughing 🤣🤣🤣", "I just watch the movie the bad guys in the theaters", "Why did the security guard look like Mei Mei from “Turning Red”?!", "Theres also a book about them", "2:05\nMs. Tarantula: Happy birthday mister grumpy pants", "I mean, the concept itself sounds interesting, but the art style is very off putting.\nThe human characters all have that \"bean mouth\" look that feels so weird in 3D. Turning Red had the same issue.\nI want to root for the main characters, but I just can't. :/", "I want to see this movie just for the style alone!", "Webs: What the Thorax?!\nMe:  😂😂😂😂😂", "i have bad guys book 1-9", "This is gonna be such a good movie", "I think it’s the best movie because it’s really funny 😆", "1:19 Why did I smile it’s so cute for some reason😭", "What on EARTH did they use for suspensions in that car?", "Major Lupin 3rd vibes and I love it! Especially with antagonising the police chief", "😁👍👍👍❤️", "The piranha has did the roblox smile.", "This film looks so good it's incredible!", "Snake is my favorite of the bunch", "Does anyone know the song that plays at 4:13?", "Did anyone catch the part at 2:00 where he said thank you ?? 😭", "The curly shock philosophically cover because committee industrially muddle worth a silent precipitation. decorous, abaft spoon", "I love webbs and Mr.shark", "why universal studio turned comments off for this movie????\nAnd why its not in recommendation nor even playable until u click video?\nJust why????? Can anyone explain this plz.", "This movies going to end by something going bad , they might do 1 more robbery then go seperate paths.", "THIS IS SO GOOD", "Is it just me or did the birthday cake delivery guy 's scooter looked like Baemin delivery?", "I absolutely love this & Wolf. 🥰🥰🥰🥰🥰", "I saw the bad guys in the cinemas pictures", "The animation is really good", "that artwork is SHÆDM@HN", "When will the movie will come sooner", "Just saw the movie and it was super fun and adorable. All the characters have such lovable personalities. Piranha was one of my faves. He was so cute. :D <3", "\"Don't mind us where just robbing this plqce\"", "God loves u have a great day", "so its a furry cartoon about a group of furries robing banks with a Gen z humor", "<3", "3:22 Funniest scene from my point", "It's going to fun", "The movie came out already for me- Rupert marmalade is the bad guy and he is trying to steal some kind of rock", "\"He's a sweet heart your a sweetheart\" Had me  laughing", "I want to see more action packed chaotic animated movies in this style)))", "2:07 2:08 Lmao 😂 I love Snake’s 🐍Comments insults comments saying he Hates them but he really loves them 🖤🖤🖤🖤🖤", "Absolutely must see❤️❤️❤️❤️❤️❤️❤️ so looking forward to seeing it with my friends on Monday it looks so good and Hilarious😂😂😂😂😂😂😂😂😂😂 Best cast of all time Bad Guys is definitely the greatest new Zootopia 🐺🐍🕷🦈🐠⚫️⚫️🖤🖤🖤🖤", "Literally a GTA server lmao", "Sweet", "Great now do the whole entire movie", "0:47 breaking the 4th wall. :D this is gonna be a fun movie.\n(let the fanfic's roll in)", "🤨🗿🤨🗿🤨🗿🤨🗿🤨", "Pov: you got 5 stars", "the one thats wolf in the this movie is 100% the second book", "Absolutely a must-see!", "Big Lupin III vibes coming from this", "On the outside", "Wow wtf omg 😳 um........I like how they vibin 😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "Yo is the thumbnail Mei Lin lee as a grown up?", "I like the movie but how can fleas get fleas I don't get it Godzilla the movie", "The licence plate say BADGUYZ", "Fun fact: mr beast stole the first 6 minutes of the movie", "The bad guys 5", "One of the badass bad guys", "im sorry if i did do a not click the bell i tried but sometimes it does not let me do click the bell😟", "everyone knows this is just zootopia in the villans pov", "Oh! i love this video\nCan't wait for your next video", "this is the most basic movie ever yet its so fun", "Mr Wolf And Friends", "4:28 - 4.40\nLitterally me and mates drving anywhere", "I think the phyco obsessive cop gale's gonna be the villain\nThe 2nd time a cop is the villain in a kids show\n1st would be bad cop from the lego movie", "I wonder why the characters of the movie are animals while the others are humans?", "This part was funny 3:05", "What song was that, I like it 👍🏽", "The first trailer honestly made the movie look a lot cringier then it probably is", "This is funny (3:23)", "No joke, the screenshot made it look like it was from Turning Red", "Ah yes , Mr wolf's iconic introduce the gang intro", "what car is black car i thought it was dodge charger....", "Wolf:hey you get over here little closer oh ye I forgot AM THE BIG BAD WOLF", "This Movie is definitely getting an academy award, just by the trailer and the animation i already love this movie", "3 Days Left Till Sonic The Hedgehog 2 Emerald Island (New 2022) 2 Days Left Till Sonic The Hedgehog 2 Emerald Island (New 2022) It’s Almost Here!🎉1 Day Left Till Sonic The Hedgehog 2 Emerald Island (New 2022) It’s Nearly Here! Coming Tomorrow!🥳"]