["Please mark read this:\n\n\n\n\n\nPlay a game called outer wilds\n\nYOU WILL THANK ME", "I don’t know how or why-\nBut I’m already attached to Kyle-", "This was legit enjoyable 👍👍👍", "This is a weirdly charming horror game.  I really hope that the boost by Mark and other let's-players will up the chances of a Part 2.", "Working great for me also", "Im telling the truth when i say this is the video i watch to get to markiplier in space,\nIm being serious", "i love this game because of 8 bit ryans random game video he made on it glad to see such a big youtuber play it and give it a big boost in popularity", "This game gives me serious Welcome to Night Vale vibes", "3:13 woah I didn’t agree to this", "Markiplier on the road?", "This is actually good now I don't have to crash against anyone", "GUNS OUT! BUNS OUT!", "I think Brett and Kyle are lovers", "what a interesting concept for a game !", "Will you be doing a play through of \"sons of the forest\" when it's finally released?", "Glad you got rid of the al pacino scarf.", "Don’t know if you’d still do this kinda content but would you try one night at flumptys 3?", "HEY MARKIPLIER can you PLEASE play Sally Face? I want to see you play it and i can tell you haven’t yet, it’s such a good game so just PLEASE PLAY SALLY FACE (ik this is out of context of this vid but PLEASEEEE)", "A", "I choose Brett", "So No-snake hotel looks like it'd be a nice addition to 3 scary games...just saying", "no pop'er in reverse", "The note Brett sung was like an E or an F (sorry for those of you with perfect pitch).", "Come back to Christ 🙏", "The traffic intro was just California Simulator", "Anyone else trying to find out the songs name at the end when he questions caller?", "THE END TO THIS IS AMAZINGLY MADE ALONG WITH THE STORY, GOOD JOB MARK 🎉", "Did you all not watch till the end? This comment section does not seem very aware", "B", "I choose B", "OH GOD EVERYONE'S WORSE NIGHTMARE \n\nTRAFFIC AHHHHHHHHHHH😱", "Some random guy in the back: take me with you... ahhhhhhhhhhhh... dies quietly", "That was a bopping ending", "Cool 😎", "i love the ABSOLUTE PANIC on Mark’s face when he thought he had to know for sure what the 20th president is", "2:11game dev misspelled forfeiture they forgot the \" i \"   [ forfeture ]", "Gives me Nightvale radio vibes", "POV: your name is Kyle..", "WKCR... \"We Kill Callers Radio?\"", "He  should play \"In Nightmare\"", "Mark:i have a big brain\nalso mark answers all the questions wrong", "I love how he didn't even go to a beach he just went to a dessert with a bunch of work stuff for a stage", "I choose B", "what's the music in the end? :D", "I told these guys to stop messing with the reality flux unless they wanted to face severe consequences, but now I seem to have no choice.\n\n\n\n\nI'm getting Warfstache!", "i think b. skinny dipping in the ocean while screaming like howler monkeys is my cup of tea.\n\n\n\n\n\n\ni kinda this kyle and bret had a little thing going on tbh. they sound like a married couple 😳", "Hey Markimoo, there is a new game like Cry of Fear! have you heard of the game \"Remorse: the list\" already? The Atmosphere, level and enemy design are pretty good, might wanna check it out :)", "I obviously choose option D.... Ladies, when in doubt, always choose the D.  😉", "AIM FOR THE TREES", "Ok, WHAT!? That ending COMPLETELY caught me off guard. ABSOLUTELY AMAZING Mark!", "I'm in love with Kyle", "Kyle: Y-you don't like the radio show bit? ....I thought we were having fun.\nMe, crying: I thought this was supposed to be a horror game", "You should play iron lung", "I still like brett", "ah. yes. THIS scp. can't really say I'm a fan, but we'll see how this plays out. oddly enough this is actually an interesting vid to watch with a fever. can't really say why, it just is. like wonderland. but with hentai.\n\nEdit: it was good. and we all know what the REAL choice is at the end, don't we? It's really the only one.", "as i am writing this im at 8:10 in the video, i predict this \"game\" is a nightmare because he fell asleep and they did say that they needed his soul to fuel their nightmares (i swear on my life i no lie FUCK GODDAMNIT FUCK FUCK", "what an absolute treat at the end lol thankyou", "This came in my recommendations right after I just wrote off my car", "Markidriver", "Love you mark, loved In Space with Markiplier, everything you put out is a banger", "Join my clan \"Ketchup\" on clash, bio \"Mustard\"", "I absolutely loved the ending gosh", "That was Bim Trimmer at the end, right? I haven't seen anyone else comment on it, but I'm pretty sure it's him.", "So I’m guessing this is in a different place (wormhole) and they all link back into in space with markiplier (crew members?)", "Memento Mori,\nUnus Annus", "The choice at the end caught me off guard", "I agree 100% with mark. This game is really interesting and well writing.", "Mark's turned into a horror game critic at this point", "Whats the instrutmental  song name at the end? 18:08", "THANK GOD someone made a game like this", "i feel like i just got rickrolled", "markiplier makes a good host", "Brett saying \"BIKE SPIKE!!\" sounds funny to me.", "play nights into dreams remake for pc", "The best segway into an in space with markiplier ad", "brett: *aims gun at mark*\nmark: i like you. you have a lot of hutsfuh.", "fantastic ending! fun to be out of yt exile and tell ya so MARK\nman im so excited you are making MOOOOOVVVVIIIIIEEEESSSSSSS!!!!!!!!!!!!!", "I chose option 1", "Does anyone know the song at the very beginning at 0:19", "a mars size planet hit earth a billion years ago and created the moon and give us wind", "A game you should play is human fall flat", "You should play cooking companions", "TBH Brett was kind of a badass", "That was really interesting, hah.", "Seeing mark compliment this game at the end was so wholesome", "A perfectly made tutorial.", "Who else thinks that Markiplier should play Cooking Companions??? I think he'd love it.", "This was an awesome game. Simple but one of my newest favorites", "The fact this is an actual video, but the end is also interactive makes me happy.", "Hey Mark you should play Iron Lung! :)", "God its just obnoxious and annoying how the keep covering the game with the camera.", "For that question at the end, I'm gonna go with A. I'm sure we all know how something like B will end when it comes to Mark.", "oops\nim aboutta cras-", "Come on how could you not get the space facts right you disappointed me \n(I like space kinda of stuff so this was an outrage)", "Brett: “There will be no free refills on soda.” Markiplier: “That’s the worst thing ever.”", "Your awesome", "That was actually a concert G#, not a C minor 😔", "16:32 is pretty much what I felt when they put me down for surgery last week....only...with my eyes closed? If that makes sense... It was all swirly and jumpy but like a dream. I've been trying to think of something to compare it to but it's like this effect, mixed with soaring thru the backrooms. Kinda terrible but kinda fun once I woke up", "Where are 3 scary games bruh", "B", "I love how the \"C minor\" was an Ab 🫀🫀🫀", "Its like if Welcome to Night Vale and King Falls AM had a child that was actively trying to kill you.", "Five Nights at Flumpty's 3??", "My favorite videos are Mark's simulator games videos!😆", "the biggest pop/top hits radio station in Rhode Island is 92.3 and they would 100% give away tickets to something like a beach-a-palooza beach blow out or whatever it was 😂", "Your videos are always so entertaining and it always makes me happy when you post new videos <3 :)", "can anybody please tell wahts that song at the end", "You have truly outdone yourself Mark! Great content plus a short adventure series.. Absolutely divineeee~!", "in case there's anyone like me that wanted to know all the correct answers:\n\nRound One: Football / Garfield (Man) / Michael Collins\nRound Two: Magnesium / Saturday / C Minor\nLightning Round: 12 / Wiley Post / Saturn\nLightning Round _(The Real Questions):_ La Paz / Elisha Graves Otis / Dziugas / _7 [neither was correct]_ / [REDACTED] / [REDACTED PART 2] / 56 km/h / [shrug emoji] / _[who's to say]_ / 1903 / Football\nFinal Question: [REDACTED]", "mark it felt like u were talkin to me this whole video and i enjoyed that", "god i hate driving", "Mark: \"I CHOSE BRETT!\"\nBrett: \"I choose you too caller!\"", "Mark is my childhood", "Wow this game was so interesting and I love the ending you di for this Mark! I would love to know the songs name it sounds so amazing!", "Bruh", "This is actually one of the funniest games I've seen in a while I love this sm", "I kinda wanna see mark play iron lung", "did mark just love this game so much he made a tie in to his current youtube show?", "Brett just goes from talking about how they're eldritch beings that exist beyond our human perception and immediately takes a step back when Kyle picks up the mic stand saying it's expensive", "funfact: Both Mayonaise answers (in 10:45) were wrong. Mayonaise has 680 calories per 100 gram. Which means 68 calories per 10 gram and 6.8 calories per gram. The question Kyle asked  was \"how many calories are in a gram\".  The correct answer should be 6.8 not 68 or 34.", "I don't know if I'd call it horror, but I think you'd enjoy the two Darkside Detective games. I won't spoil them for you, so you'll have to check them out to see what they're about!", "Huh just got recommended this after watching a YouTuber crash his plane on purpose what a twist", "Ok this was really creepy but at 11:40  the phone said they had been on a call for 9:02 seconds, i glanced at my watch an it was 9:02", "A", "Mark loves Brett because he’s a Masochist and Brett well…", "I would love to see Mark play this again", "I was not expecting a multiple choice ending to this video. I’m pleasantly surprised", "Is Kyle voiced by Mikey Day? Sounds just like him.", "i belive that all the games that came out after in space with markiplier are made by him and his team", "18:08 song name pls", "brett soda", "Did anyone else get real cyberpunk announcer vibes from the bit at the end?", "I agree, it's a pretty good radio station.", "18:08 what song is playing in the background??", "This is actually brilliant. Haven't seen something this clever and creative in a long while", "I love you Mark! Your show is my favorite! Made my own channel. Hopefully I will be successful 🙏", "Have you seen the quarry’s trailer yet it’s another supermassive game coming out soon I think it’s right up your alley!", "why does the moon keep getting bigger", "Almost dies** \"Oooooo!!! Heeeyy!!! \"", "considered.", "Nice ending", "B", "Mark please play the closing shift one day. It would be perfect for the horror segment!", "thank you mark for playing our game!!! I tried to make this game as unsettling as possible  but you just made it look fun to play! thank you again for playing our game.", "Most people are signified to it being a horror game by the traffic.\n\nAs someone who suffers from severe sleep apnea, I find falling asleep at the wheel much for terrifying.\n\nAlso, we now need a Existential Dread Radio Quiz Show with Markiplier.", "Traffic jam...\nMark: oh, God. Its a horror game", "That...was an experience", "Kyle has the voice actually used from Linus the person behind Linus tech tips", "Just putting the idea to Mark. Please play Iron Lung. It's a horror game. And Mark is definitely going to hate it. Just asking.", "You gonna do poppy playtime chapter 2?", "creative outro mark", "can you play Amanda the Adventurer horror game?", "First exotic butters and now soda, what a good week", "kyle sounds like linus", "does anyone know the  name of the vaporwave song at the end?", "mark you are a legend. The fact that you put so much effort into your videos is inspiring! You didn't just play the game and give your opinion on it, you gave us something else at the end that ties into it!", "Mark, if u like these types of games, then try BEWARE.", "Dumb comment to post on this video but like Honesty I haven’t had a favorite “COMFORT” YouTuber in a while and recently I’ve had a hard week for me in school and out but me being the extrovert I am I get most of my serotonin and energy from talking or hanging out with people and over my 4 day week it was hard from just a lot of things in my life and watching your videos made it better I was in the middle of having to listen to another argument that my dad started with my mom and I turned on the tartar sauce popsicle video and I forgot all about my worries. The other day i had a horrible day at school and I just needed to be cheered up so I turned on the cards against humanity videos and i felt way better. Just too simplify what I mean is that I really okay I don’t know how to word this but like sorta idolize you. You manage to put a smile on my face with HOURS of ugly crying but I really love your videos and I hope you see this and just know I would literally give my whole family and my left kidney to meet you ☹️✋", "You should play wrench", "Does anyone know that song or beat Mark used at the end? Kinda digging the retro techno beat", "Brett is my spirit animal", "ANY KYLE SUPPORTERS HERE?!? 😈😈😈", "i cant tell if beach-a-palooza is a steven universe reference or not", "just in case someone missed it, there is an ISWM esc thing at the end of the video!", "why is brett bob and kyle wade", "I was confused for a second at the end but continued watching and I am pleasantly surprised. Didn't expect that!", "very cool ending!", "Mark i want you to know that im a big fun i liked every single video of your and i see evrything that someone could possible see in space with markiplier i hope you reply me and if you dont i still like you", "the end of this video is genius.", "Mark, you absolutely slay me sometimes", "This game was very entertaining", "is there an actual song for the ending you can listen to?", "So long no see, Bim Trimmer :D", "\"now it's a pizza pie\"", "Honestly would be perfect if they had just spell checked the text a little more. So many weird errors. Normally I don't care about typos but with THIS much text it's distracting", "This thumbnail has 2012-2015 youtube vibe", "I got super hyped at the end of the video and thought he would do some sort of choosing your own path type of thing.  I'm glad i stuck around to find out the answer", "Brett just got done farting on his roommate’s door", "YOU NEED TO WATCH UNTIL THE LAST SECOND! That was so cool!", "Mark you have to play Iron Lung heheheh", "When he sang \"C minor\" he was actually singing Ab 🤓", "I am simping for Kyle and Brett now. Holy shit", "Steven universe?", "Is this kyle from she-ra?", "You need to play ''Turnip boy comit TAX EVASION''", "I would love to see Mark play the game Iron Lung. That game is incredible.", "the playlist ends at 200??? but it says it has 466?  how do i gain access to the missing 266?", "I can't not hear Brett's voice and just imagine that it's Walker Boone's voice from the Super Mario Show", "Mark : What’s your name? \nCaller : Brett.\nMark : Okay, Bread.", "18:05 Leaving this here for myself\nalso is this just Dingo and the Baby, shoulda got Wade in on this lol", "I wonder if you could just hang up the phone, it had an off button", "wow", "Hey Mark, there’s a great horror game out called “Submission” (part of the Dread X Collection 3) and I would love to see you react to it in a 3 scary games episode or somethi", "Beach-A-Palooza Spring Break Beach Blowout - try saying that 5 times really fast while drunk", "Why is no one talking about how epic the music was near the end?", "lol mark has been playing these games lol", "I miss resident evil I might re watch it now that I don't have school but it's almost been a year!", "i love mark\nhe is my bias", "Sometimes I wish I knew of these games before watching them.", "Not bad at the jump really feels like I am going to black out", "Ok but did anyone stick to the end of the video?\nJust do it don’t skip anything till the last second", "He should play back rooms survival", "Wait...this turns into another heist/ in space with mark wtf my brain", "4:28 Why does my name always get enunciated. What did us Kyles do to deserve this!? Drink monster energy!?!? I DON'T EVEN CARE ABOUT ENERGY DRINKS", "Am I the only one getting Frank from house party vibes from Brett?", "3:14", "They made me think of Pleakly and Jumba from Lilo&Stitch", "Brett: C, this is a C *sings an A-flat*", "Moon Gland", "I'm finna kick that storms ass!", "Anyone else notice the moon getting larger while Mark was driving the car?", "What’s the song called that is played at the end (18:09 - 19:44)", "Please play madness combat: nexus!", "I watch Dom play this", "💮💗🌟🌠💙👙🎄✨🌠✈💮✈🎋💮✈💮👙💙💙🌙👙  *Because of  love. God sent His Son Jesus Christ to die in our place. Three days later. Rose him  from the dead.*   *Now. By Jesus Christ alone. God has granted us the free gift of eternal life. He will save and heal you.*  *If you confess with your mouth the Lord Jesus and believe in your heart that God has raised Him from the dead* *He'll give you eternal life*\r\n*(Look up at the sky and ask God)*", "why did I confidently say \"soccer\" to myself when the first question popped up thinking Mark was gonna die by choosing football...", "I knew it was going to happen", "It’s Damien at the end! From Who Killed Markiplier!\nHis line in regards to was: “Life is ours to choose”\nNot sure if this is pre or post merging with Selene tho, probably post because he was just a mayor before then", "Йоу, крутое видео", "Dose anyone else feel like a Brett is Azawia and Kyle is Present Mike?", "Literally No other youtuder does it like mark there's no way this man is real", "Brett rly do be impressing mark tho..", "I choose B", "day 5 of asking if markiplier can play risk of rain 2 again", "8:28 that's an a-flat, not a c\n\nyes i have perfect pitch thank you very much", "THIS IS SO COOL OMG", "S W O O T Y S W E E T", "(end part plays)\nme: Is this an In Space with markiplier ad?", "Whats the name of the song when mark is asking the caller questions? its awesome.", "What song was used near the end of this video", "anyone know the name of the soundtrack during the ending of the video?", "welcome to night vale-core", "Not even a week ago another quiz asked me for the atomic number of magnesium. Spooky...", "*Tries to make sense of sporadic Alien language buzzing on the screen.* That one?", "I love how he continues the game with us 🤍", "E", "I am so obsessed with Brett. Like yeah he’s trying to kill us an absorb our psyche but he’s a silly guy", "1:50 B B B B B B B BONER CAAAST LOL ah man those days with the guys.", "Mark play silent hill", "Lol got us Mark got us", "hey yo mark you should do more stuff about the game theorist for example like the one where they talk about you being a murder or did you already do that one :?", "That was a great game!", "Demons: and that means free soda refills! \nMark: *brett soda*", "The end music is a bop tho", "I'm in love with this game already, its like all my weird but humorous horror podcasts made playable", "Mark Has Thing For Dangerous Radio People Named Brett Trying To Kill Him So They Can Consume Is Soul", "man i forgot you good the videos are", "Im so dumb\nI just skip this video in 18:34 \nAnd now i understand why my friend insisted that I watch this video to the end...", "Ur mom", "what a great time that is", "I don't know why I was avoiding watching this video(simulation), this is such a good game", "Anyone know the music playing at the end?", "I *NEED* to know the synth soundtrack at the end!", "\"I CHOOSE BRETT!!!\" Will always be the best.", "What's the song playing under Mark's bit at the end? It's such a great jam!", "Damn the ending", "Buns out and fight the storm screaming 😏", "I didn’t know I was the driver", "1:04", "dashie", "Im really impressed how Mark decided to make a game for ya'll to play too. I love it", "It was great! I wanted to see some extra terrestrials though 🤣", "Wow I got all the correct endings first try and it send me to \"in space with markiplier part 1\"\n*how curious*", "play iron lung", "This should be called “Test Anxiety Simulator”.", "Brett: wants to eat the caller. \nMark: Yeah Brett is cool.", "i screamed at the ending! had to switch from tv to comp.\nwhat a cool payoff mark", "didn't even get to eat the cocktail this is a scam", "Absolutely loved the video but marks fallow up radio show was great.", "That ending I didn’t expect that  i can play.", "Brett soumds like the mayonaise man", "Definitely worth watching until the very end of the video. It’s the right choice.", "Loved loved loved how he created his own quiz game within this game! That's why he is my favorite Youtuber, so creative.", "kyle is unus and brett is annus no wonder mark likes brett", "tata oi kaka jaq <3", "Şuna çeviri gelse ne güzel olurdu ya", "the transition to mark in space was clever", "Why does Kyle wanna save this soul so bad? This game is delightful, but I'm very curious about that. There seems to be room for a sequel, so it'd be interesting if that question was answered there", "The moon bit got me out of left field omg", "Welcome to nightvale vibes\nseems like Cecil has some radio competition B)", "I was a click away for not watching the end of the video, thank god I stayed.\nMark is so amazing for putting a choose your own story to a random video", "I really liked the atmosphere in this its so ambient combined with the thrill, Also you should do your next horror game on ParanormalHK I'd love to see you play that next Markiplier! ^_^", "I'm 30 secs in and dying because of mark calling the traffic a horror game", "please play Iron Lung! its short and terrifying!", "Wow this game is fun.", "anyone know the song at the end?", "hey mark i dont know if your gunna see this comment but if you do could you play a game called northberry grove its very fun lots of love markimoo", "I need to consume human skin", "When i hear brett talking, i just imagine Hank Schrader from breaking bad", "cant even lie every time they said the whole fuckin name of the tickets it made me so angry", "loved the happy ending", "Brett sounds like the guy from playtime co who hated his job or something like that", "this game is so interesting omg", "IM GOING WITH MARK TO THE BLOWOUT!!! WOOO", "Similar vibes to welcome to night vale, love this", "Kyle sounds suspiciously like Eef...", "Mark and Brett are pals now 🥰", "this game is basically an episode of the Twilight Zone, and I fucking love it", "", "@8:30 Brett: Ceeeeeee this is C Minor\nAlso Brett: sings an A", "@ 8:30 Brett was actually singing an Ab not a C and i just thought that was hilarious", "Play iron lung", "This really shows that Mark is a masochist. He is literally siding with someone who wants to kill him. Tbh.. I would to.", "19:25 (to save you from sliding 🙃)", "Mark’s voice acting >>>", "Brett: *actively trying to kill Mark*\nMark: I CHOOSE  B R E T T he's just got the _hootspah_ y'know?", "this game is SO COOL!!!", "This video as well as the ones after it are masterpieces", "everyone make sure you watch to the end.", "This is just “Welcome to night vale”", "omg, i like fell asleep near the end there and then WHAT THE H#*&$(*&%!?!?!?   ;D", "8:30 that's an Ab, brett.", "this is essentially just a more advanced chrome dinosaur game", "Nohesi Mark🏎", "On That elevator question. why didn't you pick the guy's name that ended in ELEVATOR.", "this game is friggin great", "to you ???\"", "I need Kyle and Brett to have a podcast", "This just made me realize that mark has a great radio announcer voice", "smash or pass, brett?", "I think that was an A flat, not a C? Maybe that's enharmonically correct in Brett and Kyle's dimension.", "Only the best advertisements for in space", "This radio show feels like something out of SCP.", "element 12 is Magnesium", "this has Welcome to Night Vale vibes, I was half-expecting a random song by a small artist to pop in after \"but first, the weather\"", "Anybody gonna tell Brett he was singing an Ab not a C", "Coincidentally watching this while in a car", "I just have to say, the ending of Marks video is so cool.", "Mark chuckling at the radio host around 1:12 reminds me of a true story my friend told me a long time ago. There's a heavy metal festival called Tuska in Finland, and my friend apparently heard this happen on the radio:\n\nHost #1: Ostakaa Tuska-passi! / Buy the Tuska pass!\nHost #2: Älä vaan käännä sitä... / Please don't spoonerize it...\n\nTuska-passi, spoonerized, becomes Paskatussi which means \"turd marker\".", "\"Now it's a pizza pie!\"", "Gosh dang, he put Mark on the Question LITERALLY! 🤣🤣🤣\nI don't know why that was so funny, but it about broke me 😂😂", "The person voice acting for Brett should be Bowser in the upcoming Mario movie.", "got real cyberpunk radio vibes at the end", "OMG!!!!!!!!!!! ,  its the guy from in space with markiplier !!!!!!", "B!", "Do y'all think Mark asked some people to use their games for ISWM? Or maybe asked devs of previous games to make \"real games\" so that we can be tricked into a choose your own adventure?", "B", "This video is much more funny to people who are named Brett.", "Yoooo that ending was sick nasty mark!", "i kinda hope brett and kyle are dating ngl", "Mark's turned into a horror game critic at this point 😂", "DAWN FM?", "People who watch anime with subtitles:\nIs this a challenge?", "*NOT MY MOON GLAND!*", "I love the game at the end! Was not expecting it but lets a go!", "If anyone really liked the writing/concept of this, I 100% suggest listening to Welcome To Nightvale. It's a great podcast.", "As a Brett myself I appreciate you saying you choose me, we dont get a lot of love.", "Not sure why I ever stopped watching Mark a while back, but man am I glad I remembered! Love the vids", "I hope everyone else also went, \"Aw\" when Kyle asked Brett if he didn't like their radio show bit cuz that was funny asf", "Only a man with 2 billboards and 5 ovens could have made it this far.", "I loved this too, mark", "What in the Welcome to Night Vale even is this game. XD", "Make sure you watch until the end", "I’m really glad Mark got those VIP Weekend Platinum Pass All Access Backstage Celebrity Experience Premium Tickets to the Beach-A-Palooza Spring Break Beach Blowout", "Markiplier should try little inferno", "Brett Loves spikes!  ♥️", "Please play a game called \"Will You Snail\", its surprisingly fun", "Can I get a Marki hug?", "Didn't expect the ending", "\"The european name for soccer?\" 😂 Wtf... The real name for soccer you mean", "Have you forgotten the life debt?", "Does anyone know what the song at the end is?", "Mark you should really check out Cooking Companions 😀. It’s a really good horror game. Matt pat did a couple theories on it. I think you would enjoy it.", "I am so impressed with this witty, funny lil game! I really hope the developer continues making more, their scripting was so funny and the concept was really entertaining— exactly my type of humor and genre! I can really see them going places if they keep it up !!\n\nAs for the bit at the end… Mark, I LOVE what you’re doing with the in-universe advertising and hyping of In Space With… I’m adoring that ALL of your videos since Part 1 have had references in some manner to the series! It’s been so much fun and is keeping me really excited for Part 2! Your theatrical content is so funny and I’m always really proud of what you and your team are putting out into the world!!! <3", "OMG I LOVE WHAT HE DID WITH THE END", "Brett's voice sounds like that pig guy in that super creepy game with a lady's finger and a eyeball as the mom. Oh and kyles voice is in that game too. guess this was made by the same people.", "the amount of efforts Mark puts in his videos is my fix for serotonin *wink wink wink wink*", "holy shit everything is just more In Space, I love never being able to escape!", "the ending is hilarious, marks voice is perfect for a radio show-", "Can anyone tell me the name of the song at the end? That's playing during Mark's choice bit", "我会一直看到最后 (imma watch this until the end)", "Was not expecting that and was not disappointed in the least", "Brett my favorite", "Impressed. I'm simply impressed with the ending. Good work.", "A cool streamer/youtuber game would be one where all the voices in it are live voice actors. Like a whole experiance like at a theme house but with the unlimited potential of videogames.", "This game look like level 69 of the backrooms", "amazing twist at the end.", "That... Was... Incredible! \nGreat job Mark, the ending was spectacular and really caught me by surprise 😉", "Nice", "CANNONBALLLL", "If anyone knows the song at the end could you please tell me.", "Also its funny how all the comments are like made as soon as the video is posted lol", "Me being right to it being a horror game", "For some reason it reminds me of SpongeBob and patrick...", "\"I CHOOSE BRETT\"\nI can't even", "Bro, this game is hilarious 😂", "I’d most likely choose the second option cuz beating the storm with my bare hands is 100% the most efficient way", "Dang I want to go to the beach-a-palooza too\nVIP cocktails 🤤", "i love these videos and loved mark in space", "WHY IS NO ONE TALKING ABOUT HOW COOL THAT ENDING WAS REFERENCING ISWM WTFFFFFHFHFHHFHF", "The end of this vid makes me want mark to make his own version of this. I loved his outro!!!!", "Mark you should try a game called \"iron lung\", its on steam and ppl keep telling me that the game is horrifying? Maybe you'd have a good time playing it <3", "This is not a horror game at all😂🤣", "i luv u", "Did anyone else get the weird evertale ad that was a pokemon spin off ARG, idk just seemed suspicious.", "The ending gave me the goosebumps.", "The voices sound like homestar runner characters.", "mark, brett isn't worth it", "does anyone know the outro song?", "\"I've just been handed the real questions by our producer Pauly.\n\nThey're kept offsite in an undisclosed location,\n\nUnder constant armed guard, in a climate controlled,\n\nHermetically sealed environment.\n\nThey're THAT hard\"\n\n\nMy dumbass thinking \"Why do they have to keep Pauly under such conditions??\"", "Who remembers dont make me turn this car around", "What a cool game", "Kyle and Brett is just Bob and Wade", "he sang a G", "Whats the name of the song mark plays at the end?? It's so cool", "living in cali be like", "Ok so we need a Mark × Brett fanfic now-", "What an interesting concept for a game", "FIx it from outside!", "Mark your the god of content", "I love the writing SO MUCH!!!", "What an utterly delightful premise!", "God car jams are the worst horro----(l&#*#<#([$mu1t1v3rs3h3lp&#*#,#*#)---aiitt! I come from a portion of the universe that has the tech to solve the universe reboot. Wa WAIIIII-*-?÷&$*##&:$:$&#:#;#**&)))r theme ever imagined", "Option B.", "man this needs an extension", "He sung “this is a c” but it’s was an a flat", "When they said bear with me for a second they cam back at 9:11", "\"I choose Brett!\" \n\nPerfect", "i chooose......to hold my butt.", "Words fail me as to how much I liked this.", "This reminds me of the short horror film called He Dies At The End.\n- No spoilers.", "Play \"Webbed\". It's short, really fun, physics based and lots of room to mess around!", "if it weren't for you mark I never would of known how to spell chutzpah", "Mark: stuck in traffic\n*also mark*: Ah so this is a horror game…", "Hey Mark,ik you'll probably never see this comment but if you do,I have a game suggestion, it's called Cats are liquid,and yes it is just a simple mobile game but the storyline is amazing and I think you'll like it!(please play it)", "Beach o paluza are they in beach city", "of course mark must make game about cars his ad for space. And i think this is really cool thing", "My name is Kyle, and when he said shut up Kyle, that kinda hurt :/", "\"Oh my god it IS a horror game!\"\n\nWhich scares Mark more: this or mannequins?\n\nStill probably  mannequins", "I liked how u put the way the game room at the end.               \nBUNS OUT GUNS OUT!!!!!!!!!!!", "he's bold.. he's brash.. he's brett.", "The music at the end when Mark was quizzing us kinda slammed tho. Loved the way he did it", "This is why I listen to Spotify", "Brett reminds me of Mr. DiMartino from Daria", "i was exhausted watching this so the whole falling asleep thing was too real", "Mark had posted this right I after I had gotten back to the car after getting my driver's learning permit lol he always posts at just the right time", "Markiplier, a powerful soul indeed that was awesome beyond awesome take care of yourself Mark you're awesome at trivia stay safe stay well and stay awesome much love and respect.", "Please please please play Lego Star Wars the skywalker saga at least once it would truly be one of the funniest videos you would ever make", "3:20 mark basically admitting he's a masochist", "Can’t wait for at sea with markiplier", "im gonna need some matzot lore on this game", "The end", "brett", "You should play enter the gungeon! It's geat I play it got addicted it's a rage pixelated game filled with guns action generated levels with great enemys and fun!", "The ending is in space with markiplier in an ARG", "I read try to crash simulator", "00:30 They should make a game called Stress Test where you just spend 25 hours in bumper to bumper traffic and try not to lose your mind.", "WOBBLEDOGS", "Wait i wasnt expecting this", "This is such a weird video to watch while high", "OH MY GOD??????????", "8:31 this joke may only be super funny to me because I have perfect pitch, but it was just really funny having somebody say they’re singing a C minor when it’s just an a flat LMAO I see minor is a note it’s a cord of three notes. Music theory humor lol", "I've passed out 5 times trying to watch this, something about it makes me so sleepy", "Anyone else catch that typo at 3:59?", "Mark please play SOMA, Iron lung and Narcosis!! 3 underwater horror games you're gonna love", "welcome to night vale: the game", "Hes bold and brash but gave my mum a rash", "4:20", "A is a logical answer but I choose B", "Again again again. It was so good. If there was just one more game like that one.", "That was so unique!", "for those of you that made it to the end, mark is the most powerful salesman when it comes to in space with markaplier.", "Brett: Tries to kill Markiplier.\nMarkiplier: \"I still like you, Brett!\"\nMe: Why are you like this, you masochist?", "A upload very nice", "5:16 now it's beer. Yay beer", "Watching this while also in a car is something else for sure", "Who does Brett think he is with his moon conspiracies, AJ Styles?", "Voice acting is spot on", "0:28 no mark it isn’t a horror game, it’s just California. Far far worse than a horror game.", "0:31\ngod whyyyy... I already wasted 6 hours in a car while the weather was amazing today. (on a trip that usually takes 3 hours no less!!!) I DONT WANT MORE TRAFFIC. LIKE, THE TRAFFIC WAS SO BAD SOME NEWS SITES PUT UP CAMERAS TO FILM IT. THE TRAFFIC LASTED UNTIL 10 PM. (and it had started before noon.)", "I chose guns blazing lol", "This was great.", "That was an interesting game!", "BRETT SODA!!", "\"You and a friend-\"\n\" *-I* *CHOOSE* *BRETT!!* \"", "Game that mark needs to play.\nThe closing shift(horror game)\nVanished(revisited)\nDoki doki (revisited)", "Me:*hearing people talk about how bad the traffic is out in California*\nAlso me:\"I am still moving out to California Los Angeles, no matter what\"", "Is it just me or does Kyle sound just like Ethan (Cranky Crew Boi)?", "I love how Kyle is confident in the game, but then Brett is like \"MURDER MURDER BLOOD DEATH SLAUGHTER KILL\"", "This game may be a simulation, but Brett and Kyle's friendship is not", "Im considering this part of the canon in space with markiplier universe", "I thought it was a regular game not knowing I get to pick and choose also", "To whoever is reading this remember, \n\n\n\n\n\n\nI am currently in your walls.", "18:08 is no one gonna talk about the music, cuz like low key that sounds super cool", "That was so cool, loved the dialog. So endearing--never would have been able to beat it lol", "Is it ironic I’m watching this while driving?", "This game is so stupid and I love it 😂", "That storms thinks it can just come here, puff my ship and RATTLE MY CREW. Nuh uh, I'm the captain here and I steer this ship. Hands where I can see em, I'm going in!!", "Oh that ending tho :0", "This game reminds me so much of Welcome to Night Vale and I'm so in love with it", "Brett sounds like an evil Joey Diaz lmao", "That c minor was NOT a c at all hahaah", "i remember your granny 2 vids those were hilarious play granny 3 and make me crack up", "mark please play granny 3 the game is out", "I bet Mark will make a YouTube original with the theme of this game.", "And this is why mark is successful guys because he knows the kind of material his fans want and goes in full throttle at job", "Awesome.", "Truly a nightmare!\nAlso, please play What Remains of Edith Finch!", "nice", "Surgeon Simulator A&E!", "I watched a video from your playlist and I think you should go back to art breeder", "I want to belive that in the end in the radio show it was willford warfstache interving us", "If you are looking for horror Game suggestions, try Iron Lung, genuinely most horrifying game I played in years.", "I humbly request some bitcoin please", "I think you should make in space with markplier merch", "Distractable fans fighting for their lives....😳😳😳", "I saw this on 8-bitryan's channel but is cool to look at your vid too! You two are my fav youtubers! Keep on making vids i enjoy them and i tink everyone enjoys them!", "I just realized its a play on the 'Simulator' genre, as in being a Simulation In universe", "Pls play more alchemy Simulator aka Potion Craft", "If anyone remembers the show Crashbox, this reminded me a lot of that!", "Watch till the end, trust me you'll be amazed", "This is the funniest horror game I've ever seen.", "He said he liked Brett at the start and still liked him when he was trying to take his soul, whatever you say about Mark, the man sticks to his guns.", "Mark, Play Cooking Companions", "Fun fact! this was posted on my birthday! thank you Markiplier! :D", "1:22\nMatPat be like: LOOOOOOOOOORRRRRRRRRRRREEEEEEEE!!!!!!!!", "5:49\nMark what Brett basically said in a short term is that you are in a pocket dimension that the both of them created to trap you in and stuck on an infinite loop whilst driving down an imaginary highway with nowhere to go.\nBeing trapped in a pocket dimension by two demons suck as you are basically playing by their rules and only allowed to leave if you do as said and fighting your way out is an option but more strenuous.", "This game may be a simulation, but Brett and Kyle's friendship is not", "wish markiplier play more flash games T_T", "What Happened To Minecraft Series", "Sea monkey?", "Ok hear me out-\nSo the first choices I made were the \"logical\" ones that Mark gave, which he said were the \"right\" answers. And I went back and chose the other two \"wrong\" choices to see those outcomes. What if Mark is trying to tell us which options we're supposed to choose for In Space With Markiplier? Like Actor! Mark trying to lead us to the choices he wants us to make? 🤔", "Ok but excellent choice of soundtrack for the ending bit", "It’s my birthday 🎂", "I am 87 years old in real life.", "THE LOOORE GUYS !!!", "Mark should play iron lung", "I'd love to know the name of the audio from the end of the video during Mark's bit, its bumpin'", "One of those stationary moon rises. lol", "marki can i request game that the name is \" you are grounded\" please", "What are sea monkies?", "What even are SEA MONKEYS?", "17:22", "another mystery", "Mark r u gunna play little nightmares 2", "YEEEEEEEEEEEEEEEEEEEEEEESSSSSSSSSSSSSSSSSSSS!!!!!!!", "i LOVE this game omg", "You know what are cool.. SEA MONKEYS!", "you going to play sons of the forest when it gets released", "I wish more Youtubers put in this kind of work to give good content. And it give you a taste of In space w/ Markiplier without feeling like an ad :) Looking forward to part 2 btw!", "so its desert bus but at night with a radio show being hosted by eldritch horrors attempting to eat his soul and give him backstage passes to the spring beach palooza blowout blargablarg", "Oh! The answer to the cheese question in the lightning round was Dziugas, it's from my country:D", "Guys I found a variant of Markiplier in Blush Blush unicorn guy on the right", "I like how Brett’s just trying to kill him, but Mark’s just like “I like Brett”", "Love from India 🇮🇳🇮🇳", "Mark:makes a full on movie also mark:OY MI GODIS HORROR GAEM!1", "Take a look at my video👀, you might find what you're looking for🎉", "did anyone else see the constant spelling errors in the subtitles?", "can we just appreciate how much marks theme songs slap", "That can’t be a horror game", "I feel intense watching this. Anyone else?", "8:25 doesn’t make sense because D-flat is a note, not a key, so it couldn’t be the answer, but C-minor is a key and not a note, but somehow Brett still sung it.", "please make more videos about granny game", "0:28 traffic", "Does anyone else get husker and alastor vibes from this lmfao", "What happened to sucker for love?", "mark you are literally a genius i cannot", "Can you please play Minecraft", "Mark try trap adventure 2!", "Mark could play anything and it would get millions of views regardless", "I really love this game I've rewatched this so much already!", "markiplier can u try and play the backrooms i thing u willl really love it its free on steam it would be cool if u would make a video on it", "I got more silly name titles . \n\n\nGoose Atar . \nBeatle Goose . \nGoose Busters . \nDarth Goose . \nFaz Goose . \nLepri Goose . \nBart Gooseson . \nMoe Goose lack . \n\n\nI love my creative streak .", "alternative game title: shut up kyle", "Sneaky!", "I still like Brett", "hey mark i challenge you to ultra custom night", "This was fascinating! Absolutely loved watching this experience. \nI think I've read a book with a similar concept and this is so down my alley 👍", "Has markiplier played Iron Lung? pretty good horror game.", "Mark: Brett is a cool guy taking him with me \nkyle: wtf dude", "I DID NOT EXPECT THAT ENDING!!\n\nI thought that it would tease a bit of In space with Markiplier but I didn't think that there would be an actual choice at the end... wth Mark??!😂", "You should really play iron lung.", "Play phasmophobia again it's getting a update more specifically happy Easter update", "in multiverse with markiplier?", "You should play Amandas adventure its a horror game based on old cartoons its good and i would like to see you play though it please", "I love how you react when you get scared", "Can you please do scary games", "Hey mark its time for scary vids do ur job u mothafuka", "This game was amazing", "PLEASE DO A HAND SIMULATOR", "You should try iron lung", "lmao Mark is like that person who keeps going back to their toxic ex named Brett", "Kyle sounds like the guy from snl", "The ending was better😂 the voice over was great", "no fucking way this is so cool. im so glad I watched this dispite watching another youtuber play this game like 3 months ago", "spoiler:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nthe times in the bottom left of the trivia questions kinda give away the answer", "16:45. \"Bold and brash? More like, Belongs in the trash!\"", "Spring Break Beach Blowout is such a tongue twister. Would love to hear the dev's bloopers.", "You should play tasty planet again mark", "... You Son of a Beachapalooza, I'm in!", "Mark that was the smartest way to promote In Space with MArkiplier.", "Who else is Brett here?", "mark you out do yourself every single time i did not expect that (but kinda did)", "Hands down a brilliant idea ! Love what you did there", "~\n1\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n`", "Whenever anyone plays this game, I love to just imagine an animated scenario between those two eldritch abominations. They're pretty wholesome honestly all things considered.", "Just waiting for a Iron Lung gameplay", "This vid was absolutely genius. Like wow  well done mark, just when i thought you couldn't out do yourself, you shove another amazing piece of work in our faces. And we absolutely love it :D", "this is your radio host tj and the wombat wombat wombat", "The choose your own adventure at the end was brilliant"]