["el sonido del final es re Señor de los anillos!!!!", "PIKACHU FUMA PACO", "Pikachu fuma paco", "PAPOOOOO CREO QUE HABRA UNA SEGUNDA PARTEEEE OSEAA ME LO CONFIRMASTE AHORA POR QUE TIPO ES RARO LA ULTIMA PALABRA PERO EN UNO DE LOS ADELTANTOS DE BIZA EN EL DE ELADIO HAY 2 #23🤨", "Bajito", "alguien se dio cuenta que el aire esta en 23 grados?", "Déjate de joder papo, escúchalo devuelta 🤦🏽", "Despega2", "Pikchu fuma pko", "Picachu fuma pan jajajaa", "Pikachu fuma porro", "Pikachu fuma paco jajajajajajajajajajaj xD", "En mi opinión dice \"con carpa\" porque esta sesión la grabó en el 2020 cuando todavía estaba prohibido legalmente que grabarse canciones por el tema de Big Leagas, no porque vaya a haber una 2da versión.", "Es buenisimo, el expresa lo que siente, ese final fue emotivo, sacó lo que sentía y verle las lagrimas ufff.... hasta el cora", "que god, el tema habla de lo que le pasó hasta ahora y en los cambios solo demuestra que lo que es capaz de hacer y de lo que se viene próximamente porque saca en cara que sea cual sea el estilo puede hacerlo sonar bien.", "Pikachu fuma paco", "Sos un crack jaja", "Creo que papo tiene que escucharlo 2 veces", "Pikachu fuma pako😎😎", "pikachu fuma paco", "Pikachu fuma Paco Papoooo!!! El tema está bien... tiene un par de cositas, al estilo vos mencionaste la de \"huevó\" (puesto con acento xq así lo menciona) pero está bueno. A mi me gustó el contraste entre el vocal del estribillo y más picante en en el resto. El beat igual, bestial... invitaba a tirar bomba", "Es un buen tema sin duda,pero muy sobrevalorado,se tenía que decir y se dijo,deja mucho que desear🤷", "El mejor Paulo sin malas palabras 😎", "Pikachu fuma paco. \n\nPensé exactamente lo mismo que papo cuando paulito dijo lo de \"Con carpa\" al final, a lo mejor el siguiente tema de Paulo es producido por Biza o algo de eso tienen planeado, o quizás solo estoy flasheando cualquiera. XDDDD", "Lo he escuchado mil veces en 3 días y cada ves me gusta mucho mas... Que crack es Paulo... Man... Buena reacción papo, la mejor de la plataforma bro, de frente mar...", "Me parece una cagada. 0 contenido. Todo por apurado. La cagaron re mal", "pikachu fuma paco", "Che bro y pa cuando la tuya ???? Esa tambien seria mil esperada", "pikachu fuma paco", "Paulo es Paulo y cualquier tema que saque va a estar zarpado sea el estílo que sea wachoo", "Totalmente de acuerdo con la reacción, estuvo bueno pero le dieron mucho palo antes", "Jajaja Pikachu fuma Paco", "A mi abuela le encanta contenido mira todos los vídeos que subes te ama", "Pikachu fuma paco", "Que Pikachu, vos fumas paco", "lo que sea es un temazo y paulito la pega durísimo 🔥✨", "Se ve el varo mi papolin🥶", "Es un tema re personal sobre él , hace de  cuenta que le sale del alma temaso !!! Das todo Paulito!!!! ❤", "pikachu fuma paco", "Creo que esta session ea para escuchar la letra y dejar el beat en un segundo termino, le tira a los que quisieron acabar con su carrera, su historia tiene tela.\nA mi me a encantado", "PIKACHU FUMAPACO clarísimo", "PIKACHU FUMA PACO!😮", "pikachu fuma paco", "Una verga el tema amigo", "Cuando dijo gordo avaro todos los gorditos nos identificamos como Papo", "y ka sesión de Papo? 😅", "Enverda no me importa la historia de paulo y esa canción es una basura.", "Pikachu fuma paco", "Pikachu fuma paco", "pikachu fumaba tabaco :)", "Pikachu fuma paco", "Sos un crack papo!!!! Vine a ver tu reacción por que sos el más honesto, y siempre pones palabras a la sensación que me Dan los nuevos temas", "Pickachu no fuma mas pako y esta en rehabilitacion", "Que haga un bizarrap con raperos gansta estilo alemán más rap gansta menos comercial mucho reguetón", "Jajajajaka que sesión tan más 💩💩💩", "pikachufumapaco", "Exacto, toda la propaganda que le hicieron lo convirtió de poco a poco en alguien sobrevalorado.", "PIKACHUUU FUMA PACO", "3.000", "Aczino vs dizaster", "Todos esperaban un Adán y Eva. Que pa rompa toda. Pero creo que está sesión va a ser un antes y un después en Paulo, ya 3 temas y en 2 se descargo demasiado, ahora va a comerse el mundo asheeee", "Pikachu fuma paco", "Pikachu fuma paco XD", "Creo que esperaba más que la de René calle 13 y no fue mucho mucho menos", "Creo que esperaba más 😂😂😂😂", "Estoy super esperando la reacción a la batalla de aczino", "Una session para el neo faltaría", "Hablas de tener \"la mejor videoreaccion\" vamos que la gran mayoría de ruiditos y testigos están exagerados... 🤦🏻‍♂️\n\nPor cierto Papo que te paso con esa dieta que hacías? La cosa era sacarle los subs a Ibai y luego te dejaste... como fue?", "hay sesiones de bizarrap en las que papo explota en sus reacciones, y eso contagia a uno pero como el mismo dice, se vendió mucho marketing, y todos esperaban que sea un tema que sea un boom internacional, sin embargo en su propia expresión se ve que el esperaba lo mismo que todos nosotros, sin embargo el tema es bueno pero no hay un momento en el cual la canción explote o haga un estribillo pegadizo, al parecer eso era lo que quería la gente, aparte de eso los altísimos niveles de expectativa que uno mismo se idealizo. En fin, es un buen tema, habrá gente que y otra que critique, solo disfrutemos:)", "pikachu fuma paco xd", "es malísimo este bizarrap", "Grande Pablo concha", "Pikachu fuma paco", "Pikachu fuma paco", "Cuando reaccionas a la batalla de aczino en dos idiomas????", "A mi me gusto mucho", "Tibio, si va a sacar un disco entero para expresar su sentir de los años off estará meh más que nada por cumplir tendrá la views que merece", "Pikachu fuma PacoMC", "La canción igual se entiende que es para los 🔺 y que pudo salir de ahí\nQue no se vendió y que no le importa lo que digan de el. Vamos Paulo 👋👋👋 \nGenio", "Pikachu fuma Paco🧐", "Para hacer eso hermano.  Hubieras visto la serie rey ... muchos esperábamos tu reacción y nos cag....", "Pikachu fuma paco", "Hola papo crack.puede ser que alla una segunda parte si mal no recuerdo el album de figuritas del triller, no me acuerdo que sesion era pero la 23 tenia 2 espacios", "Picachu fumapacoo!!", "Claro la espectativa fue mucha. Pero hasta ahora la mejor session es la que hizo con residente.  Ojala haya otra session con residente.", "No pasa nada, puedes decir q es una mierda 🤣🤣🤣", "Pikachu fuma paco.", "Pikachu fuma pakoo, grande papo.", "Un grande Paulito y igual ahí 2:31 no se refería a iluminado de los jiles esos iluminatis, por lo contrario si a iluminado como Buda papa.", "PIKACHU FUMA PACO ! 🤯🦁😜", "Me representas papo", "Quizá viva debajo de una roca, pero ni se quién es ese ni me gustó su temita", "Pikachu fuma paco, siempre lo supe", "Pikachu fuma paco 🤣🤣🤣", "pikachu fuma pako", "PAPO  si queres ver algo parecido al fri con humor... Cuando andes aburrido mirate, CONTRA PUNTO PARA HUMANO Y COMPUTADORA está muy bueno.", "sabemos y sentimos la escencia natural que nos transmite Paulo en esta y todas sus canciones, Paulo Londra es el mismo y lo está demostrando ahora", "Paco fuma pikachu", "Con carpa bars", "Te amo Papo, gracias por siempre sacarme una sonrisa, impresionante el no dejar pasar tiempo y grabar como pudieras la session, como seguidor, se aprecia mucho 🫶🏾🫶🏾🫶🏾", "Picachu fuma paco 🤟🏻🤟🏻", "No me gustó me defraudó", "Este salame lo bardeo en una batalla de fms a paulo y miralo ahora haciendo plata reaccionando a sus temas", "La canción es buena por qué paulo saca todo lo que sintió en todo este tiempo y ahora sacarán las buenas músicas❤️‍🩹", "Papolin reacciona al vídeo de aczino vs dizaster porfa🙏", "Pikachu fuma jaco", "Pikachu fuma paco", "Muchas veces he dicho que no me gusta la actitud de Papo en las batallas, porque se deja llevar por el ambiente de las mismas, pero siempre es súper parcial y honesto en sus devoluciones, pienso que sería un buen jurado y espero no cambie eso, de verás...", "Coíncidi con vos papo Mc", "man tienes que reaccionar a la batalla de aczino vs dizaster hasta hizo una rima en tu nombre", "Pikachu fumapaco xd", "No hay ni que pensar en el hype que trae detrás, aún ignorándolo, si lo comparamos con lo que ha venido haciendo Biza, esto en mi opinión queda muy normal, un poco flojo, no tiene nada que haga punch; No es divertida, atrevida, novedosa.. Como que es dificil ponerla en una categoría porque está muy gris. Pero bueno, tampoco es mala.", "Una de las sesiones más personales, creo que fue un desahogo para Paulo, y que decir de la base y ese final, excelente!", "picachu fuma paco", "Jamás me imaginé que sería algo así, está cargado de mucha emocionalidad, se siente un dolor, una madurez, me gustó la cumbia que le metió bizarrap, algo muy Argentino 👏👏👏👏", "Después de  la sesión con residente es dificil  ...juzgar otras", "Racciona a aczino vs disaster porfavor.", "El tema esta re facha perro pero todos esperavamos mucho mas xq hicieron un es escandalo q iba a ser el mejor tema de la historia pero hasta el bzrp de louta le gana jajjaa", "Pikachu fuma paco", "Picachu fuma paco jajajjaa", "Papoo vos fíjate cuando dice Paulo londra al principio con letras no salta el número 23 como otros tema que salta el número, estoy viendos recione y ninguno se dio cuenta", "La musiquita del señor de los anillos la.rompe", "Vamoooos Paulo ❤🦁", "vaya mrd la session 23 deaaaa la mejor session", "una de la sessiones más sobrevaloradas alch", "El bits esta bárbaro. \nPero después de la lírica de Rene, todo va a ser difícil. MI humilde opinión.", "sos un grande papo querido, bandiciones!!!!", "ufffff temon", "Pikachu fuma paco", "Nombre del corte de pelo de papo porfqssss???", "Todos esperando algo parecido ,para corear pa divertirme pa divertirme", "Nada fuera de lo común ,,una más ,número 23,,", "Pikachu fuma Paco", "Es un temazo si entendés lo que quiere decir para mí fue una muy buena session, saludos y Pikachu fuma paco", "Pikachu fuma Paco", "papo el capo que lo mato en un rato con el bato y soy cato y hay mas rato XD nada mal solo rimas xd no c son las 3 am y no c creo que todos nos ponemos pendejos a las 3 am ajajajaja", "Colavoracion con lit o wos y trueno", "PICACHU FUMA PACO 🎶", "Pikachu fuma paco :D", "picachu fuma paco", "Papo SOS un crack saludos desde Tres Arroyos", "Zzzzzz", "Pikachu fuma paco", "πkchu fuma??????", "Pikachu fumapaco", "Pikachu fuma paco.\n\n\nYouTube. Me obligó el Papo", "Excelente tema! Te llega al alma, se merece lo mejor Paulo! Es un deleite! Buenisima reaccion! Saludos.", "Pikachu fuma paco, papista de papo sisoi", "Esperaba un alto flow, pero muy básico, la vistas son por las espera de los fans, hasta el gordito no se emocionó tanto con el tema.", "Picachu fuma un Kojima", "Totalmente de acuerdo contigo", "Pikachu fumapaco", "No me gustó", "picachu fuma taco", "Pikachu fuma paco ...... Para cuando PAPO || BZRP Music Sessions ??? ....", "PIKACHU FUMA PACO AGUANTE PAPO", "Además del con carpa, paulo hace este gesto ✌️en el minuto 2:22 después de decir  \"nunca hice lo que hacen\" , posiblemente da a entender que habrá una segunda parte, sea lo que sea es un temazo y paulito la pega durísimo 🔥✨", "Jugo el gordo pikachu fumador de sustancias obtenibles en la villa", "Paaulo grande lirica, crack Biza, tomando de base a the eye of the tiger, y creo esa obra maestra de beat. Artistazo", "Pikachu fuma paco xd", "Papo reacciona al wilmer roberts manopilio porfaaaaaaa", "Pikachu fumaporro", "Para cuando la Papo session?", "Muy buena Papo, saludos desde Peru idolo", "pikachu fuma paco", "El paulo es unico canta y cme chicle a el mismo time", "Solo le doy Like a tu Video Xq Siempre que escucho que Paulo, la Rompe, pero Pareces Bldo frenando el Video 25mil Veces Amigoo", "Te hubieras esperado papo! Paq hubieses reaccionado como tú esperabas, en general tienes razón! Esperábamos algo más bomba! Pikachu fumapaco 🌿", "Pikachu fuma paco", "La número 1", "ME copo pero pikachu fuma paco, CON CARPA", "Pikachu fumapaco", "GRACIAS PAPO POR REAXIONAR A el bizarrap X paulolondra y bueno gracias y paulito siempre activo mi rey es un idolo de argentina y siempre representandonos paapaa 🇦🇷😁❤❤❤😎", "Pikachu fuma paco", "que pedia que comenten el papo jajajaja", "Pienso que es un tema increíble más alla de lo personal de Paulo londra quiso descargar todos sus sentimientos y lo hizo la gente esperaba algo comercial pero el panorama cambio y creo que fue exelente de que te cambien las cosas porque no todo el tiempo el mismo artista va hacer lo mismo ya la gente sabiera con que ritmo o con que stylo viene y creo que nadie se espero esto más que habla de su polémica en lo que le ocurrió y eso es lo que se aprecia creo que cantó lo más real y transparente y sobre todo que biza guardo esa sessións y no se la dió a más nadie eso es confiar y creer alguien de su tierra con ese gesto Paulo rope el dicho de que nadie es profeta en su tierra", "Picachu fuma paco", "Picachu fuma paco", "El aire acondicionado está a 23 grados", "Pikachu fuma paco", "Pikachu fuma Paco", "Pikachu fuma paco", "tiene razón, no es el hit del verano... pero tampoco esta mal. Ahora que Paulo esta sin bosal, lo vamos a ver de condimento en cualquier sopa🍜", "Enseña a rapearano da consejos pa mejorar\nApoyos\nSaludos!!!", "pikachu fuma paco jajajajajaja", "Que chimba ver al parcero Paulo feliz. Se siente el desahogo de todo lo que vivió! Puro fuego Paulo! 🔥", "Papo, mi personaje favorito del freestyle", "Estoy mas que seguro que sacara dos sessions tipo kinder malo lado b y a", "pikachu fuma paco", "Pikachu fuma paco ndahh", "pickachu fuma paco", "Pukachu fumako", "Grande papo", "Una porong.. Tema mucho humo..", "pikachu fuma paco jajaja", "Pikachu fuma paco garchando al gordosaurio", "Pikachu fuma pacooo!!", "Es de regular a buena, pero me quedo con la Session 49 con Residente.", "Pikachu fuma pacu", "pikachu fuma paco", "Pikachu fuma paco", "super personal la session, y para todos y todas las que nos caimos alguna vez y nos volvimos a levantar, esta buenisima loco!!!", "Paulito es un dios", "Pikachu fuma paco!", "🇦🇷🇦🇷🔥🔥🔥🔥", "Pikachufumapaco", "Pikachu paquetito", "AMO A PAULO Y ESTE NO ES UMA PARAQ LA GENTE BAIL ETC COMO YE CREO SE ESPERABA A MI ME ENCANTO PR QUE TIPO E DESAHOGO", "Pikachu con carpa", "pikachu fuma paco", "Pikachu FUmA paCo", "Muchos no han entendido que es un tema personal a todo lo que pasó Paulo, tira barras a lo de Big ligas, menciona la plaza por el quinto escalón es un tema muy personal, en mi opinión me pareció espectacular la session, yo cuando la escuché tuve la piel de gallina todo el tiempo por lo mismo que sabía que era personal y me encantó verlo ahí después de tanto tiempo de espera y verlo feliz, en opinión es de las mejores y para mí la número 1 pero bueno solo esperemos más temazos de Paulo que volvió para robarse toda la escena!! 🦁🇦🇷", "Amo el compañerismo de la escena argentina como se apoyan por eso están donde están conquistando al mundo y me emociona ver a paulo mirando a biza diciendo me esperaste para la sesión 23", "gooddddddddd", "mu sobrebalorada esta sesion", "picachu fuma paco", "Con carpa estaba llorando papo", "Alguien que explique lo de *Con carpa*", "Picachu fuma paco", "Pikachu fuma paco", "Fuerte Épico,pero no el mejor de Bizarrap,más personal.", "Pikachu fuma pago\noh palo no se xd\nalto kpo papoo", "pikachu fuma paco", "Y", "Pikachu fuma Paco", "Y bueno papo mala reacción no x q no te gusto sino x q sos como los otros , esperan otra cosa", "Una cagada...", "pikachu fumapaco", "pikachu fumá pako", "A mi parecer la sección está buena, pero tenía la sensación de querer algo más agresivo,y entiendo que ahora el no se puede poner a tirar fuerte ,para evitar líos pero está muy buena 😎", "Pikachu fuma paco", "Escuchandolo de vuelta está chill ,pero ojalá vuelva a su prime este artista , en la parte del rap no me gusta el flow tanto pero vamos paulito", "Picachu fuma Paco jajajajaj grande papo", "🔥🔥🔥", "Pikachu, fuma paco", "Queda la de Myke Tywers, luego la de Wos, luego Quevedo y luego J Balvin... Acuerdense de mi....", "Pikachu fuma paco!!", "pikachu fuma paco", "Papo reacciona a sweetpain vs Sara socas por favor. Like si quieres que papo reaccione a esa batalla.", "Esperaba mucho más del tema también, peroo me alegra que paulo sea libre musicalmente", "la esperanza nunca se pierde cuando hay talento solo se necesita paciencia", "Afeitate hombre😂", "papo gracias por seguir!", "Una canción con base de reggaetón mas", "Pikaxhu fuma paco", "pikachu fuma paco", "pikachu fuma paco", "Pikachu fuma Paco ... Increible Session y mas sabiendo el contexto de Paulo Londra ... cracks todos los raperos argentinos sin duda y mas aun la gente de las plazas que se tragaron su ego y su arrechera para aplaudir los pasos de estos genios", "no esta a la altura", "picachu FUMANDO PORRO con carpa", "picachu fuma paco\n\n\n\n\n\nleones con floOoOw\npau lo on daraAaAaA", "Falta la segunda parte de la session 23", "PIKACHU FUMA PAKOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO", "Pikachu fuma paco", "PIKACHU FUMA PACOOOO XD", "pikachu fuma paco", "Al principio a mi sinceramente no me llegó mucho, estuvo bien pero ahora escucho y escucho y escucho y me va gustando más mm", "Estas mal mechaaaaaaa", "PIKACHU FUMA PACO", "Esto sin duda es un claro ejemplo que la mafia de la industria musical NUNCA ganará contra la “VERDAD”\nA este muchacho lo trataron callar \nPero no lo lograron \nVolvió y volvió más fuerte que nunca 💪🏼 \nEsto es música ✨\nSolo los verdaderos fans de Paulo nos emocionamos y se nos erizaron los pelos de emoción 🥹", "Groso el Papo 👏 👏  , igualmente  escuchado un par de veces más,  a mi en lo personal  me paso lo mismo , mucha expectativa ....pero luego pensé y dije , estamos esperando a Paulo Londra  no al Biza , el junté esta bueno por que el biza le da un plus a todo , pero Paulo esta en toda su escencia,  descargando  un poco de lo que tiene guardado , el León está despertando de a poco , aún falta para su gran rugido ......y será épico!!!!", "Papo cuando sale tu bzrp ?", "pikachu fuma paco", "No justifiques que no te agrado por no querer recibir malos comentarios...estuvo chida pero nada de el otro mundo x.", "Paulo es buena cantante y todo , pero la música a mi parecer no me gustó , prefiero la de René , a mi parecer , me gustan más las otras músicas de Paulo , a mi parecer ❤️", "Estuvo bueno pero el ritmo estaba bueno. Pero yo sentí que faltó poder xd pero según el contexto estuvo bueno", "Realmente bzrp tiene mejores sesiones, paulo no fue lo que se esperaba para que lo pusiera en la numero 23", "Bro no se cómo hay gente que dice \"que decepción\" , pero es que los que dicen eso se acostumbraron a ver algo más comercial,esta session es la mejor de lejos, algo más personal, más profunda,más orgánica,más natural, ES UN TEMA QUE REPRESENTA A MUCHOS, PALO MUNDIAL 📈✈️🤯🔥", "Buena reaccion, pikachu fuma no se que chucha, no entendi jajajajja saludos desde Chile", "Un blanquito iluminado jajaja se mamo jaja saludos desde Nayarit (Mexico)", "Es bueno volver a ver a Paulo y pensar que era criticado por ser un músico comercial, sin embargo, fue el único que empezó con su propio estilo.", "no es la mejor sesion ni a palo hay muchas mejores", "upa x2", "Pikachu fuma paco", "pikachu fumapaco", "Bien papo estuvo muy bueno lo que dijiste el tema está bueno , está fino tiene flow pero si quizá le faltó cambiar la temática ... Tipo repitió muchas veces los mismos coros quizá faltó un poquito más de cambios pero bien ahí bzrp", "Es una mierda amigo,se esperaba algo así como como tal vez,pero se conforman por qué ya salió", "PIKACHUUU FUMAAAA PACOOO", "pikachu alto fisura", "El tema q con el q la selección tiene q entrar a cada partido de este mundial perro", "Falta el papo bzrp", "Cuando dice Paulo Londra al final lo dice con arto sentimiento 🔥", "Pikachu fuma Pacooooo!!!", "Papolin cuando la reacción de aczino y Dizaster ???", "Pikachu fuma Paco", "Aplaudo  y apoyo a artistas asi únicos que hacen la suya original  y noas de lo mismo.. esto a mi gusto 🔥🔥🔥🔥🔥 aguanté Paulo ❤️", "Pikachu fuma Paco", "pikachu fuma paco", "picachu fuma paco", "Pikachu fuma paco", "Pikachu fuma Pako! jajajaj", "Me encanta el mood de este tema amigo muy epico, buen estilo yankee bien zarpado amigo. De mis favoritos de paulo", "Re exagerado", "Papo demaciado argentino. No reacciona a temas que son muy buenos como me arrepentí. Y habla solo de sus amigos", "Una porqueria esa sesión", "pikachu fuma paco", "Picachu fuma paco", "PAPO  FUMA PAKOO!!!! PEDAZOOO", "Pikachu Fumapako :P", "Pikachu fuma paco", "No hagas más reacciones así desde la cama fue una poronga!", "Pikachu fumapaco", "Exelente este bisa es un groso y Pablo un distinto", "Para mí cumplió la espectativa con lo justo \nPero es obvio que los que no conocen sus inicios y todo lo que le tocó pasar en el medio con complicaciones legales, así que quizás los que no están siguiendo o los que no tienen contexto no lo van a entender o les va a parecer lo mismo que a vos o peor", "Para mi cumplió con las respectivas !", "Bien fue más expectativa que otra cosa no es malo tampoco es bueno", "pikachu fumapako", "No es la gran cosa", "Pikachu fuma paco , me encantó la reacción 👏", "El aire en 23", "Pikachu fuma pago!!!\nJAJA creo que así era, pero me encanto el tema amigo!!!🔥🤯", "23 millones de comentarios para esta poronga autotuneada? Dios mío que mal de la cabeza está la gente", "Sonidos épicos a lo Braveheart!!", "despues de dos años sin poder cantar... me parece epico", "Pikachu fuma paco", "Porque si se meten en la descripción, donde pone música, pone canción 1 de 2?? Se vienen cosas???", "mugre vs ssn 23", "Lo escuchas 3 veces y ya es un temazo", "Pikachu toma agua", "Pikachu fuma paco", "El aire acondicionado está en 23 !!! Las trompetas de la película rocky en la canción de pauloooo, el abrazo de biza a Paulo me emociona porque no lo hizo con ningún otro artista, es una canción muy especial para los fans y muy personal para paulo", "No entiendo que esperaban las personas que dicen tener las \"espectativas altas\" qué querían que la canción volará? O que tuviera super poderes? 🤦🏻‍♀️", "pikachuuu fumaa pacooo paaaapooooooo", "Pikachu fuma Paco :v", "Culerisimo", "Biza tendria que desaparecer por unos meses ya se le nota el Humo de esas sesiones ..... \nPuro like y tendencia \nAl final era verdad lo hacen pa  divertir$e ....", "Es muy malo para estar imitando alos puertorriqueño", "pikachu fuma paco", "Pikachu fuma paco", "Pikachu fuma Paco", "despegado el pibe el uno , volvio con todas", "Pikachu fuma pacu", "Paulo hablaba de big ligas en la canción tiene sentido", "pikachu fuma paco", "Te falta la reacción a la canción del wosito pa:(((", "Grande Pablo", "Pikachu, fuma pago", "yo creonque estamos acostumbrados a la musica que sienpre hize paulo, esto es diferente. es algo nuevo para el y para todos.", "pasa que vos no tenes corazon papo", "Pikachu_fuma_pacooooo 🤣", "Pikachufumapalo", "Pikachu fumapaco xds", "pikachu fuma paco, pero el perfume", "picachu fuma Paco", "Es la pisca de algo que apenas está empezando ✨", "pikachu fumapaco", "El único que tira la posta!", "Pikaaachu fuma pacoo con papolinnnnn", "Papo me parece muy lamentable aun no tener la reaccion de aczino vs el desasres. Que mal de tu parte. P.D te amo pensatelo", "Picachu fuma paco", "PIKACHU", "Por qué no dijo BIG LIGAS AL FINAL 🤑🤬", "Recién me doy cuenta que dice con carpa, y eso que la escuche como 20 veces.", "Me gusto mucho el tema muy bueno, en otro tema papo cuando reaccionas a dizaster vs aczino", "Picachu fumapaco", "Las reacciones de papo son las mejores, son sinceras y con cariño. Te queremos papolin", "Buenaaaa IBAIII CRACK boe", "Necesitamos tu Sessions PapoMc! Para cuando???", "PIKACHU FUMA", "PIKACHU FUMA PACO jajsdkashda :3", "Muy bacán decir en donde estás Papo, y que significa me hace ruido? La peor reacción que ví, la tuya.", "Picachu fuma paco", "Tu reacción fue la mía. Fue un tema okay, pero nada wow, para el hype.", "La cargaste… No debiste reaccionarla sin audífonos 🎧 fin..", "Pikachu fuma papo", "Pikachu fuma paco :v", "Blanquito iluminado frase de René 😂", "pikachuu pakeroooo", "Para cuando tu session con biza papo", "isa", "Por qué los youtubers ponen tanta cara de idiotas en las portada de sus videos??", "Estaba esperando que reaccionaras porqué siento que eres de los pocos de lo que sabe lo importante de esta session.\n\nPostd: Pikachu fuma pago", "NECESITO QUE REACCIONES A LAS NUEVAS BATALLAS DE REPLIK PORFA", "Pikachu fuma pako", "escunchenlo 3 veces y va a ser el mejor del tema de su historia", "Un diferenteeeeeeeeeeee el unico que escuche opinar asi, muy concreto y directo", "Pikachu fuma paco", "Es un descargó! Y es tremenda canción !! Piel de gallina me encanto", "Pikachu fuma bastante Paco", "De acuerdo con Papo, fue bueno pero no increíble.", "Picachu fuma pako jajaja", "Pikachu fuma paco", "Es todo un tema de desahogo, muy duro", "Pikachu fuma paco", "Picachu fuma Paco 😂", "Alguien me explica lo de \"Con carpa\", qué significa?", "Pikachu fuma paco", "acuerdense que va a haber otra session que va a ser la original que hizo", "Picachu fuma paco!!!!!", "2022 年 5 月 2 日 -", "Miren el aire acomulativa", "Pikachu fuma Pacooooo", "Pikachu", "Pikachu fuma paco, te amo man", "pikachu fuma pacoo", "grandes efectos caseros te mandaste Papo", "pikachu fuma paco xddd", "Pikachu fuma paco", "papo fuma pikachu", "pikachu fuma paco", "con carpa le tiro al duki", "Me dieron ganas de llorar de la emocion", "Pikachu fuma pakkko", "Sabes cómo agrego esta canción a la playlist de mí corazón???? La escucho como un Pikachu fuma-paco", "Tema 6 puntos. Hace ver a la sesión de Chuky o de Eladio un 8 y a las de Naty y Snow un 10. Solo los Fanboys creen que es excelente.", "Que raro que no exageraste papo", "El 26 de abril de 2024 voy a venir a comentar en este comentario diciendo que logre mi sueño llegando a grabar con artistas de alto nivel en el genero urbano y que las canciones que tengo en mi canal tuvieron mas reconocimiento que el actual, saludos y bendiciones para quien lea esto 🙏🏼🤍", "Esa base la uso de la resistencia que fue bzrp", "Pikachu Fumacapo 🥸", "Papo es único, se monta un estudio rápido, medio dormido, con camiseta de garfild y en calzones y más de medio millón de personas viéndolo", "Pikachufumapaku", "Pikachu fuma paco", "Ojooo mepaaa que pronto saldrá la sesión de duko", "Se dieron cuenta que hasta el aire acondicionado tiene el #23 XD", "pikachu fuma paco :)", "pikachu fuma pako reacciona a un tema mio bro", "Pikachu fuma paco", "El Ayuntamiento de Staunton aprobó por unanimidad una resolución que condena la sustracción forzada de órganos\r\nEl ayuntamiento de Staunton aprobó por unanimidad una resolución similar el 14 de octubre de 2021, dos semanas antes de lo previsto. La alcaldesa Andrea Oakes agradeció a los practicantes locales de Falun Gong en su discurso, por concienciar a la comunidad sobre el tema. Dijo que se había comunicado con el delegado del estado de Virginia, John Avoli, sobre la resolución. El Sr. Avoli expresó su apoyo a la resolución, así como el vicealcalde Mark Robinson.\r\n\r\nDurante la reunión del consejo, la patrocinadora de la resolución, la concejal Carolyn Dull, habló sobre cómo los residentes locales deben prestar atención a la sustracción forzada de órganos en China y evitar participar sin saberlo en este tipo de trasplantes de órganos. Agradeció a los practicantes locales por su esfuerzo. Ella cree que todos deberían determinarse y oponerse a la sustracción forzada de órganos de prisioneros de conciencia perpetrada por el régimen de China.\r\n\r\nTexto completo de la resolución del condado de Fluvanna\r\nJUNTA DE SUPERVISORES\r\n\r\nCondado de Fluvanna\r\n\r\nPalmyra, Virginia\r\n\r\nRESOLUCIÓN No. 23-2020\r\n\r\nUNA RESOLUCIÓN PARA CONCIENCIAR A LOS RESIDENTES DE FLUVANNA Y A LA COMUNIDAD MÉDICA SOBRE LOS RIESGOS DE VIAJAR A CHINA PARA TRASPLANTE DE ÓRGANOS A LA LUZ DE INFORMES RECIENTES SOBRE LA SUSTRACCIÓN DE ÓRGANOS PERPETRADA POR EL ESTADO A PRESOS DE CONCIENCIA\r\n\r\nCONSIDERANDO que informes extensos y creíbles han revelado asesinatos masivos de presos de conciencia en la República Popular de China, principalmente practicantes de la práctica espiritual china de Falun Gong, pero también otros grupos minoritarios religiosos y étnicos, con el fin de obtener órganos para trasplantes; y\r\n\r\nCONSIDERANDO que el Tribunal de China, un tribunal independiente con sede en Londres presidido por Sir Geoffrey Nice, quien fue fiscal del tribunal penal internacional para la ex Yugoslavia, concluyó el 18 de junio de 2019, en una determinación unánime al final de sus audiencias de un año de duración, que el asesinato de detenidos en China para trasplantes de órganos continúa y que entre las víctimas se encuentran los seguidores del movimiento Falun Gong encarcelados; y\r\n\r\nCONSIDERANDO que el informe de Freedom House de 2017, \"La batalla por el espíritu de China\", afirma que \"la evidencia disponible sugiere que la sustracción forzada de órganos a los detenidos de Falun Gong para su venta en operaciones de trasplante ha ocurrido a gran escala y puede continuar\"; y\r\n\r\nCONSIDERANDO que un informe de investigación publicado en junio de 2016 por el abogado de derechos humanos David Matas, el exsecretario de Estado canadiense para Asia y el Pacífico, David Kilgour, y el periodista Ethan Gutmann, estimó que China está realizando trasplantes a una tasa equivalente a “una escala industrial , un sistema de trasplante de órganos dirigido por el estado, controlado a través de políticas y financiación nacionales, e implicando tanto a los sistemas sanitarios, militares como civiles”; y\r\n\r\nCONSIDERANDO QUE Falun Gong, una práctica espiritual que involucra ejercicios de meditación de “qigong” y se centra en los valores de verdad, benevolencia y tolerancia, se hizo inmensamente popular en China a fines de la década de 1990 con múltiples estimaciones que sitúan el número de practicantes en más de setenta millones (70.000.000); y\r\n\r\nCONSIDERANDO que, en julio de 1999, el Partido Comunista Chino inició una intensa persecución a nivel nacional destinada a erradicar la práctica espiritual de Falun Gong. Cientos de miles de practicantes de Falun Gong han sido detenidos clandestinamente en campos de reeducación chinos, centros de detención y prisiones, donde la tortura física y mental es común; y\r\n\r\nCONSIDERANDO que, en junio de 2016, la Cámara de Representantes de los Estados Unidos aprobó por unanimidad la Resolución 343 de la Cámara, que condena la sustracción de órganos sistémica y avalada por el Estado a practicantes de Falun Gong y otros presos de conciencia; y\r\n\r\nCONSIDERANDO que ha habido poca cobertura mediática de este problema, sin embargo, decenas de ciudadanos de Fluvanna solicitaron a la Junta de Supervisores de Fluvanna que se ocupara de este asunto, y CONSIDERANDO QUE, los residentes de Fluvanna deben estar completamente informados de la fuente de los órganos antes de tomar la decisión de participar en el turismo de trasplantes de órganos en China y la Junta del Condado de Fluvanna debería ayudar a crear conciencia a este respecto;\r\n\r\nPOR LO TANTO, la junta de supervisores del condado de Fluvanna resuelve: que condenamos, en los términos más enérgicos posibles, la persecución a Falun Gong y la sustracción de órganos patrocinada por el Estado a todos los prisioneros de conciencia que actualmente lleva a cabo el régimen comunista chino; y\r\n\r\nSE RESUELVE ADEMÁS que instamos al gobierno de los Estados Unidos a que investigue a fondo las prácticas de trasplante de órganos en China y tome todas las medidas razonables para poner fin a la práctica de la sustracción de órganos no consensuada a los practicantes de Falun Gong; y\r\n\r\nSE RESUELVE ADEMÁS que los residentes y la comunidad médica que presta servicios en Fluvanna y la región circundante sean informados sobre los riesgos de viajar a China para trasplantes de órganos y así ayudar a evitar que los ciudadanos locales se conviertan en cómplices de la sustracción forzada de órganos a prisioneros de conciencia perpetrada por el estado; y\r\n\r\nSE RESUELVE ADEMÁS que se proporcionen copias de esta resolución al Gobernador de Virginia, a la Asamblea General de Virginia, a la delegación del Congreso de Virginia y a dos senadores de los Estados Unidos, y al Departamento de Salud de Virginia.\r\n\r\nLA RESOLUCIÓN ANTERIOR FUE ADOPTADA DEBIDA Y REGULARMENTE por la Junta de Supervisores del Condado de Fluvanna en el condado de Fluvanna el 3 de noviembre de 2021.", "Welcome back Paulo londra we waited for you for long-time I love you music", "pikachu fuma paco", "Es una no es la mas esperada ya q falta la del duko 😎🖤", "No me gusto la reacción siento que papo quiso decir más pero no se ve cómodo trata de estarlo pero pues igual muy bueno el papo se le reconoce el esfuerzo", "Heyyyy Papote un abrazo parcero 😎🆗🎶💯", "Pikachu fuma Paco y Toma de la Ricarda", "pikachu fuma paco, y no la pasa... lmao!", "Tremenda reacción papo como siempre siendo el 1 como pikachu fuma paco :D", "Pikachu fuma paco", "Pikachu fuma pacoooo!!! awa", "yo si recibi lo que esperaba Paulo es el mejor de Argentina es mas creo que si la escena Argentina hoy en dia la rompe es por que Paulo hizo que el ojo del mundo este en ese pais.", "Pikachu fuma paco", "Pikachu fumapaco", "Pickachu fuma pacoooo 😂😂😂", "Lo de blanquito iluminado, me sonó muy a la sesion de Residente. 😂😂", "Papoo te quiero una bandaaa,pero yo creo q vaa a ser el mejor bzrp de la historia y  punto,DEAAAA", "pikachu fuma paco", "Con carpa es como con disimulo aqui", "Una verga, sobrevalorada a más no poder por los que no quieren reconocer que fue mala. Igual la peor lejos es la de Tiago", "amo tu papo...digo papo te amo", "😧", "Pikachu fuma paco", "Goddo", "Pikachu fumapaco", "Si este tema salía apenas Paulo le dan luz para poder sacar temas quizás ahí el tema hubiese dado otra revolución.\nOsea que si este tema con Biza hubiese Sido el primero en vez de Plan A quizás el tema les hubiese encantado más a las personas.", "Che nadie va a decir que el tema es una poronga?  No hay que tener miedo a decirlo solo porque es Paulo.", "picachu te falta calle", "Y para cuando tú sesión pa ?", "la lagrima del final", "Pikachu fuma paco JAJAJAJA, tus reacciones son las buenas 👌🏻", "Di la vdd estuvo jodida la sesión, chafita", "Malisima la sesión", "Pikachu.....Fuma paco", "T amo Gordo Forro 🥵❤", "Ibai también dijo “Yo” JAJAJAJAJA", "que  significa \"Con Carpa\" alguien me dice", "Pikachu fuma papo!", "Sácame de la Duda Papo las sesiones de Bzzrp son para que los artistas saquen lo que tienen guardado .....", "WAAAAACHOOOOO", "Malisima la reacción", "Pikachu fuma paco xD", "no es la mejor calidad ( video en 4K ._.) xd \ngrande papo <3", "pikachu fuma paco", "Pikachu fuma  paco", "La reacción que busqué y que no me la tiró YouTube como la del bobo de cos**... Te re banco Papo. Aguante Paulo 🇦🇷🦁", "Nananaa ese LEEEOOOOOOOONEEEEEEEES CON FLOO OO OO OOO OOOWWW .. PAULOOOO LONDRAA A A A A AA", "Arriba Paolo londra que le estás rompiendo como lo imaginamos 🌻🌻", "Papo reacciona a Reality Flow X de Al2", "Gordoo reacciona a sz una triste historia real. O. A hope de neutro shorty freestyle del buenooo", "Gordoo reacciona a sz una triste historia real. O. A hope de neutro shorty freestyle del buenooo", "Picachu fuma paco", "pikachu fuma pago", "Picachu fuma paco", "Pikachu fuma paco", "3:50 esa parte me seba mas que no se", "Pues muy meh. Hay mucho de esto, suena como todo lo que se hace. Tampoco dice nada,. realmente no hace sentir nada. Abuso de Autotune y poca expresión. Lo único que te hace sentir algo es el sintetizador de la frases iniciales.", "pikachu fuma palo", "PIKACHU FUMAPACO. \n\nGrande papo, grando paulo.", "Ibai pero ya te vi reaccionando avos", "Papooo \"con carpa\" significa \"con disimulo\"", "Pikachu fuma Paco we??", "ESTAAAAAA MALLLL MECHAAAAAAAAAA...", "Picachu fuma pacoooo", "pikachu fuma paco", "para mi es super comercial... no está mal,pero no es wooooo. Ahora,los fans de paulo estan re emocionados porque lo estaban esperando,lo se. Pero respeten a los que no les gusta el tema", "*Se le olvidó decir: ovy no the drums* \n\n*Saludos desde tijuana* 🍁🔥", "Pikachu fumapaco", "Jajaja la opinión típica de todos los que les gusta paulo y no les gusto \n\" la expectativa era muy alta \" \nEs malisima la sesión pongan la excusa que pongan xd", "Aaaaa", "ese pika2 fumapakooo", "Loco estuvo re piola... Se re planto y largo todo!  Y supongo que lo de con carpa fue porque estaba por llorar", "Papo chamo eres increible nunca cambies bro. Viva Paulo.", "Pikachu fuma paco", "pikachu fuma paco", "Pikachu fuma Paco", "con carpa = es con disimulo , idioma Cordobés 😎😎", "Pikachu fumapan", "pikachu fuma paco", "Pikachu Fumapaco jajajaja tal cual... Pasa que Residente y Snow tha Product habían dejado la vara muy alta...", "Pikachu fuma paco", "aguante le Pikachu fuma paco XD", "Pikachu fuma paco", "pikachu fuma paco xdd", "pikachu fuma paco ..... sos grandeeeee craaaack", "Pikachu fumapaco", "Pikachucomepako", "Pikachu fuma paco 😎", "Al final me hizo emocionar 🥺❤️ se le notó a paulo que estaba emocionado pobre me pone muy feliz que haya vuelto 💪", "Creo que está bueno el tema, pero para las expectativas que habían... quedó un poco en deuda. Vamos a ver qué pasa con ese \"con carpa\"... capaz que viene otra parte que la rompe.", "pikachu fuma paco", "\"'no entiendo porque llaman si antes nadie llamo, no entiendo porque vienen si antes nadie vino\"\" re que todo el mundo lo apoyo!!!", "Pikachu fuma Paco JAJAJAJAJAJA", "Sobrevalorado,de las peores sesiones , no tiene profundidad en sus letras , un mensaje hueco y aburrido", "pikachu fuma paco", "No quisiste decir que no es una c4g4da ,solamente está bueno", "Grande Papo!!!!! Comparto lo que decís, a eso le sumaria que biza viene del beef de residente, pero nada un abrazo gigante champ te mereces todo lo que tenés wachooooooooo!!!!", "paulo lloraaa no se si lo veis cuando se toca el hijo en medio de la season y al final se vuelve a tocar el ojo, demasiado personal, mucha mierda y un temazooo ARRIBA PAULO LONDRAAA", "Picachu fuma paco", "Pikachu fuma paco", "Picachu fuma papo", "Pikachu fuma Pako xD jajaja 🤙🏻\nEl tema mola mogollón PAPAAA❗", "Papo tqm eres lo mejor", "REACIONA  TE FELICITO    SHAKIRA CON REAW ALEJANDRO", "Pipaco fumakachu! 🤔", "pikachu fuma pacos 🤨", "Pikachu fuma paco", "Es el beat mas currado de biza. Paulo cuenta por lo q paso y son unos genios ambos.\nPd: en la primera parte, soy yo o Biza samplea la canción de Rocky, la mitica de Rocky subiendo las escaleras?", "Por fin alguien sincero.\nEl tema raspa amigo, es así.\n✌️", "Pikachu fuma paco", "PIKACHU FUMA PACO", "😈😈", "Papo... Cuando reaccionas a Reapper school es rap puro.... Espero tu reacción. Te va encantar.", "godddddddd  paaaa sos rey", "3:31 ultra god", "Picachu fuma pacon't", "Ojalá ojalaaaaa se junte bizza con Paulo ojaaaa y eso sea el \"con carpa\"", "solo me gusto la flauta del final", "pikachufumapaco", "Una reacción sincera no como otros que por ser sus amigos dicen que es un temazo", "Jajajaj no exagerenn que es re comun el tema no solprendio un carajoo", "HAY QUE DECIR LA VERDAD..\nDESPUES DE LO QUE HIZO RESIDENTE TODO VA QUEDAR CHIQUITITO... \nNO SE SI ERA LO QUE ESPERABA DE BZR.. PERO BUENO UNA VUELTA DE PAULO LONDRA..  BIIEN UN 7..", "Al que dice \" esperaba otra cosa \" , \" mucho bla - bla - bla ,pero no hacen ,na \"", "Pikachu fuma paco (?", "pikachu fuma paco", "pikachu fuma paco", "PiKacHu fUMA MaNGO", "Picachu fuma paco. Aguante paulo", "PICACHU FUMA PACO", "Sos un genio papo!! Te banco", "pikachu fuma paco", "En Córdoba cuando éramos chicos solíamos decir chupala con carpa, para mi viene de ahí la frase del final", "Malisimo el tema no me dice nada no me mueve un pelo, y para los q dicen q tenes q entender la historia de paulo cualquieraaaaa, liricamente y musicalmente es una bosta tanto esperar para nada", "Personalmente no me gusto como lo esperaba. Llevo años escuchandolo, me encanto que saliera esta canción gg", "La siguiente sessión va ser con el Pikachu fuma pako", "Mmmmmm nose..yo estoy esperando la Session con Wosito!!", "Picachu fuma paco... me encantas chiquito 💋", "nadie reacciona asi papo lc deu tm", "pikachu fuma paco", "pikachu fuma paco", "Pikachu fuma Paco \nJAJAJAJAJJAJAJAJAJAJAHA", "Pikachu fumapaco", "Esa parte de los perros se tragaron lo que me vomitaron rip lenny tavarez", "Pikachu fuma paco", "Pikachu fuma paco", "Nadie habla del taimin que hizo papo xd estubo gooooooood 🤣", "El tema estubo piola 2 años esperando la sessions a mi me gusto Valio la pena esperar tanto Con Carpa saludo loro", "A algunos no les gusto seguramente porque querían algo más comercial pero yo siento que es una session más personal y me encanto GRANDE PAULOOO❤️❤️❤️", "Acá expresa de que la gente que no lo apoyaban ahora como ven que le va bien después de todo lo que paso los están buscando.", "pikachu fuma paco.", "TE AMO PAPOO se monto un setup para reaccionar a la bzrp", "Paulo demuestra mucho sentimiento en esta sesión:(", "Una sesión con jaze porfa:(", "va a ver parte ll", "El tiempo le va a dar la razon a esta sesion.", "Que manera de fumar paco que tiene pikachu", "Pikachu fuma Paco?", "Por otro lado ví a coscu ví a Ebay o como se diga, y SOS el más agradable y con gestos únicos 😅 saludos", "picachu fuma paco con tupri", "Ahí tenés q entrar vos gordo en la próxima sesión y se rompe todo!! Tirales la idea acordate de mi saludos hermano", "Pikachu fuma paco ndea", "ARGENTINA con todos sus artistas está en su mejor momento.. espero sigan asiiii", "PIKACHU FUMAPACO", "Papo, Aczino batallo en EU en una de las batllas mas importantes de la historia y tuvo el detalle de mencionarte en sus barras, por que menciono esto?, por que tu ni una mínima reacción a su tema de GOAT, ni su tema con Arkano, por que? no intereso tanto?", "Pickachu fuma paco <3", "Pikachu fuma Paco", "La bestia del frystailer..", "Creo que pedís disculpa por decir que Residente sigue siendo la mejor session", "Pikachu se pone unos tokesotes de mota Pa andar bn eléctrico", "Picachu fuma paco", "En la miniatura más que cebado y en la reacción más tieso que mi bis abuelo dea xD", "Siento que sin la parte de Reguetón a full flow y raperos hubiera estado mil veces más épica de lo que es", "paulo: soy un gordo avaro con estilo\nibai y papo: soy yo 🤑", "Papo agregando tema para la conspiración, creo que la manera de grabar de esta sesión es antigua no como las últimas más elaboradas, así que fácil sí, harán una nueva ✌🏼", "Pikachu fuma tabaco", "pikachu fuma paco", "El Biza despues del abrazo le dijo 'ahora'. No se uds", "Paco fuma picachu!", "no digo que esta mala ,  esta hablando sobre su vida pero esperaba más", "Papo eres el mejor hagas lo que hagas, lo que dijiste en Twitter el otro día es mentira", "Pikachu fuma paco🤣🤣🤣"]