["I sub but I didn’t like because I was kinda confused", "I got permabaned for making a shirt that says \"roblox is poop\"", "i got baned for a week for posting a bloody game to the xbox survers lol", "most ez way to get banned\n1. join game\n2. say g word\n3. report random guy\n4. get ban", "Say \"gay sux\" or \"gay\" ROBLOX WILL INSTANTLY BAN YOU uhh maybe minutes you get banned.", "I just love how he violated 18 U.S.C. § 2319 and 2319A (breaking copyright laws and pirating music) in the first 3 minutes of this video. Love seeing federal crimes!", "bitches is just female dog", "670k viewer right here", "6:09 WAAA HAUAHAUAUAAHHA", "Account Terminated\n\nOur content monitors have determined that your Behavior on Roblox\nWas a violation of our Terms Of Service.\n\nReviewed: April 30th, 2022 11:10:13 AM\n\nModerator note: Do not post Adult Content on Roblox!\n\nReason: Adult Content\n\nOffensive item: no! no! no!", "\"Bicktches\" hm", "☕", "Day 1 of asking this.\nHello, good sir Laughability, may you play my game called Find The Circles? (It's by a group called Axolol's group, which was my old YouTube name, I would really appreciate it if you recorded a video on it).\nSincerely,\nBumble The Bee (AKA a youtuber that is not popular).", "got banned for saying lol", "Literally someone reported me for saying you look pretty🥸", "A warning for me was pretty scary", "But 1 comaand 1 day  and ban", "This is a warning screen not a ban screen", "i have roblox to\ni have 200 friends", "why you wanna do that", "His name: -Bicktches-\nHim: *bick-tæ-šcaï's*", "lol betages what name is that lollllllllllllllllllllllll", "IS SU S", "just spam gay in random roblox games", "i miss the old roblox without cringe online daters ;-;", "MY IPAD PRO DIED. :TIPYED FROM @AEDAN5515:😁😁", "i got banned for saying why and bruh and im banned for 7 days and its my real account", "you can post a tshirt in roblox with a black human porttrait and get banned \nit works for me", "2:58 this is probably because the name is over 50 characters, it happened to me.", "Why would you want to get banned?", "I said gay like 3 years ago and got banned yesterday", "you do know, the IP adress of that account is the same as your main. so if you get IP banned, all of your accounts on your PC will be permanently banned and you cant make more.", "just say \"gay\"", "that is a reel site bro", "Hi", "Its easy. Be a neo nazi", "\"Free money is all free\" You are turning in Mr. Crab.", "Just say quackityishot did nothing wrong\nWorld record xd", "put rainbow block then say i like this\nthen if they say rainbow is bad\nyour lucky then say yall just lgbtq haters thats how i got banned then check\nthe next day", "already got banned for 7 days lol", "no legit i got a warning for saying \"im 79\" BRuHHHHHHHHHHHHHHH", "me and my friend did this with a game that HAD  no filter for chat and it took like 2 hours", "1 and a half seconds", "Yesterday my friend got banned by saying woof", "say am hacker and thing to get banned i got banned before", "say gay to get ban 😹🤣🤣🤣", "The fastest way to get banned is download utg gui that uploaded from a hacker and you will get banned in 2 hours it worked for me but no roblox for 20 days :(", "You’re main could get banned cuz you posted your face and they can find your YouTube; your main account on roblox", "0:40", "Me accidentally type gay auto ban -____-", "say (a word that means a man loving a man)", "I tried to do a prank on my friends as a hater they mass reported me on my other account and got banned record time 1min I didn’t tell them", "Bitches*", "Bikcthes Becomes BITCHES", "You couldnt upload the file as it was .webm and not .ogg or .mp3!\n\nLike this so Laughability sees this!", "u mean biches", "Fastest way is make a game with an admin gui and publish it i think", "I was banned for a week for saying \"I made a black stone maker\" bro roblox just dirty minded", "Bro why do you have a furry in your friends list (joke)", "next time just say testicvals", "Laughabillity plushies", "0:36 I know the word it’s bitch", "Imagine if roblox is just watching this with the ban hammer ready for you to get banned forever", "I love how he uses perfectly safe words only Bicktches is definitely perfectly safe", "DAMNNNN HE GOT SOME BITCHES REAL QUICK", "Tbh laughability you could've said gay and boom banned", "bruh you only got a warning not an actual ban", "The way i was banned was in adopt me I said “im reporting black girl” but that’s not the way it sounds this rude girl dress in all black emo was being rude too much so I took action and said that soo im not rac ist", "I know how to get banned go in to a game and say fatherless or say die in a hole", "\"Laughability comics several crimes in like 8 minutes\"", "if you cannot upload that audio u must change the .mp3 to .ogg", "I thought he said \"Rape my avatar.\" XD", "You just type “How are you?”", "You used to be able to say “APP” in Roblox Chan and it would remove tags", "I just got my account terminated FOR REPORTING R63 MODELS BECAUSE THEY DONE THOUGHT I SUPPORT THE CRAP", "1:48 lol there some vietnamese guys love history", "Oh ok", "try uploading a t shirt that the name title is something like ''dont approach me ''  and try like some cringe game logo with an x on it i got banned for a week for it i think it still works", "Background music = \"He\"", ":32 bitkes if you wondered pls no report jut another one atop another", "I got banned for saying trash ;-; I was just looking at this trash can (not a person) and spam trash ;-;", "I got banned for a week by uploading a furry with an “🚫” on top of it. \n\nEdit: this was also the first time I uploaded a picture lol, so\nthat was a fun experience.", "6:08", "yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes", "I got a Roblox account banned in 3 hours", "SPAM BLACK BOII ALL THE BLACK PEOPLE WILL REOPRT. \nez week ban!!!", "1 other. Add utg", "This is why Roblox needs to upgrade their moderaters", "For me it took exactly 49 minutes, and 36 seconds for me to get the notice", "I drew Sylveon can u pls watch my vid name is: I drew Sylveon! ❤️🧡💝💚💙💜💖 (tell me copycat's link to their video or their YT if someone copies me 😩)", "just put a heart in a thumbnail and get a free warning", "Aso mi Roblox account is named Guest clue in mi name", "Cause I hacked a server", "I got ban from Roblox onec just onec still Roblox is all over me and Also send me a warning I may get attention from Roblox this may get me ban or may get you less from ban.", "Just type in “gay” in chat and your account will get deleted. It takes just a minute", "just say\nbite my shiny ass it got me banned in under 30 minutes", "Say gay", "You should make a picture of a girl eating bread and call it uwu Tahts how I got banned heh", "Day 193682 of asking laughability to plsy pm 606.", "Fastest way to get banned: go to a no tag game and say many swear qords", "Nice name, your mom would LOVE IT", "i actually got banend very quickly just by sayng ''one word'' in a vip server with nobody in it... e", "you have no bitches", "BrOOOOO ARE U NOT BANNED IN THE FIRST TRY MY BROTHER GOT BANNED WHEN HE. DID THAT 😱😱😱😱😱", "Fun fact= I wanted to make a cala maria t-shirt (for Cuphead game) and roblox sent me a warning cuz the picture was \"inappropriate\" cuz she is wearing a bikini -_-", "I got banner in 2 second, putting an Adolf Hitler picture", "Funky friday is my favorite game you should play it", "him: doesnt actually get banned. me: get's banned twice", "day 1 of asking you to friend me in roblox (user: LaughabilityCat)", "i think u need to spam g", "i got a warning before for saying “ giveaway prize “", "♾", "the easiest fastest way to get unbanned without hacking is just making a t shirt with a nude on it i good banned in the first 2 hour :(", "If you say g a y youll get banned it happened to me XD", "HIS IN THERE", "WHO YOUR FRIEND", "At the exact moment you said “yes” my screen froze XD", "Imagine u got ip banned lol", "say derren neigha and u will get banned :D", "gh", "If you want to get banned as fast as possible goto a popular cafe game and say a racial slur. 100% ban", "You couldn't upload the the audio files because they weren't an .ogg or .mp3 file (which is what roblox allows), the files were a .webm", "Or u just say ur gay in report reason", "Just say gay and say to ppl report you and they gonna type reason gay then u got banned.", "Sonic", "Just type g word in the chat of a game for 8 times you will get banned for 7 days", "Maybe upload September by Earth, Wind & Fire to Roblox (as a audio) because it is also copyrighted by Columbia Records, a part of Sony.", "How to get banned asap: say gay", "You can get banned in 5 minutes if you upload a FNF song in Roblox. Yeah I know this because it happened to me. Not on my main account tho", "The best way to get banned is join a hangout game say 1 letter get offended by softies and BOOM banned! (Not like im saying that because that exact thing happened to me 4 times in the past 2 months)", "i swear he got demonitized", "u need .mp3 or .ogg file to upload and it has to be actual one not only change name", "Yoo if you dont heres a hint \"a female dog\"", "i know being racist can ban you on roblo for a week", "I got banned for saying KKK, you get the idea.", "i got warned once for teaching a hacker how to insult", "If Roblox sees this your dead", "i got banned by just saying NO I DO NOT WANT TO TRUST TRADE and then disconnected ;-; i think the the word trust trade is ban from roblox ;-;", "8:02 look how many members in his group I think that should get him banned", "1:48 cringe as shit. right is better", "Its worse than saying n word u can get banned in instant", "I subscribed", "I did this and I got banned in 2 minutes", "You can just spam the N-Word in roblox games and there ya go", "you can say that word to your mom just don't call her that", "Is it bitches!?", "even say if he says is safe dont say 'Bickthes'", "hi laugh, what for pc specs do you have? i've wanted to ask you this for so long, so can you please say the specs of your pc? or mac, because you also play roblox on mac.", "If he wouldn’t have held back, he could’ve had his account permanently deleted in seconds", "bobloc", "Ur username means a mom cat I think.", "i got a warning for a random shirt to help stop bullying in games. lol", "the Fastest way is saying GAY", "Wow", "I got my account deleted for making a Thor tycoon.... 💀", "do you know de wae", "you can spam gay", "I once got banned for telling some awful person (bypassing racist slurs and doing terrible things) \n\"People like you deserve to burn in hell\"\nvery effective method", "Easy all you gotta say is roblox is horrible and terrible", "Day:723 asking laughability to become bald", "My brother tried this without watching the video. Except it was more like 3 minute ban speedsun", "They banned my account for a couple days for uploading Ugandan knuckles", "if you put a fake ID u get banned instantly", "the members in your group are, in terms of your role system, are bembers (unintended bfb reference lol)", "Day 1112 of asking laughability to play sad bully story", "1 like  = ban for LaughBillity", "I got banned in one day for playing games with a crouch button", "U", "My name is cuhk suhk 😂", "To get banned fast go to jail break and use the trampoline and say I’m hacking lol ez big jump", "Just say gay", "Just say gay in bus simulator and u will get instant ban", "Everyone else: Try not getting banned\nHONKEYMANSTAN: PLEASE GET ME BANNED", "i love youre video so much! \n\nGood content!! :)", "Names bitches", "do part 2", "Yes you cant get banned in 30sec bruh😂🤣😂🤣", "How to get banned make a t shirt with hitler if that how you spell his name", "WHEN IT WAS FR IM LITTEARY NOT TOXIC", "i got one for litteary SPAMMING EZ", "It's bitches-", "It’s good that meep city parties have been permanently removed for they inappropriate stuff", "i got ban in a few sec i was playing spamming", "Me : getting a warning on my alt getting banned on my main 4 times \nRoblox: noice \nMe: wtf roblox", "you can get banned in boku no roblox really easilyby just afk autoclicking for 20 minutes", "I've been Warned 4 Times", "I got banned for a week because i said \"gay\" to my friend. whats worse is that it was during christmas and i had gotten a few robux gift cards so i had to wait..", "The fastest way to do it and get banned forever is...", "says furries are cringe and you get banned for 7 days", "One time I got a banned for bullying Bacons so now I stop bullying Bacons poor bacons", "mann i got a warning just for spamming E whit an autoclicker :ppp", "1:46 yo he has a Lil darkie t shirt", "I know what bickthes means", "Get a group and call it 'OneSolidPlayz Fan Club' it got me banned within minutes...", "I met quardadledingle on a roblox  swordfight game", "1 like in this coment = 1 prayer that i get unbanned faster", "tips to get banned fast: just spam the g word.", "i just got banned for 1 day", "just saw a vid of yours from 8 months ago abt russian  roulette i like your way of recording and wondered if youd ever do a channel for regular horror play throughs of gory actions games etc i did subscribe tho because why not👍", "His only friend in that account is a furry. Is this a thing to get banned?", "I said Ahhhhh~ when i Joined on roblox and i got banned after saying it (i did it on purpose)", "Laughability\r: *uploads images of him and pewdiepie and gets warned for a selfie*\nme: *uploads a condo game and bypassed neko image (famaly friendly, i promis) and doesnt get me banned*", "You can get banned by saying Roblox is my dad I just did it", "roblox ban speedrun any%", "Say \"gay\" and you will be banned in under 10 minutes", "I got a warning 2 times", "Imagine roblox watching this", "i only said fruck (remove r) and i got banned in 10mims", "uh you said you got banned you got a warning liar", "you said amazing picture that picture of you was urgly", "Why doesn't he say \"gay\" to get banned first try?", "I got banned when I joined Roblox I didn't even play a single game", "That laugh- 6:09", "Just say gay and you get banned in seconds", "I'm soo lucky because i got ban only 1 time in 2021 dec someone banned me for 5 months", "I spam in pet Sim x like 7times I almost got ban", "Just say I’m hacking", "Can you please let me be your roblox friend", "\"How fast can you get banne-\" Me: Gay", "Bro just say gay and toxic stuff like go do ur husband dishes", "I KNOW HOW a few months ago a miraculous t-shirt of mine got took down by Zag Inc. So spam Them", "Day 1 of asking Laughability on what's his height", "To get your account banned very fast, you need to type Gay and spam it, *in some days you will get banned.*", "Check your group chat", "Day one of telling laugh that I made a bigger avatar tell him to check my channel!", "Just say g*y", "Ur kinda sus ngl", "love how this was made in 4/20/22", "When he said ‘unban quackity’ in chat:\n\nRoblox: KEEP THAT NAME OUT OF UR F*****G MOUTH.", "USE A VPN while making trying to get banned on a different", "OMG! You're gonna make a Roblox account? That's so cool! 0:00", "I FOROG💀", "Me: “gay” \nRoblox: no", "i once got banned from roblox after 1 hour because i created an alt account and start saying cuss words BUT ITS LIKE THIS n**** b**** **** you", "i got banned pretending to hack but i did it in a trash acc lol", "AYO AYO MEME RAID TEAM GOT NOTICE YASS YAYYYY", "why do you need to get banned?", "Bro this guys trying to get banned and I can get banned accidentally", "the second method 3 comes up i see an ad of a new 2022 flipphone to put in your pocket, is that the method?", "just say the n-word 3 times", "you could not put the music in because it was a .webm roblox only accepts .ogg or.mp3", "The fact I got no ads through the whole video 💀", "His name just need to be quiet and put a random outfit on", "btw i got your monkey hat or something", "\"rape my avatar\"", "Btw you wanna get banned? Upload a photo of kelogish and audio file of his voice", "Okay, now do how to get banned from YouTube.", "Day 1 of asking Laughability to roast me", "I see you noticed my Roblox group Meme RAID Team lol!", "How did u do this I try making an alt account to make a game and it says I can't play because it knows I'm on an alt account", "Yesterday I got ban and I'm still banned because I was doing weird stuff and I was dating", "just say gay", "You can get banned instantly by opening up r63 boxes in Roblox studio", "i  spam mmmmmmmmmm 1 year ago", "I got banned for saying \"are u gay\" and \"🏳️‍🌈\" and \"🏳️‍🌈\"", "1:57 that made me say: are you my dad?", "dude can u believe this im scared they will report me for no reason so i hide in a game bc im so scared bro 😭", "I remember when my friend was account deleted for \"Cancer Jotaro\"", "6:06 amazing laugh,cracked me up", "But it's bickt\nches wow", "Bicktaches 👌", "Just bully ez", "bro has a very menacingly laugh lmao", "i got a warning about spaming hey but i never spamed hey. 8:13", "Day 12 of asking laughability to join my group", "just say the g wird lol", "Rip every kid who said the word to their mom. A moment of silence.", "i know how to do it in 5 minutes step 1: join prison life step 2: say anything in the chat that is offensive (it works with things that are not offensive too) step 3: wait", "Yes.\n\nI literally got banned for 1 week because i said \"gay\".... C:", "whats the sound effect at 0:08", "No bicktches ??????", "Dream Stans speedrun", "I said gay and fuck got me banned 7 days!", "Why do you have a furry friend ?", "I will say that word to my mom\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJk", "Hackers:e z", "8:05 Actually guys you can get warned the fastest as possible in 8 minutes and 5 seconds and i dont know miliseconds", "3:03 is that gangsta's paradise", "Roblox watchign this is lik3:NOT COOL :((", "Hi", "i got banned from a test scam in adopt me bruh :/", "Lol 40sedonds in bruh", "Try Making t shirt name i swear im not racist", "Say gay", "PSSST! innocent people if u reading this u can see this\n\nbitches means get girls", "nothing says perfect  except Watching Laughability all day with some hot popcorn", "I got a free roux add m8 its probably a scam", "My internet be like : 2:34", "I got banned for saying “hi” 😂", "Just say gay and self report :)", "I got banned by saying i hare korea", "Sometimes roblox moderation is the WORST,\na little storytime: me and my bestie we were playing mm2,\nA guy starts bugging me, and starts mocking my dead grandpa and my family, he told me\nMy family hates me and i should DIE, he starts saying racist stuff to ma and all i ever did was say\n“Can you please mind your own business” kindly, he starts to bully me in each round, HE WOULDN’T STOP,\nI reported him, SEVERAL times, my best friend ends up getting warned for “being racist” when SHE was defending me.", "lol ok this was funny plus 1 subscriber", "Faster way to get banned I tried it: spam this in a game in roblox bedwars: I dont care about the fact that I'm hacking I care about how you died in a block game L", "Bro if you just say go die in a game it will ban you", "Laughability can you play RPG simulator please.", "I got banned for saying yes though fr", "i litterally got warned though i only said,am hack. Though i was joking", "how many poop accesories can you fit in your avatar", "3:30 laugh, that's an iso file...", "this challenge is too easy legit all you have to do is upload a iron cross i got banned for doing this twice one account i did it on had 10k robux but riblox is too stupid to realise the iron cross is not nazi its been around since the medival crusaders", "The fastest way to get ban is saying the word that start with g and end with y or if u dont understand what u call boy that like another boy?", "1:47 be careful the comrades might get you for that", "why u have a furry added on thart account huh?", "I’m scared if you get actually banned your my favorite YouTuber 😥😥😥😥", "God dam this guy is (wrong answers only)", "the audios were webps", "I got a warning for acting like a bot in my own game somehow. I was working on a code to censor the scam messages and then boop: I was warned 😂", "why does Roblox hate pewdiepie ?", "I got banned for saying \"stop being lesbia n\"", "Should of said the g word works like a charm", "its simple, just say ruben sim.", "you change the song to mp4", "Bro I know how to get banned super easily in like less than an hour. You put a T-shirt up of milk and put DAD COMES BACK WITH THE MILK. Trust me I’ve done it and it didn’t go well", "me watching this on the day i got baned for a week lol ;-; :(😔😭👣", "I got 3 warnings already R.I.P", "If You Say “gays” in a random game you get BANNED But You Have To Wait Some Little Time🏳️‍🌈", "Ohhh", "un", "Damn he was smoking weed on 4/20 and went to see how long it took him to be banned\nD a m n", "Fast ban I had was\n4 mins because 😏😏😏😏😏", "Laugh get oof ^\n                          l", "Laughability : yes Yes YES!!!\nJojo fans: *THIS VIDEO IS NOW A JOJO REFERENCE*", "No bicktches?", "That’s what I’ve been trying to do after I made a alternate account because I’m bored \nAnd i haven’t been banned", "say ne. ga.", "Just call somebody gay in yba and you'll be banned faster than my dad went to get milk", "I’ve gotten suspended over 10 times but I guess roblox loves me for buying over thousands of dollars of robux", "i was browsing the images and i saw n****r your fired", "8:02 thats where.", "Dude wth happened to laugh more", "My friend said \"British\" and git banned", "just go into easy obby and copy one of the scams, easy, i got banned in like 30 minutes (in 2020)", "Uhhhhh I looked at the pinned comment and it ruins the video", "I got banned in 1 day for pretending to be a scam bot", "Day 1 of asking laughabilty to play innovation inc spaceship", "just say someones ga- i got banned for 7 days for saying it", "day 1 of asking laugh to Friend : HeyCxleb & AnonymousUnlimitd", "Damn Toaster Protogen friend on an alt", "idk how they didnt ban you when you did the scam thing when i did it that banned me for a day", "Why is this so funny!!!???\nI got banned at friday cuz of defedning Ukraine guy (with words)", "Oh yeah. ROBLOX A WEBSITE KNOW FOR BEST MODERATION ! LOL", "Mayonaiys", "my display name is rascal 😳", "Getting banned is actually easy", "The quickest way to get banned is saying gay it got me banned for 7 days", "you can't upload because of the name.. no # ( or number", "I got banned for making a t shirt with a minion on it ☠", "GOTTEM I AM TELLING ROBLOX", "Sad, I uploaded a shirt that was \"NO MORE SLENDERS\" and it had some slender avatars and barf emojis lol and I got warned for that :(", "How to get banned immeditily step 1 write dee in avatar and most recent", "My alt account got deleted because I make a copy Version of pet simulator x", "I understand the word Bickthes ;)\nI said it to your mom", "Wait... Roblox didnt exist back in 1998", "Bitches xD", "spam gay", "The fast way is to open r63 and publish the game idk what fast mod is to get banned but thats mine", "Easy spam iam gay", "Just say 'gay' its the most efficient way", "I got banned for adding a admin gui pad in a game permanently", "The easiest way to get banned: Put an ultimate trolling guide in your game.", "1 warn pathetic I got 8 warns and dint get banned", "Bicktches meand bitches", "I made an alt account for trolling after i buyed items in that account : refreshed the page and got permanently banned", "Best name in the world", "I got banned instantly on my alt Getnoobed", "Around 15 seconds  an account deletion if you say negar create an alt make him join in your spawn place and let the Alt report u", "I got banned", "I got banned once bc one kid was so mean so I talked back and then I reported him and he reported me and roblox banned me for I think 7 days and I thought it was a troll bc he said that he will report me but then I was so mad so yhea I was banned", "I love how kid friendly this video is ☺️", "Add an utg in a game to get banned for 7 days I got banned from it", "just say kick black  boy in spray and bamd you,re banned", "I’ve gotten banned off roblox so many times", "u can get banned by saying gae or gay i always get banned bc of that", "Swy the g word", "Fun fact :you can get banned almost instantly if you oppose roblox moderator wobble dragon on roblox", "it took me 10 min to get 2 accounts banned", "You are lucky I got banned for 7 days for people controls me and says g#¥", "Day 5 of asking laughability to do toe reveal", "How to get banned fast: \"Accidentally\" send a link to gore", "No Bitches?", "ive been warned on multiple occasions for saying \"ez\" 4 times", "Just call somebody gay and you get banned", "Typing gay in a roblox game can ban u isn't that simple lol", "immediately, if you get unlucky enough. got banned for 2 weeks once for no reason", "I got banned from roblox for 7 days on Monday. Can you help me?", "i said gay and the n word in an alt account i didnt got banned?????? I thought i was gonna get banned", "My friend bullied people on lgqbt hangout and the second he left the game he was banned for 7 days on his main acc", "Huh? you spent 1 hour TRYING to get banned? My friend got banned for saying fade 5 minutes into starting a new account. JOKES ON YOU.", "me getting banned for a week for reporting someone for being homophobic", "you should say nagzi hirler YOU WILL GET BANNED FOR 7 WEEKS", "PITIN", "the word is Bitches, children.", "Bicktches=Beaktagées", "say \"hello\" and boom u are banned", "lol thats so esay", "Fast_hacker0 can help you fixed it.", "Say gay to everyone in roblox", "Your real account should be TERMINATED.", "Laughability: uploads images, says stuff and more\nUs: *says car and gets banned*", "I got a warning for saying gg.. thats how fast i got banned", "Day 578 of asking nothing", "Lol by the fact how laugh said to say the b word infront of your mom was hallarious lol", "say \"I am a hacker\" it will get you banned for a week (experience)", "Day 1 of asking him to join random games that his friends are playing", "Why are you friends with a furry on that account?", "use chat bypass script.", "fastest way to get banned i think is to just spam \" you gay furry femboy\" and some how mix in the word \"fat\" in there", "How to get banned from Roblox-\n\nStep 1: Upload an audio\nStep 2:", "I played bypassed audio for 45 seconds and got permanently banned AND NOBODY ELSE COULD EVEN HEAR IT LOL", "Oof", "how to get banned in 1 sec:say gay", "day 1 of asking laugh to install old roblox", "i loooooooove your vids", "my friend got banned for saying: \"\"poggers\"", "I got warned for uploading Putin hugging a doge.. :(", "just say gay", "\"Beaktajays\" nice name there bro", "just spam gay 1 roblox doesnt like you spamming words 2 gay gets you banned", "Hey laugh here's a tip: Yesterday I got warned for uploading a logo for my bar in Roblox and it contained root beer which was mistaken for beer", "20 secs", "I got banned for saying ligma ( censored )", "Oh no our account its broken", "Bicktches\nBritish People:", "0:46 just say female dog that’s literally what it means", "LAUGH!!!! You have to react to some spooky scary videos. I'm down to see an adult male piss himself y'know?", "0:26 Why does he have a zoophile friend", "I once was playing the normal elevator and I asked the potato 'am I a mistake?'  And I got banned for 7 days! And yes it said that I was a mistake lol", "i made an alt account called hellYoubitkc and it got banned cause i uploaded swear words decal", "its really easy for me, i have skills that will get your roblox account deleted on the day of creation", "epic", "i banned 2 accs in 5mins the first 1 is rulesdontmatterXD and the second one is called bannermeXD", "Play nations roleplay on roblox and if you say anything about religion or country’s or races it will ban you for 7 days", "Just say “gay” I said it and got banned for a week", "Bad word broo", "Lol laugh, i account deleted my main listening t o ur advice no cap", "Try saying b!t(|-|", "i got banned for 3 days in less then a minute for uploading a picture of Garfield with a pregnant minion", "5:02 day 2 of asking for the music you can hear here", "I once got banned for 6 days over saying \"eats toes\" cuz it was \"adult content\"- no idea how u didn't get banned lol", "0:40", "10 tHAudSeND pEPoLe pRaY fOr Bicktches gEt uNbAnnEd!", "I love that he acts like he can't make an account without his pass so that he does not get his main account does not get banned.", "idk what to comment so here's an I'd of a decal that got me banned but Roblox approved it and never removed it \nID:9437933592", "Hey laugh i got banned by saying \"ni ga\"", "Mate my user is d0gp0un63r.", "Hey Laughability, do you still play all star tower defense? lol", "5:49 it's funny how he can't upload an image of pewdiepie or knuckles, but people can do fake abs and other parts...", "can you pls shout me out", "\"that got Albert flamingo banned back in 1998\"\nthat should have not made me laugh", "Bro u can say pack I got banned for 20 days 😂", "I had an alt that was deleted within 2 days of its existence bc it said dink and other bad things", "i get ban from roblox because i said \"ok who gay here?\"\nfor like 1-7 weeks", "Ye my acc got banned \nI got it banned for 12mins\nBy buying a chad from starving artist and did some replacement and got banned", "if you play adopt me for 1000 years im giving you my soul", "flamingo copy", "My mom took away my tablet for week beacease I said biktchets", "dude you should have just said ,,gay\"", "Got no bitches 💀💀💀", "\"File is not a valid mp3\" means that you have to download the mp3 from another yt to mp3 website.", "i got banned for saying a no no word but i put before it it i wasnt saying it to anyone r trying to offend anyone the person that reported didnt add that", "I actually got a warning for saying \n\n'players name' got no bic ches", "Biektushee", "My main acc got banned it'll be unbanned in 20 minutes", "bro ur literally lucky you didn't get warned straight away cuz roblox moderation is shit", "B$*@# is a very bad word.", "1:48 me n the bois B)", "My Alt acc got Banned Bcuz I made a game pass That i Named \"Amogus\" Which is a My New tactic to Get Bann Fast\n\nBtw I Hacked into my Little Sisters Acc and Made a Game pass with an Amogus name And Got it Banned She was so Confused When Roblox Banned her bcuz of the Reason:Amogus 😂🤣", "\"Claim your here before 1 million subs ticket\" 🏆💙\nEdit: and heck no I'm not a bot", "upload a distorted audio/earrape audio", "Do u kno de wae", "I just wrote \"hi guys\" and autocorrect wrote \"hi gays\" so i got a week ban lol", "yus", "Wow laughability loveks himself", "Day 1 of asking Laugh to play FallBlox by GreatBaconStar", "No name is bitches", "8:15 pwfffff i have 10 warning loamaw XD smh shave my hair hahahah", "Roblox doesn't ip ban you unless you do some actual horrid shit like borderline felonies and terrorism and stuff", "i got warned for posting  a picture of 24kgoldns roblox face as my group picture", "say \"AHHH MY PP STUCK\" and youll get banned trust me it happened to me \\", "I got banned from saying \"gay😂\"", "Just go into a game which is called no safe chat or something like that and say bad words", "Beak-taghes", "I almost got banned bc i named smth \"my friend\" for a decal-", "Bick Toche", "the reason the audio didnt work is because the audio from that site doesnt even work for anything", "the fastest way to get baned on roblox is just say this on a roblox game", "The fastest way to get banned is to act like a scam bot I did it and it worked.", "spamming ez will get you a warning", "You Can get banned by saying gay lmao", "You should do it lurks 3", "To get banned for 7 days say you mean gay in roblox chat", "I just got banned for 1 minute for posting a anime disgusting decal\n*alt account pls don't start an argument*", "3:42 \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n*Gaster noises*", "Day 1 of asking LaughAbility to give me robux", "mirabel: hey um i kinda need to know about bru-\nthe madrigals: 1:31", "you should have said the n word", "Just say gay to get banned on roblox", "Just spam i got banned for it lol", "Proto*", "Porto friend", "8:05 he gets banned-ish", "you need to convert the mp3 file to an ogg file for the upload to work", "fun fact: if you upload a roblox studio tornado black particle model you get a warning and u can log out, prob counts as ban when u log out of a warning", "My friend got banned from Roblox forever because he spammed E", "Wtf is that horrible face 6:12", "I got ban and 20 seconds", "10 seconds banned myself I'm an admin 😎", "Awesome video, keep up the good work!", "uhh guys when u say a badword like badass it wont hastag it in roblox", "If I said ahhh l will say yes", "I have a question if i create a game with me as a monster doing \"T\" pose, can i take a picture of myslef?", "This is ironic I just got banned for saying gay.", "Just say gay and you get banned", "i got banned today for 7 days cause of saying ''why''", "Post a battle ship shelling Normandy it warns you but prob can ban you if you spam it", "u should of said kill all furries cuz i got banned for a week just for saying that and i didn't even get a warning", "i unsubbed cuz you hate piggy", "I uploaded a loud audio and got banned within 1 second :sadge:", "69K+ Members\nnice", "Just post the Nazi or confederate flag to get a 7 day from seconds of posting it.  (Don't ask how I know this)", "6:09 goofy laugh", "u couldve used mp4 convertor", "Laughability, you can pull up the middle finger in roblox and I did that and I got banned for 7 days.", "I got banned for 7 days for saying I like cats more than dogs...", "POV: you get no bitches", "Want to get banned make a gamepass called TYSM Cause i got a warning", "if your bully us bullying you then just say nice when he says did i ask", "My acc got banned for a week bc I said something in chat that Taged it's inappropriate the word was Niger I'm mobile so it was a typo and no warnning", "Why couldn't you say gay gay gay", "Take a video about this , \nthe world satanic elite , you can also call them as the committee for the meeting of the Antichrist ,Trump called them the deep state, at the moment it consists of about 10,000 people , from the famous ones are Merkel, Macron, Biden, Boris Johnson, Sarcazi, Bill Gates, Zuckenberg , Sergey Bryl and Larry Page ( the owners of Google and YouTube),Pavel Durov , the Bush family, the Clinton family, the same Rockefellers, Rothschilds, Baruchs, Leibs, Coons, Schiffs,Oppenheimers, Ruperts,Waltons, Dupons, Goldmans,Morgans, Carnegies , practically all the royal and imperial families of the world (the most important of them are the Windsors), and other surnames . They are all connected to each other, and they believe that they have a much better chance of gaining eternal life for themselves and corrupting humanity than to lose.Therefore, those new people whom they accept into their community agree to be with them not only because if they refuse and they will be killed, but also because he sees that they have a better chance of winning.They are behind the world wars , they created and spread the coronavirus , now their goal is to create a single unified world and a single world government. All spiritual life will be concentrated within one church,they need it to ensure the arrival of the Antichrist (Dajjal) and prevent the second coming of Jesus and the last judgment ,thereby ensuring the end of history beneficial to Lucifer and insignificant for humanity ,such conditions are allowed by God ,when Lucifer (Iblis) disobeyed God and did not bow to Adam , God could have killed him, but Lucifer (Iblis) asked to leave his life, and for this he will experience the creation of God - man in particular and humanity in general, Lucifer(iblis) (he can not, like any demon ( jin), communicate directly with a person, but through the rites of magic there can be a connection) . For humanity there are 3 variants of the outcome , the first arrival of the Antichrist and such a fall of the spirit that it will not be awarded 2 the coming of Jesus and then the last judgment will not be and all will be erased into dust , except for approximately 190,000 people who helped the devil to defeat humanity ,and Lucifer and those will receive eternal life .to whom he distributed his marks, signs, about 190,000 people (the antichrist, aka dajjal, can command matter and resurrect the dead with the condition that they will not go to heaven), who helped the devil defeat humanity, according to their plans there will be a new Atlantis on earth (a new golden age of humanity) where they will already live foreverand the second variant of the Human spirit on the scale of the planet will be so strong that they will not be able to bring the Antichrist , but will immediately be 2 the coming of Jesus and then there will be a last judgment , and the devil and his servants , it is clear what will happen to them . Well, the last option they will achieve the coming of the Antichrist , but humanity in general will fight for itself and God will let down Jesus and we will win and there will be a last judgment .They are fighting for eternal life for themselves, and for us they want to leave the option that we will all be wiped out and not even bother with the last judgment . The outcome depends on each of you , and your life after death .This information is for you , why in fact the \"world elite\" and more precisely the satanic elite, or even more precisely the committee for the meeting of the antichrist, is engaged in all this .And our task is to stop them . And let me remind you that the world is being developed by industrialists , scientists , farmers, teachers. And Satanists have always killed and slowed down industrial progress .( People like bill Gates, Zuckenberg, Sergey bryl, Larry page were accepted there after they created their companies", "1998? interactive physics!", "and i even got 3 warnings lollll", "Hey Laughability MY BRO MADE A GAMEPASS uganda knuckles and got banned for 7 days lol with robux", "how you havent been banned from the star creator group is beyond me", "Upload an audio with the word \"pee\" and get 1 day ban", "yessir", "a good was to not get banned is to go into illgeal stuff on roblox like big games stealing money dan dev team did not od crap or hack other game you ownt get banned for logic", "you could get banned by just putting a bunch of free models and praying you get a random virus\nhappened to me and I got a warning", "Ban world record speed run", "Dude I got banned for one week for no reason", "This is the most unique video idea and I love it", "epic", "I got banned from roblox under a minute for naming myself My_Leftnut", "mafia", "😳", "God This is very cool", "Yo tell someone to dress as a furry I got a warning for a joke", "Jut type the n word in the chat in worked for me", "u will get kicked from star program lol", "if u upload a nsfw get termed in less then 2 mins", "Bacons on Roblox: Hey you made me get my main acc banned! :(", "I got banned in 10 mins one time", "Just say gay any times", "8:00 69k+ members? warning sent on 4/20? impeccable.", "Hope your fbi agent is not after you", "Nuckles", "I uploaded an image of a person whit out permision to try it on a new account and my account got deleted", "THERE IS A CHANNEL CALLED BOBLOX HAS ITS OWN TRAILER THE NAME OF THE VIDEO IS", "when you realize he couldnt upload the audio because it was a .webp not .mp3 or .ogg", "It biscuits", "Invisible shirts and pants instantly warn you", "I was banned for 7 days for saying \"so you like\"", "Yes, but you are not verified.", "NO BICKTCHES", "its an mp4 not a mp3 check if it says mp3", "Bruh why did that channel only over 500k sub that buur have 1m sub with only 68 video bruh that not funny :(", "You was my second fan of roblox i discoved you the 2019 year", ".", "Like, 38 seconds in and probably already demonitization, if it did get demonitized, rip", "HEY GUYS SQIGILY DIGILY OCTAVIOUS HERE", "Oh laughability It’s smarter to say sub at the end of the video because they absolutely know", "Tomorachi life music at the start", "I have got banned alot lol and on the 6 time it was a long time 2 days and 1 month :/", "Day 110 of asking laugh to subscribe to me and never unsubscribe (has to be on the [real] laughability channel)", "I recently got a warning for uploading an image of a fat cow. (Don’t ask)", "Wait u recorded this on the 21st of April\n\nDATS MY BIRTHDAY", "i- i- i- am ver suprised with that username", "Wait honked man Stan is back less go", "This is some of the word that can get you banned on roblox\n\n*Warning Don't use this i'm just saying the word this May get you account banned*\n\nThis is the word\n\nCum aa\nGay\nF=_£\nBi7©#\nGg\nMother#######\n\nThere you go there are the word that can get you banned on roblox ur welcome....", "Hmmmm", "One of the best thing about dude is that he\r\nnever takes credit for himself when he archives\r\nWe congratulate overselves on this achievement\r\nsomething He always respect us, the audience.\r\nand his team and he is polite in all his videos\r\nmore to come", "The fastest: say \"gay\" 3 times eheh boi", "i did got banned on roblox for 1 week for putting utg in a game (utg means ultimate trollling gui)", "i almost got banned for a image with a person sniffing someones butt"]