["I am such a giggly bicth lmao", "0:52Me when I’m the bathroom! 😄", "0:33\nAnd I already failed\nSTOP MAKING ME HAPPY MARK, YOU ARE MAKING VERY HAPPY\nEDIT\n1:18\nOh No!...", "I failed within the first like 30 seconds oof", "I smiled at his attempt not to smile\nwelp", "Very casual donation hmm 🤔", "Mark said that he destroyed the challenge i’m pretty sure the challenge destroy you", "🥰🥰🥰🥰🥰🥰🥰", "THE PUPPIES ARE SOOOOOOOO CUTE lucky I have my dog rook", "What’", "mark really just saved 200 dogs", "Mark the whole video: :C", "You lost in the first second man.", "Meanwile in the subtitles:\"hiding darkiplier\"", "Me at 0:01 :  C:", "he really casually said \n\"i just donated 1000 dollars to hope of paws cause it was CUTE\"\n like WaAaAaAAAaaaAAAaTTT", "I’ve watched this challenge multiple times and he still hasn’t beaten me up", "I smiled 5327 times so come on over", "When your depressed and you cant smile", "I lost 5 seconds in", "He said oh the emoos. (5:13)", "Nobody \n\nMarkiplier im a giggly bitch", "can we just have mark react to cute videos please ;w;", "I didn’t think he would donate 1000$ he was so emotional this video deserves it", "6:15 \nMark: I DON'T WANNA SUBSCRIBE TO WATCH THEM GROW!!!\n\nThis is why Markiplier doesn't subscribe to anyone because he doesn't want us to grow or get a job", "I smile just as I see Mark (is that weird?), now this will be a challenge.", "My gf broke up and now I was allowed to win the challenge", "Hey does anyone know if Clarabelle got her forever home?", "Literally everyone looks like Mark. The main character from Squid game looks exactly like him. And he also dyed his hair red at the end. Uncanny ....", "EPIC", "...I lost at the first clip. Try not To smile is bloody cheating.", "You know what makes this even easier \n\nBeing emo and depressed \nThat makes it the easiest challenge ever", "Impossible i pull up markiplier jacksepticeye lordminion777 or muyskerm and im immediately smile", "ayyy my dogs name is maggy", "I hate animals that is waist of 1000 dollars", "2:32 what? i wasn't even crying u guys r weak.", "When markiplier donate 1000 i lost it", "Ok, who else lost on the first clip", "anyone here from 2021????", "Marks blood curdling scream seeing baby ostriches is a mood", "0:04 anyone gonna talk about how he said R made me smile?", "You screwed the ehole challange", "The emus having a mental breakdown because he has a ball is soo funny.", "3:30 did he just take out dog as emotional support on freaking try not to smile video", "Mark almost crying about hope for paws and the 1000$ donation made me ALMOST smile", "He has such a cute smile", "Mark your videos are literally the only thing that makes me happy so thank you for making them you are a great person ❤️", "Sees thumbnail or markiplier smiling— contagiously smiles…\nWell, dang. *Lost.*", "Mark you have such a big heart ❤️❤️", "I did not realize this is a try not to cry challenge. The moment he said 'where I Chica?' I lost it.", "Can someone tell me, is this another one of those fake rescue channels?   3:00", "Wow I got through the whole video without smiling I'm heartless", "not lol?", "There's a child watching this you know you can't curse bad word🙄", "why would 3k people dislike this thats sad", "Mark made me smile so I lost", "here before 300k likes", "Anyone who causes animals that much fear and anxiety deserves the worst kind of death that everyone can imagine, poor doggo", "Their not ostriches their emu's", "I would have done a good job at this challenge but you made it hard", "Fun fact: I can just go dead face whenever I want for however long I want, so easy breezy", "dogs man best friend screw people we need dogs", "This will be harder than try not to laugh 😂", "i mean, look at my username. i failed before the video started.", "I literally didn't even make it through mark talking about babies.", "Its impossible to win if you stare at his face", "I need a hug markiplier", "It's our slash made me smile not arm made me smile", "Hope for Paws: Asks for $5 in donation\nMark: *Donates 1000*\nMe: Very kind man", "I’d take a punch for a hug any time.", "First 3 minutes was a rollercoaster", "i didnt laugh or smile cuase im a heartless f**k", "Kinda sad that you lost the millisecond the video started.", "Who else only smiled or even laughed because of Markiplier", "What if I wanted mark to come to my house?", "YOU SMILEY SHIT", "Hope for Paws does have some seriously dramatic rescues. 😁👍❤", "I love your vids", "I lost", "Markiplier:I am a heartless busted I well not smile at this adorableness\n“Not even 5 seconds ago” donate’s 1000 dollars to hopes for paws", "As soon as I saw the darn thumbnail I immediately smiled.", "I almost smiled  at 2:30", "Where i live if you beat me upp you will be in jail.\nMarkiplier", "Ya make me smile", "This video deserves a lot of likes", "Insert mark saying \"giggly bitch\" here", "Am I heartless for saying that I didn’t even smile at the donation?", "I'm a 10 year old I'm depressed 😔 because I sliced my finger i didn't smile anyway", "\"IM A GIGGLY BITCH\" - Markiplier", "mark loving animals for 7 minutes straight", "\"im a heartless bastard\"\n-Markipliar 2016", "he smiled 6:05", "CC: *dying on the outside* me: yes.", "marks least popular video", "Man that dog I bet if they didn’t find him or her it would have been a GHOST DOG", "well this was easy because im sad all the time", "0:42 inside my body, is a baby ? No ı'm not pregnant.", "I laughed as soon as I turned on the vid XD", "Mark: I'm a giggly bitch\nMe: s a m e", "lkumjnyhbtgvfcdx#'[/p;.lokijuhygtfrdes", "Damn that baby ostrich got you good", "Do this when you’re tired", "I lost at the first video", "Mark:\"If  smile i will come to ur house and beat the shit outa u,the hug u\"                                                                    \n\n\n\nMe:\".......Ayone else smile at this sentence?....nah?.....juss me?\"", "half the time it was try not to cry", "Chica was prolly like: what the HELL DAD, PUT ME DOWN", "This is just a Try Not To Cry video in disguise.", "I would smile just to be beaten then hugged :D", "Is that a umu", "Dogs are better and more adorable when they are in an oven, it's just another thing them and kids have in common.", "Least viewed video", "It's funny how he was supposed to be trying not to smile but then he ended up donating $1,000 to a charity lol. Seriously though I think we could all learn something from mark", "Cute.", "It's been 4 years and I'm still living in fear Waiting for mark to knock on my door lol", "Me: purposefully smiles cause I wanna hug from Mark", "I smiled on the first one!!!!😆😅🤣😂🥰☺", "Try and make a video that is. . . .\n\n*Try not to look at animals challenge |With a Eye tracker!|* LOL", "I was crying when you were reacting to the video about Clarabelle. And when you donated. You're a good man Mark. A very good man.", "I smiled", "Mark: Just a giggly little sh*t \nMe: I- \nLmao 😂", "I laughed at Mark’s reaction to the HopeForPaws video 😂", "The thumbnail is creepy", "Voices in his head. I think i am paying attention to something that has no meaning. Blane game theory but i think there is a meaning to why he said that.", "And he's smiling the WHOLE TIME", "2:38 Is it try not to cry instead of try not to smile challenge? Bruh its so sad seeing him to cry", "I smiled", "It wasn't impossible but Mark dying in the corner makes me laugh so I lost.", "I didn't even smirk this whole video....", "Mark: 😆this is the hardest challenge in my life Me: the whole time 😐", "Markiplier: Where is Chica? let me cuddle with chica\n\nlater...\n\nMarkiplier: There you are Chica! can I cud-... WAIT NO WRONG CHICA AAAAAAHHHHHHHHH #*$@ AAAAAAAHHHHHHHH!!!!!!!!!!!!\n\nMarkiplier: dies by jump scare \n\nChica: YEP!... I am the FNaF Chica!!!!! >:D", "And I hope he never comes although meeting mark irl would be amazing", "I smiled but he’s not here yet", "I’m just imagining Daniel Ricardo trying to do this challenge. Guy would fail in 10 secs, or maybe not even that!", "I smiled at the first doggo. I love dogs", "i was laughing-crying on the first one", "How to make your facial muscles hurt for 7 full minutes!", "i lose at the first time. ITALY", "1:42 I remembered as a child I looked out the window and saw a gang of stray dogs tearing apart a pregnant cat, and I filled with disgust. Almost all videos about dogs. Ostriches are ugly and stupid. And finding men cute is gay. It was too easy.", "Such a good pupo 😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭🤯😭😭😭😭🥺🥺🥺🥲🥲🥲🥲🥲🥲🥲🥲🥲god bless mark and the dog", "Mark you should do a charity stream for things like dog charities, which truly don’t get as much attention as they deserve", "1:15 oh god XD", "5:04 ah shit it's a ghost", "I lost when mark donated 1000 dollars. What a guy.", "Why is this \"challenge\" so easy?", "I SMILED WHEN HE DONATES 1000 DOLLARS WTF HAHHAAHHAHAHAHAHA", "Hmm 2021 is still shit lmaoo", "MARKIPLIERs face made me smile", "52695kulhgghljjg", "So wat is so lame", "what we say: Doggo\n\nwhat Mark says: *P u p p o*", "*My guy donated 1000 dollars without thinking about what he's done.*\nHe's rich, but he got a good heart.", "marks dog won", "Sike!! Eyore", "Eyore", "Eyore", "Eyore", "Eyore", "Eyore", "Eyore", "Eyore", "Eyore", "Eyore", "Eyore", "Eyore", "Eyire", "Eyore", "Eyore", "Eyore", "Eyore", "Just one question....\nwhy do all fuckin people find dogs cute?!?!?!\nI mean they are cute but not as cute as people claim through there fukin over reaction...\nDogs are overrated!!", "4:05 me and my BFF want to be singers and we knew if we did become successful singers we would donate to lots of different things, I would donate for all animal shelters and my friend will donate to help people :D (if we become famous singers)", "Me before watching: LOL I can tell by the thumbnail that he lost", "Does mark smiling upside-down count?", "Mark: 1:14 \n\nMe: I smiled when you said that part.\n\nDid that count?\n\nSo what time do I expect you to drop by? Lmao!", "I’m not a fan of dogs so I pretty much kept a straight face the entire video", "Try not to smile challenge but mark smiles the entire time", "The only thing I smiled at was you holding chica", "I don't think you well go to my house", "I just need to remember my mom’s 9/11 trauma and my physical trauma.", "Jesus I'm a cold bastard i didn't smile once", "Pre mr beast.", "So, when is my beating?", "\" It's two grown men being cute and adorable! \"\n\nUnus Annus in a nutshell", "is it just me or does mark look like he is always smiling?", "man i love you i was feling sick and bad mad stufi just wached these im happy and feel  verry fucking good like my sicness gone thank you", "try not to donate challenge", "me watching this: yeah sure come over to my house.\nme now: dude I'm still waiting.", "Mark lost on the first video.", "STOP MAKING ME LAUGH SO HARD 😂", "Mark saying puppo makes me smile lmao", "Mark seeing ostriches Mark: no oh God please no no no They are too cute!", "Couldn’t not smile before the challenge even started.", "i didn't smile now I feel soal less", "I smiled so Mark will come over to my house and hug me after punching and kicking the crap out of me. 😅", "Markiplier is the only human being I know of that can frown so happily.", "I didn’t smile  I love sad and pain 👍", "did anyone else notice the Adam Ruins Everything episode? ...no? ...just me? ...okie-", "Markilplier: sees good doggo. Markilplier ill be right back. comes back with a whole as dog in his arms like a puppy", "I really wish you live a very happy life mark forever \nYou donated money for animals \nLove from family brother", "4:43 If only australians had this during the great emu war in which they LOST", "2021: still cries at hope for paws video", "When you see the word meme you can't unsee it", "i failed on the first one because it was so cute.", "Hi Mark. Thank you for making me not want to kill myself.", "Me: smiles and says awww \n\nMy brain: stop it he's gonna beat the shit out of you\n\nMe: oh shit... your right *smacks my face* ouch", "depression: cured within the first video", "I smiled it was so cute😍😂", "Whose here in 2021 lol anyways mark you’ve come so far in 2021🙂👆", "Who else is watching this in 2021", "I watched the whole video on mute thinking that he was trying to make a gag video or something", "mark: crying\nchica: lol who tf is that guy", "I smiled COME AT ME BOI", "Dogy:😭 me:poor doggy 😞", "mark watches game theory😂", "Mark smiled at the intro 💀", "Markiplier: *Casually donates 1000 dollars*", "I've been waiting on my beating and hug for 4 years now. he lied to me.", "5:59 The timing made it look like the ostriches got scared by Mark’s yelling lmao", "I couldn’t get passed the intro, Mark just makes me smile", "Anyone hear in 2021? If so, how was ur 2020?", "he smiled at 0:00 :)", "Markiplier: I'm gonna beat the **** out of you if you smile\n\nIdiotic me: *smiles while realizing what I just did*", "2020-present: new day", "Baby ostrich: *exists*\nMark: NoOooOoOoOOoOOOoO", "Me: Not smiling or laughing to the videos\n\n\n\n\n\nAlso me: Smiling and Laughing at the comments", "So...hard bro", "F*** Samsung", "I already smiled when he threatened me at the start of the first clip 😂😂😂", "Hey Mark", "2021 still crys at hope for paws video", "mark i smiled. laughed, even. WHERES MY HUG??!?!", "4:43 its like 1 am and that was the funniest video in the world at the moment i cackled so hard 😭 ✋", "hello, you giggly bitch", "Mark: I gotta hug Chica!!\nMe: no... mark just no!!! Waaaaiiiiittttt yooouurrrr ddddoooogggg.. IOOOOOOOHHHHHHHH", "Mark:we are doing Try not to smile.\n\n\nMe:you won't to I don't smile or happy because watching you?\n\nOH HEAL NO!\n\n\n\nMARK:YAY", "Hope for paws video- donate 5 dollars to help us find a loving home for this dog\nMarkiplier- donates 1000- take my money bitch", "No wonder he is a giggley bitch", "4:00\nIf you don't smile at that, you literally have no soul", "I dmyoI", "Wow wow oh oh my IM HEARTLESS", "I know how to not smile. Just hold your mouth open.", "I failed as  soon as chica was brought in", "\"Is that a baby imu?\"\nMark 2016", "LOL MY CAPTIONS PUT mmmMMMMMMM *dying on the inside* LOL", "Already smiling before the funny stuff even happens lol", "How to not smile while watching this. \n\n\n\n\nJust have your parents screaming about divorce in the background 🙂", "Damn this is nearly at 10 Million views", "That threat at the beginning of the vid make me lose", "Hi i smiled", "4:12 he named his dog after a fnaf character", "The first one was just the dog being stupid", "He hasn’t even gotten to the video and I’m already laughing. But that does not count!", "ITS A FOOKING EMU\nHIS NAME’S WARRUS\nHES AN ASSHOLE", "i wanna see a \"try not to show emotion challenge\"", "I didn't know how much I needed to see mark clinging to chica while watching an abandoned dog rescue video... 🥺😂", "Everybody wants a dog like Chica.", "Ez", "i honestly didn't smile. am i okay?", "Mark try to play Minecraft with me (my mine craft name curldbaton) so my logo is a football with a blue background", "I laughed the day this was posted and mark still hasnt hugged me :(", "This video had to make the emo kids smile😂😂😂😂😂", "I wish to have so much money someday that I can just donate to charities on a whim and to commission my friends", "2:46", "Hahahahahaha🤣😂", "Try not to smile.\nIs about doggos.\nMark fails instantly.", "I miss when mark had his hair dyed red", "I’m a giggly bitch \n-2016", "R u playing roblox", "As soon as he got Chica I couldn't tell if I was laughing or crying", "I immediately failed just by looking at Mark's face", "I’m very very bad at not laughing", "I was surprised to see this video, along with the person. He knows Indonesian, and oddly enough, the language used is everyday language, I salute this person. if you don't believe it, activate the subtitle to Indonesia", "HEY MARK! please react to more Hope For Paws videos! Thank You! keep up the awesome content and also please do more Phasmophobia!", "BABY OSHTRIDS", "pupy in the water", "IT GOT OUT", "por pupy", "Livingbeyweenworlds this year: 2020 WE ARE ALL FUCKING DEAD", "Im smiled come and beat the shit out of my,but thats not gonna be easy 😉 and i will hug u❤", "''If you can't try not to smile''\n ⇓\n ⇓\n ⇓", "Stop lying to yourself you already know that all of these are adorable in every single way you are you do you have a heart you are not a silly person nor my dumb self", "0:58", "Me: OK i can do this i won't even move my cheeks.\n*Dies after watching the first video. god damnit", "Who's watching this video in 2021?", "-3-", "5:00 OH SHIT! A RAT", "THIS MAN IS ADORABLE", "It wasn't even close, that I would show any emotions...", "2020: no soul left in the body", "At 30 seconds of the video: *me already cracking up*", "I still come to this video regularly, every single time I need to pretend I'm not smiling but have a giant goofy smile plastered on my face.", "Good job mark. Help the needy", "i just came back to this video specifically to donate", "O S T R I C H", "My favorite quote of all time\n\n“If you smile, I will come over to your house and beat the shit out of you.” - Mark", "then the owner will eat the ostrich o.o .. well", "even know it was made 4 years ago and its allmost chrismas", "i love it so mutch", "you have got a dog named Chica???\n\n\n\nthanks for the inspirating for my first dog! :D", "yes that is a emu thay live in atralea", "I'm glad I'm not the only one who has the 'must hug dog' response to sad/cute videos", "I saw hope for paws and i clicked, funny thing, i accually saw that video.", "I fucking love how he'll donate so much money to a dog charity, without thought- 😔💞", "Don’t say bad words kids are watching", "I will. Bet the shit", "HOLY SHIT YOU DONATED A 1000 DOLLARS TO DOGS THAT WAS A WASTE OF MONEY", "If I don’t stop watching YouTube my cousin will smash my head into the keyboarkjkutfddyjkiuhuftfyucdcdfffhgkffctj§fyt", "Who else got this in their recommended after 3 years?", "Baby ostrich: exists\nMark: NOOOOOOOOOOO", "4:04\nThis is the exact moment i smiled", "Then hi then giggly botch LOL", "markiplier made me smile before he even started the video", "Thanks for making these videos Mark, they help people smile in dark times ♥", "God i  have a dead heart watched all through and didn't smile nor laugh once!", "Guys don’t worry I smiled and mark didn’t beat me up too bad. And after we went out for Pizza Hut and ice cream", "Oh mark it's called humor which most don't have\nAnd I'm waiting for you to beat the shit outa me so I can get a hug", "When he said emu i thought he said uwu bless :)))", "When I saw that wiener dog in the beginning I just started crying. Today would’ve been my wiener dogs birthday and it’s the first year I remember not having him here for it 😭", "I’m so bad I smiled at the first video", "Mark: donating 1000$\nMe: mark is a great hero", "I lost", "4:05 \nAmy: Mark? Why did 1000 dollars go out the bank?", "Me being here in 2020 🥲 I love mark 😌🤍", "I wish I could be half as cool as that corgi at the beach", "WHY IS THIS VIDEO SO GOD DAMN CUT?!?!?!?!?!?!?!??!?!?!?!?!?!!?!?!?!", "BITCH WACHU TALKIN BOUT, THAT IS TOO CUTE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "If you dont want to smile then look angry and hold your fist and just look angry then you wont smile", "Mark is pregananant confirmed", "I lost at the second one", "I looked up smile dog and this was here", "Heyyyy", "I smiled should I be concerned ;w;\"", "I am still waiting for you to come to my house and beat me up- erm, hug me", "I smiled at the beginning of the hope for paws video", "I was about to smile at Mark's reactions, not the videos somehow-", "I smiled come and beat the shit out of me Mark", "Few months ago I was having some issues with my husband which lead too leaving each others, but today am here to give all thanks to Dr jarfa for making me smile again, right now I'm very very happy seeing my husband back with the love spell of Dr jarfa did for me.  You can WhatsApp him on this number +234811 869 5823 . Thanks once again Dr jarfa\n1) court spell\n2) Lost Love Spells\n3) Divorce Love spell", "Mark, I know I have watched this so many times, you're not a bitch, you're a giggly person. You are a nice person.", "Wow my first challenge that I have won!!  Stone cold face", "I'm a cold heartless bitch because I didn't smile once", "Chicka sitting there like: 👁👄👁 im a babyyy", "When Mark started crying at the dog under the porch I could feel that 😭✌️", "I almost smiled in the first clipx", "is it concerning that I didn't smile or laugh at all?", "You know, that would be the real joy of having a high paying job or just coming in to a lot of money. I mean I still do donate when I can, and I know every bit helps, but to drop $1,000 like that... I work with an animal rescue as a foster, they can do so much with that.", "Hi I am KK it my Nickname I want to say I always wanna plushy of five nights at Freddy’s", "Ummm this was not 1 sec ago this was (as long as u stay at school for)", "I smiled when mark said he would beat the shit out of me.....I don't know why.", "if u wanna see more of the animal rescues look up (hopeforpaws) on youtube", ":>", "I won", "How... how have I not seen this one?", "mark:\"DONT smile  if you smile i will come over to your house and beat the $h!t outta you and then hug you\" \n\nme: interesting ... i want hugs \nalso me: smile jazz SMILE", "Why the fuck is he watching cute videos instead of funny videos", "Why the fuck is he watching cute videos instead of funny videos", "this vid almost has 10mil views", "Chica: Wwwhhhaaatt the ffuuuu", "mark. it's emus not emoos. just it's spelled e.m.u", "Omg baby Ostriches", "So cute", "Chica", "Giggley bich", "i smile", "I am a hater of markiplier", "Marks expressions made me fail", "You made me want to rip my rib cage and just oh my God I can't resist it I'm trying to but I just can't I can't", "DUDE YOU SMILED IN THE SECOND ONE YOU DID YOU WERE HUGGING YOU DOG AND SMILED", "Chica at 3:36 in the video is looking like she's sitting in a chair", "At the sight of the hope for paws, I had to get my dog who is also a rescue. I just needed a good dog with me.", "He should try not to smile to Gary the axolotl", "Oh god I cried when he started crying. My heart was too full.", "Mark you can beat me up if it means I get to meet you!", "I smiled", "I didn't smile... \n\n\n\n\n\n\nAm I a bad person?", "feel the love'", "aaaaahhhhh my gay heart", "November 2020: Markiplier has long hair", "Mark Edward Fischbach I think you smiled.", "Tries not to smile\nSmiles in first frame of video\ndasgustang", "Try not to smile\n\nMark (and me): smiles almost the entire time", "make sense. He's a cancer ♋️", "ILL PLAY WITH MARKIPLIER", "and by the way this animals are so adorable that I almost can't  stop smiling! <3", "You are such a good person and good people donate money to save peoples and other animals lives. They will be so thankful. You teach children to good. Thanks! <3", "Mark: If you smile, i will come over to ur house, and beet the sh*t outs u, and then hug u\nMe: Smiles as big as i can and then bigger", "I just smiled all the time and now I'm dark inside", "Anyone else fail because mark donated", "“It’s two grown men being cute” 😳", "You look like gaurav from getsetflyscience", "0:39\nMarkiplier :im a joy heart\nMe edit's markiplier playing get over it", "This makes me want Markiplier to have a try not to cry challenge", "I loft at the vids pleas mack moar", "I absolutely love that you donated to hope for paws. I've been watching them for over 5 years and they travel all over the us and even sometimes other countries just to save a dog. They rely on donations to save these animals. A few times they have saved kittens and many videos get me to tear up. They are so wholesome and I love them to bits and pieces. If I could help them j would but I come from a poor family myself so most I can do is watch and hope they can continue to help out the animals for many more years to come♥️♥️", "I have that same looking dog", "Mark: dont smile or i well come to your house and beat shit out of you\nAlso markiplier: *smiles*\nViewers: *VIEWERS OPEN UP*", "Mark: Baby in me? No I’m not pregnant that’s not right. \n\nAmy: 😳🤫🤫😳", "2020 anyone", "Is it bad I laughed at the sad dog part", "Markiplier just makes me smile\n(And laugh)", "no memes huh?", "I’m taking on the challenge I’ll let you know if I lost or won.", "i... need... mooOOOORE!", "Markiplier confirmed pregnant", "My score:\nSmiles: 0 \n\n\n\n*pls send help*", "I forgot he just casually donated a thousand dollars to hope for pass in this video", "Is it bad that i smiled right as mark started the vids", "I’m glad he donated :)", "Like I strugelld more then you on the first one", "Try Not To Cry", "Hi", "This was so cute :3 A worth while challenge", "\"Hello everybody, my name is Markiplier\"\nMe +smiles+ Goddammit 😑😆", "chica wants to die; by chica - chica", "I won", "I smiled on the second one :P", "Im a stone cold heartless bastard", "Aw the baby omo", "5:54 kILLED ME", "Baby inside", "Tbh I didn't  smile", "Just watched jacks that dragon cancer video. Need this challenge rn", "Mark.... I'm still smiling... I'm waiting for you to hug me... mark?", "It’s a fokin emu. His name is warrus", "Mark: you cannot smile\n\nMe: dw man I’m already dead inside", "Mark: *watches puppy videos and smiles*\nMe: *smiles*\nHope for paws vid comes on \nMark: *starts sobbing*\nMe: *WAAAAAAAAHHHHH* 😭😢😢😢😭😭😭😢😢😢😭😭😭😭", "I gave up in first 2 seconds. That dog was cute", "damn that i need to hug chicka made me cry like a baby. actually no it was like 3 tears so to me the same thing", "i want that lab in that hopes for paws video, i fell so bad for that dog suffering under metal scrap.", "I LOVE HOPE FOR PAWS! I was binging their vids a couple days ago and got so emotional I donated my last $5", "i understand how everybody is talking bout mark just dominating 1000 but like are we gonna ignore how he just held chica like she was a lapdog", "If you didn’t smile at hope for paws you’re a heartless human", "Looked up wholesome markiplier, this is the first video to pop up.", "If u smile I will come over to ur house and beat the shit out of u markiplier said \nMe: you smiled at the beginning without knowing", "it would be an honor to get your shit beat by mark", "Mark needs to do a entire video about hope for paws they are AMAZING and they bring me to tears there entire job is to rescue and nurse animals back to health", "Actually it’s not emu it’s eeeeee mew, and that’s the easiest way to pronounce it", "Hope for paws is an awesome organization! I’d love to donate a lot of money to them one day to help save animals :)", "Mark: \"I'm a heartless bastard\"\n\nBro u literally just donated $1,000 to a dog shelter", "Oh hey I happen to need a hug. Mark, I am sorry to inform you that I smiled.", "\"I'm a giggly bitch.!\" - Markiplier 2016", "Fun fiction:\n\n\nBaby emus are called... umus\n\n\nuwu", "I needed this...I needed this a lot", "I'm a cold hearted bastard and didn't smile once", "I clicked for the smileing challenge but I ended up crying", "As soon as I saw the Hope for Paws video, I immediately smiled in tears.", "\"It's two grown men being cute and adorable!\" \nThe story of Mark and Ethan", "Awh i smiled 1st one 😂😂", "4:58 what is that little boy playing with ball", "And Smiled.", "I laughed.", "Nice you donated 1000 just cuz a vid, too cuz it lookked like chica 😇", "Mark: *watches dog similar to Chica*\n\nChica: why are we, just to suffer", "... I wanna hug my cat anyone else wanna hug their pet😅", "Kid watching this: \"learn how to bad words\"👁👄👁", "Chica: clearly not happy", "Wow I did it 😐", "Game theory?", "Did anyone else notice he smiled for a good portion of the video?", "Me: *has depression*\nAlso me: *sees videos and still has depression*\nMarkiplier: *laughs*\nMy depression: am I a joke to you?", "rt", "I was just crying and this has done nothing but make me feel happy and like everything bad isn’t my fault... I haven’t felt that since the last video I watched of mark(before I started crying)❤️", "Mark calls 2 smiling grown men cute, mark gay confirmed", "GG", "2:12\nMatpat is in the recommended like:\nAww! Cute animals! Now let’s ruin his childhood dreams.", "Mark: it is so cute \nEverybody: always has been", "Chica made me smile 😊\nWhen she hags her", "I just destroyed this challenge, but now im just depressed", "I’m proud to say that I lost", "I needed happiness today.  This helped me so much mark. Thank you  for all the time and effort you put into making these videos", "Is it bad that I am watching this in 2020 I literally failed when he was watching the the birds 🤣", "Desene bu çelıncın anasını avradını", "I DIDNT SMILE I JUST CRIED", "Mark: I'm a heartless bastard I will not smile at this adorableness.\n\nAlso mark: smiles while saying this", "1:12\nMark: This ones called \"Dog tries to stop stream of water\"\n\nMe: *smiles at the title*\n\nMark: *a second after I smile* DONT SMILE", "Mark: Two Grown Men Being Adorable\nMe: No, Mark. There's three. :)", "Does it count if I smiled during Mark's intro?", "I go to bed to his deep voice I’m not gay just like bass", "I still smiled", "You can't smile but you can laugh tho", "I did not smile but I was crying without smiling it’s caused me pain", "1:53\n\n\nMarkiplier says it’s not cute me😍😍", "*dog video plays*\n\nMost people: *try hard not to smile*\n\nMe: that dogs gonna die someday.", "I didn't smile at any of them except for Mark's dumbass comment in between videos", "Mark: brings out chica\n\nEveryone else: smile intensifies", "Markaplaiar Just donates 1000.\n\n\nMe:yes....you did good...yes", "Everything becomes funny if you're not allowed to smile", "The amount I had to clench my teeth to not smile", "If you wann beat me then meat me in Frankfurt in germany", "I didn’t even start the video and I’m smiling", "Am I the only one smiling bc of mark and not the dogs?", "2020: 4309", "I friking love you Mark", "Wait...what does join mean join what?", "I ain't smiling, emus are cunts most of the time", "Mark i just want to thank you for posting videos because in this portion in my life i have lost alot of loved ones thank you for bringing a little peice of my life back", "I was just crying because some girl were bullying me and I remembered how much markiplier has made me smile throughout the years and has cheered me up when things weren't great. I don't know if you'll ever see this mark but I want to thank you for everything I love you💗- cloe Sheperd ps I hope one day I get to meet you", "Mark don't worrie I'm a giggly BITCH and plz come to my house ;-; and now your crying help me ;-; I'm crying and now i smiled welp now you have to come", "Mark: I am heartless bastard\n\nAlso mark: donates 1000$ to hopeforpaws", "I obviously lost this because toby fucks made it illegal for me yo atop smiling", "It's try not to smile not try not to cry so what did you expect???", "Am a kid don’t beat me🥺and you have to go on indonesia cus i life on indonesia 😑", "3:27 i thought chica in fnaf", "Dude! Mark is making me smile, not the video!!", "“It’s sad really...”\n\n-Momiplier", "IM 9 AND I WON THIS", "I don’t smile from the videos it’s Markiplier that makes me smile", "You smiled on the first video.", "5:55\nMe:*just smiling the whole video", "No anime girls. 0/10", "*video was published on 2016* \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMe: *HOW DID I MISS 4 YEARS?!*", "5:47 the bird is emu", "I didn’t smile even once", "3 years watching still relatable😅", "Hey you got for dogs", "The first video hasn't even started and I'm smiling", "I am realy good at not smiling", "I smiled on the first 1", "When you’re watching the doggie try to stop the water from running into the gutter:\nCute\n\nWhen Mark says “Puppo”:\nmultiplied by 1 million", "I wonder what your bank is thinking", "Your a giggly bitch", "Mark: Don't smile, if you do I'll come to your house and BEAT THE SHIT OUT OF Y—\nMe: **smiles intensely**", "I started watching these videos desperately trying to smile and be happy... instead I made myself worse and I am feeling like an unlovable POS..", "I smiled. Come get me!!", "I am feom the future", "I am 1 second in and i wanna make a bet to myself that i will not smile. At all. At the end of the video i will report weather i have succeded or failed (as usual)", "did anyone else purposely smile at the beginning bcos they lowkey kinda wanna hug and some company", "Do a challenge try not to cringe", "Only a guy like Markiplier could donate a thousand dollars to an animal shelter without thinking twice about it. Love ya, Mark ❤️", "I think I'm dead inside because I just watched two of these in a row and didn't smile or laugh once", "Wow, I cried when the dog covered his eyes", "The vid of the dog being saved was so intense he had to bring chica into this\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnd even she smiled", "I didn't smile but the first one almost got me", "I didn't smile............................", "markiplier: if you smile, ill come to your house and beat the crap out of you\nmy brain: markiplier world tour", "Is it sad I didn't smile at any of these T^T...", "His scream when he sees the baby ostrich’s is amazing", "u siled!!!!!!!\nhaahahaha", "Literally smiling the whole time lol love it", "0:39 Lmao!", "Markiplier: * Talking about the video and trying not to smile at all *\n\n\n\n\n\n\n\n\n\n\n\nMe Being A Random Dumbass: \"I Smell Noodles..\"\nAlso Me: \"Wai- What... Nevermind, imma continue to the video now..\"", "This hits different in 2020...", "I think I adopted my cat from paws! His name  is Leo.", "You lost on the first round", "NO JOY IN OUR SOULS\n*3 minutes later*\nOK SO I JUST DONATED $1,000 TO PAWS FOR HOPE", "Meet Markiplier, the giggly bitch who donates to charities without thinking twice.", "i lost the challenge when mark said “frick a dick”", "I'm in love with Chica...", "I’m usually a stone cold bitch but I literally cracked at the first video.", "Are you very tricky if you’re not gonna smile just like Laughing?", "you failed in the intro you smiled through the whole intro", "WTF r u pregonate???!", "Your funny", "Threes chica at 5:44", "Watching him. Watch the videos was a try not to cringe challenge.", "0:56 😂😂", "2:22 That one really makes me want to smile", "4:43 I saw a vine for that", "Mark you are a saint!", "I would do anything to get Hugged by Mark. Mark beat me up I want a hug!!", "Smiling on the inside😁, stone faced on the outside 😐", "try not to smile challenge. Loses in the first 3 minutes.", "I have to smile otherwise I'll have a depressed day.", "_This Man and His Friends Are Total Legends._", "The worst thing about this is I use to have a German Shepard but she passed away this year sooo..... I didn’t smile", "I hope that Hope for Paws watch Markiplier watch their vid and automatically donates. So gold. Like the Golden Retriever popo", "That was nice of you to donate. What a standup guy.", "Dude fuck I finished this video and now I’m sad that there’s no more happiness", "Dang it I smelled at Chiecu", "My balls", "Me, walking to my mom to talk about how much of an angel Mark is:", "My face was this😑", "Did anyone see the baby ostrich run into the wall", "Soooooo... what time are you coming over😐and are you going to use an object orrrr.😂", "In the look of your face your already smiling", "I stayed stone faced the whole entire video... do i have a soul?", "This video made me cry 😢", "The cutest part was when Mark kept saying “I need to hug Chica!”", "Ummm... I laughed but did not smile... Did I win?", "“Don’t smile! If you smile I will come over to ur house and beat the SHIT out of you, and then hug you”😂", "2:25 WHO IS MAGGIE I WARSHIP CHICA!!!", "5:44 Did anyone notice the second row 3rd video?", "I lost the second you started the video because you're a amazing guy", "\"Dog trieng to stop water\" is more cute than funny (Lenny Face)", "Mark: if you smile I’ll beat the shit out of you\nMe: *already smiling* fu-", "Mark looks like a very manly guy but could laugh and smile so much😂😂😂 (this is not a stereotype against men ok)", "2:53 this video is called try not to smile not try not to be sad omg =-=", "you smiled xD", "I smiled", "id love mark to come here and beat me up", "\"ohh, the umus!\"", "Mark  Has eatin a child confirmed", "If I did these videos I would be the most boring YouTuber to exist", "I honesty smiled on purpose so mark would beat then hug me so someone can hug me for once", "*I'm not laughing at the video, I'm laughing at Markiplier's reactions.*", "Why are those corgis at the beach cooler than me??", "I failed harder than you...", "Ok deal but if you smile then we’ll lock your doors.", "Omg!! Sooooo cute!! ❤️❤️", "Mark thank you for being a giggly child so I'm not scared", "Hope for paws is actually a really good channel and cause check them out"]