["Paw patrollers", "This video was truly emotional and in the end i coudnt control myself", "I love everyone on the lifesteal smp", "Name will be spoke", "Name your base black base", "The island should be called “Your moms shoe”", "This coud have been a wonderfull friendship. Reddons and Spoke.", "Wow", "the legend, the king of destruction, the master of anarchy, and an amazing freind, Spoke.", "THIS VID WAS 🔥🔥", "The name should be spoketopia", "man u better than roshambo in history", "Part 2!!!!!", "Congrats on 500 k", "Hi I am new and I don’t know the IP address", "So good", "ima unsubscribe", "pp", "AYY 500k! GGS SPOKE!", "Uh, bruh", "Him: \"netherite armor is illegal\"\nAlso him when grinding the wither: \"i survived the wither with 10 hearts and maxed out netherite\"", "20:00", "tthe found", "I’m OG", "Call it “the most liked comment”", "Yo HALF A MIL", "Congrats on 500k :D", "Mojang:Es la revancha hhahahahahahaaaaaaa", "Hm?", "The biggest plot twist", "Finally", "Hi", "NFT Land is the name", "saw raid stream :) good video", "500K POG", "so many twists", "20 minutes of my life wasted", "When you said I have a heart for you that I stole from the chest upstairs I laugh soo hard and I replayed it 5 time!XD", "Sheeptopia", "sup", "Spoke army", "This channel is legendary as ever", "The towers", "AYY SPOKE JUST HIT 500K SUBS", "the unspoken should be the name", "O", "He could have just watched your videos", "Name the civilization the candy name that you and your allies went by in the beginning to this server. (I forgot what it was).", "MAN THE PLOT TWIST SHEEEEEESH", "Dingle burg", "Deez", "SKEPY RIPOFF", "Reddoons sucks", "500 thousand subscribers! congratulations!", "congrats 500k", "huhyeahhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh", "Hi", "Pleas don’t destroy life steal but I love your videos", "call it Shrek's Lair", "Killer Kingdom", "For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord. (Romans 6:23)\nWhen Jesus heard it, he saith unto them, They that are whole have no need of the physician, but they that are sick: I came not to call the righteous, but sinners to repentance. (Mark 2:17)\nFor godly sorrow worketh repentance to salvation not to be repented of: but the sorrow of the world worketh death. (2 Corinthians 7:10)\nI tell you, Nay: but, except ye repent, ye shall all likewise perish. (Luke 13:5)", "Da wae", "I like lifesteal but im not able to join", "THIS IS POGGERS", "What a vid", "4:03 am i the only one that heard the last breath music?", "congrats on half  a mil", "It was so anticlimactic", "what datapack/mod do you use for hearts", "Doom City", "The 3 heart legend", "Nice Work on getting back on Track with ur hearts, but you should get revenge on reddoons", "Nice video", "The coolest channel I've ever seen", "1 more k", "star legends", "THE WORLD SHALL BURN!", "The empire of Pee Pee Poo Poo Land has begun.", "Sussyland", "Remember when you made 100 days videos good times", "Ay I’m tryna join", "Call it g", "SERVER WAR 2?\nReference : He said that the guy is rich evil man (at least i think) which is like  Adolf Hitler WW2\nLuv ur vids", "Tommy: pog champ", "Name it \"Bamboo civilization\"", "the name should be called urmom", "Nice", "subscribed!!!", "Bro 4:01 was the best part lol", "crafting hearts does not look hard", "The hidden city", "This is by far the most messed up plan I've ever heard of but where is clownpierce", "Your mean", "Almost 500k congrats 👏👏👏👏", "Ashswag", "You r a legend", "Spokesvil", "LETZ GO", "Reddoons and Terrain had to get hidden or spoke is gonna burn them into ashes", "I love you", "I love you", "The coolest part of the video 3:57", "I call it the jungul (i misspelled that jungul of city or the city of the jungul or just the jungul island (i copy that from you)..", "Front mansion hope this makes it but probably not", "The name should be Pogtopia", "CALL THEM!!! GET REVENGE ON THE ROOB AND TPY", "WHERE IS THE TWO LEGENDS CLOWNPIERCE AND REKRAP2!!", "you are so evil sometimes 😂😂", "Ah daddy ogway", "you couldve just have parrot join you in the destrution", "Mesopotamia is the world's first civilization fun fact spoke", "4:09 his lvl is 69", "Spoke is mad", "THE PH NATION", "Ur so mean", "*Civilization* easy name", "Nice", "This is it new season for lifesteal coming!!!!!! I am definitely gonna apply", "If Spoke Is on lifesteal,No one can make better videos", "How parrot comentet and you don't get band😶", "I got unsubbed wtf", "I use your skin", "This looked more like a Netflix web series rather than minecraft", "turtle neck island", "I love there friendship ❤️", "“Spokers”", "You should get a army of dogs to attack", "Why did netherite armor get banned", "spoke why did you betrayed clownpierce and parrot I saw in clownpierce video you were teaming against clownpierce and parrot and Tommyinit why spoke you teamd with princezam and mapic and Leo why spoke", "Netherite chestplate  has 2 more", "Ok great but why", "ITS BOUT DRIVE, ITS BOUT POWER!!", "Reddons is evil  😈😈😈😈😈😈", "Clown is king of lifesteel", "Lol, when the intenstse music, I gRiNdeD fOr sOmE sAnD", "Clownpierce joins the server. Redoons and Spoke be like: Yeah we dead", "NAME:THE GOLDEN HAND", "MUHAHAHAHAHAHAHA I LIKE HOW U THINK", "How 'bout the \"forgotten civalization\"", "I Have Your Skin", "Can the name be the resistance", "THE POWER TOWER \nPerfect name😊", "This was an amazing video", "the named should be 'THE SLAUGHTER HOUSE\"", "Bro reddoons must pay for this. You must kill reddoons.", "O m g", "When the world needed him most, he returned", "ayo Spoke using a Risk of Rain 2 soundtrack? Something I never thought would happen", "I really need want to see the fight between spoke and redoons", "Call the base Jeff", "call it APEX please", "Empire..", "THE CRINGE ahhhhhhhhhh", "THE TWIST THO", "10 stacks of tnt sounds like wilbur soot", "fort \"woteh\"", "Cor-dana", "Cordana is the name", "How did parrot make a coment on the video and see the things that spoke did illegal and not get banned", "ok", "call the civilization spoke island", "😡 boohoo  I hate you for killing your friends", "cring", "\"Banana Land\"", "So what happened to George? Why do you suddenly have 4 hearts? Why did you spawn in obsidian? You can’t just disappear for a month and suddenly we’re on a new universe.", "Spokes land", "Ye", "9:30 hungarian dance?", "its called bob ross", "Finally Spoke is break rules again like the good ol’ days", "Name it questa nocci (deez nuts in Italian)", "are you sick? ._.", "You should team up with rekrap", "Wait  what", "You shouldn’t of killed parrot", "14:55 transition is insane", "\"We will take over the server\"\nClownpierce: i dont think so", "The best lifesteal smp video ever made", "when did technoblade make is name redoons", "reddons vs clown clown will still win lmao", "i love your plot twist and all the things...", "I het you guys", "this is so fake.... or not", "“We will be getting hearts…”\n*focouses on a Clownpierce and plays Last Breath Phase 3 music*", "I clicked on video and came among us add", "Do a heart for me", "Are you back in lifesteal smp?", "The legend is finally back your one of the best Minecraft yiutuber", "😃", "THE LEGEND IS BACK ON LIFESTEAL is the perfect name for it", "Lol they all got a L", "Yooo", "good start but bad ending", "Withers are weak when dinnerbonned", "Spokes island or latrosa", "Good!", "Call it \"penispire\"", "your mom", "amazing way to fool us ngl", "Yo your building is sick!", "Lets GOOO! The main man himself is finally back again on track with the BANGERS, great job, I really like this one alot!!", "Name the place the \"Your momathon\".", "4:01 \"So Zam to repay you im gonna give you this heart.............that i git from your chest upstairs LMAO", "If a single player see me im banned vs\n\n\n\nThis video that anyone can see", "THE LIFESTEAL!!! YOUR A LEGEND", "Call the civilization \"Traders of death\"", "even if it is scripted its still good", "BEST MC VID OF 2022", "wait if parrot sow this vid that means this is all scripted and lure lmfo", "Hey spoke remebr me i wish i had more time to watch your vids i have a concert wish me luck please dont forget your ogs like me and 100 crafts", "Man this episode was full of betrayal", "Wow what a turn", "Spike got betrayed by Red Balloons!", "spokelization", "Im sub to rekrap2 and you pls... dont be angry pls....", "i want part 2", "Woooooooooo", "LOL", "Call the nation: \"Zam Nation\" :)", "The name should be empire of death", "LIFESTEAL BACK TO LIFE", "why does spoke sound sick in this video? is he sick i need answer rn !", "Cool block game", "Yoo the God is back", "When the world needed him most, he returned", "YOUR BACKKK AND YOU UPLOADED WHEN IT WAS MY BIRTHDAY", "BEST VIDEO", "ngl im pretty sure clown will laugh at this... i mean, 1v4s and hes at 16 hearts if im not mistaken?", "alabamma army", "Nice plot twist", "The content never get me bored😆", "I think in your raid you should use horses. They are fast , some can take a lot of damage before they die and breadable to go fast and jump high", "Ok goodbye I'm leaving ( economic people left the video and join horizon)\n\n- 2 people unsubsribe", "risk of rain 2 ost = based", "4:03 last breath sans face3 music", "Spokeredemtionland", "Lol", "This made me emotional idk why", "wth", "SO MUCH DRAMA ITS MINECRAFT ITS NOT THAT DEEP", "4:02 like lol wtf", "Have fun against clownpierce", "One more thing youre the best in the life steal smp and.... Parrot you're super legend", "Yes! You did another vid pls do more were always waiting just pls do more!", "That's Very Nice Gameplay And You will Hit 1M subs I will Make a Face Reval", "U can use irongolems to kill the wither", "5:55 it’s so funny when people do “bottom text”", "raz nation", "deez land", "i want to build reddons caslte in my world is there any tutorial out?", "Name\n(The Corruption Kingdom)", "the town name should be Huge Issues", "love how the vid is exactly 20 min", "Man this is epic, on par with the lore of the dream smp, you are a legend in story telling, the relationship, the twists, the politics and scheming we’re all so amazing.", "I like money", "Reddons is the worst", "Somone can stop u spoke and reddons \nand thats Clown Pirce", "You should call it shadow nation", "Cat City", "The name of the civilization will be if my idea will get picked is PSZ The p is for parrot the s is for spoke and the z is for prince zam", "4:01😂😂😂🤣🤣🤣", "Spoke is back and hes better than before :D", "I now that music", "Bro RiskofRain", "OMG", "The town if ligma", "2:43 what's the background music called?", "Your name is Andre", "You shoulda made a tree canopy village for your civilization that woulda been sick", "Him: if a single player reports me I could be banned \nAlso him: ima show thousands of people how I am using netherite chestplate", "How often do you post", "Wow nice", "No say", "SCREE REDDONS AND TERRAIN (except only on lifesteal, they are pretty cool people :)", "E", "I gues the name of the civilization is: The legend is back on lifesteal", "black god light", "if i watch this i will not have to do my homework and get to go out to dinner lol", "The name should be the civil", "name it turkey", "Love you spoke keep up the good work but also please can you try and upload more often love you spoke", "Name: jungle of myth", "What about clown?", "Bruh", "Spoke: * bad omen villager* ME: You mean *bad omen pillager*", "Yow fira spoke de8d", "Call the civilization \"obama simp club\" because obama is cool!", "ITS BEEN SO LONG SINCE I SEEN A NEW VIDEO YAY!", "The big bois civilization", "I AM ALREADY GUESSING THAT ASHWAG IS GONNA BE THE HERO", "Can u name it the civilization of the poggers pls like I'm ur biggest fan omg pls read this spoke", "Sub", "Spoke…I’m really impressed and happy that you finally are back! <3", "Bro was this scripted its like techno and tommy but redoons and spoke!", "3:05 who's stream is that?", "The man is back finally I love your content keep it up dude! Good luck!", "Hi good video bro", "the name should be cheese curd", "Lmao kingdon", "Dominatia (because u wanna dominate)", "funni", "SUBCRIBED NOW AFTER WATCHING THE BEST YT VID EVER!", "name the nation pizza. Just pizza", "this is the best video yet", "Love you nice video", "spoke has cough/cold l", "2:54 *Me too bro, me too*", "Name it spland", "Finally,i’ve been waitng for years", "The Spoke is ready for some chaos !!", "Well .. i didn't see that coming", "Are you sick? Feel better soon if you are", "I'm so glad that this group of youtubers was found by the public", "CIV NAME: the republic of the spoke", "what a plot twist", "YAY", "Parrot is your best freind", "Civilization name idea: Anti Reddoons empire", "Bro lifesteal members me changing sides every second", "The legend of Spoke the best revenger", "What If", "5:09 , ok nice pc specs. 3090, ryzen 9 5950x, basically the fastest pc out rn", "I have an idea you should challenge him into a 1v1 and make your teammates hide in the walls while invisible and start the fight and say to your friends to come out and he will lose at that point", "Spokes back baby!!", "the unspoken", "can i have a shoutout?", "I think the only guy who could probably stop you now is clown pierce", "the whole shampam", "u can team with clown to kill reddons", "The twist is soooooooooooooooooooooo cccoooooollll", "Spoke will end lifesteal in under 3 months", "Bro i wonder how much thought spoke put into this\\", "Spoke, U will need a lot more than just parrot and Sam, U will need... The clown", "How did he not see the tnt", "YOU GOT A NEW SUBSCRIBER BECAUSE UR BRAVE", "13:30\nSpoke: no one can stop me\n/ban: I am here", "Did anyone else see the little girl thing in the bottom left of the thumbnail or is it just me?", "RED SHALL BE DED (nation)", "tbh honest i am a bit tooo excited for tommyinnit to join lifesteal", "Name your civ Viking and call your soilders berserker", "10 mil iq, never expected the plot twist in the end", "Firex is there anyway so I'll be back tomorrow and have to work out how I have been going to work today for work to work out for my exams for next year but will have more than half term for a couple more friends now lol cheers lol lol cheers lol I love it lol I think I love you so many things you can tell about your mum so you will never have a lot to do but it's hard for you lol you can even get the money back for 8.30am birthday and then just put it off for the night when we have the rest and a pint of course for the night lol ha yeah a bit more than what I want lol yeah just want me back from you tonight or Monday to sort something else then you need it again 9.30pm 9.30am it just now has just come through OK thank u for letting us work out OK 9.30pm thanks again and 9.30pm and thanks again and hope you had an excellent weekend thanks for coming along so quickly with us on 8th November for your wedding on the Sunday so you may have the time for it though and the weather was amazing when you put the sun out on your bed lol I think 9.30am going on for the night though and I have a few other ideas on what we", "booo >:(", "my first video on your channel and now you have gotten a new subscriber", "Poggies 2.0", "You could call  the civilisation The avenged and reveged or the hearts hates", "so good", "why is he  techno and reddon dream", "Spoke - Here zam I'll give you the heart Zam -Thank you Spoke - That I stole from your chest upstairs that one got me 😂", "the name is going to be sussysteal", "But can't clownpirce kill you guys with your civilisation wanting  you ded so they will prob team wth clown and redoons is clowns enemy anyway sooooooo........", "Man became aizen", "S", "Holdup, U watch TG plays? Andre and Samara….. Hmmmm", "bro the name should be the forest of peace \n\n\n\nlov the vid", "The legend has returned to youtube", "THE NAME WILL BE DUCKIES", "Yooo Spoke you can stop betreing!", "Massive betrayal in the whole history", "Spoke wave civilization\nBTW love from India", "Hu", "But awesome vid", "Bro clown pierce is literally Redoons worst enemy", "I guess \"THE LEGEND IS BACK ON LIFESTEAL\" is the name of the civilization", "This made me sad", "Tarrain told rodoons rewind the video spoke", "call it bobtopia", "Ashswag:**flying use boots**", "is it just me or does redoons sound like technoblade", "Lifesteal Civilization Co.", "This content just makes my day so easily and idk how.", "You should the nation ungeuw nation", "Potato", "u should name it BIG CHUNGES (flash backs)", "Call it John Cena", "The thumbnail and title are clickbait.", "YOUR A GENIUS", "Kill reddons", "8:20 Spoke is back in his season 2 rule breaking ways.", "Quandale Dingland", "Yeah", "LOL THIS IS THE FIRST THING I saw a video that 20:00 mins long", "You should call your civilization the sparrots!", "pls name it zatown", "THIS IS SO GOOD!", "The name should be the snufulusagans", "Name it piss topia", "either u are really bad or u are faking it at the begining", ". . . 1000 mob vids on reddoons???", "HAHAHAHAHHAHA TRAYDER TERRAINS 19:22", "THE GOD OF LIFESTEAL IS BACK S4 IS NEAR", "The kingdom", "FINALLY ANOTHER VIDEO FROM SPOKE THE MASTER!", "After 1month", "Finally ur back", "Name the caste Michel", "HE IS BACK", "“I’m gonna repay you with the hear that I stole from your chest”- SpokeIsHere", "9:12 Spoke can do math", "Name it bilgard", "HE'S FINALLY BACK!!!", "YESSIR", "can i join SMP please?", "The twist tho", "Why does he sound like his nose is stuffy", "I like how he Remove zam Head in the thumbnail", "eeeeeeeeeeeeeeeeeeeeeeeeee", "Yoooo Guys everyone check 7.27 spoke has r9 5950x with rtx 3090. Pc gamers pls a like.", "Redoons will one hundred percent regret that and we know it", "GG", "DAYUUUUUM", "I love chaos", "Why is this legend so good at making videos?", "YASSS DARK SIDE ON TOP", "It was suprising when spoke just turned full villian", "About time you make a video on Lifesteal dude", "Make this the most liked comment \nCivilization name: UWU CIVILIZATION", "hearet", "Man great episode my favorite so far great to see you back.", "THE NAME SHOULD BE \"THE RANDOM OF THE LIFESTEAL SERVERS GAME BREAKING BUGS\"", "Name the town victory city", "Destion and power my mind: STOP TALKING AND GET OUT WITH THE FRICKING VIDEO", "Dude you are doing this content for like 3 years now, can you do something else for once?", "Spokey", "Pooptown", "I knew that Terrain will betray you , he was alr acting very sus in his last vid , am telling you dont trust anyone only parrot :)", "FINALY LEGEND SPOKE IS BACK , YESSS , also nice video bro u are epic", "Has spoke truly moved on from anarchy? I wonder what tricks he has left up his sleeve.", "Spoke: the most liked comment will be the name of the civilization. me: does that mean the civilization will be called \"THE LEGEND IS BACK ON LIFESTEAL\"", "The fact that you pronounce the word \"with\" like \"wiff\" is too much of a distraction to be able to enjoy the video.", "Next video title: destroying a whole server with 1 nuke", "Call the civilaztion Spokers", "3:14 One word: Content", "The goat is back waiting for next episode", "Romans 3:23 states: \"For all have sinned, and come short of the glory of God;\". We are all sinners, that have committed at least one sin in our lives, which earns us an eternal punishment in Hell. Revelation states 21:8 \"But the fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone: which is the second death.\". God sent his Son, Jesus, to Earth as a perfect sinless sacrifice. To take on all the sins of the world; both past, present, and future sins. Shedding his blood on the cross as a blood atonement for all sins. After dying on the cross, he rose from the dead on the 3rd day and rose to Heaven. To show life after death. To show everlasting life through Jesus's sacrifice. John 14:6 states: \"Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me.\". Romans 10:13 states \"For whosoever shall call upon the name of the Lord shall be saved.\". \r\n\r\n   Eternal life in heaven is just one prayer away. All you have to do is believe that Jesus Christ, the Son of God, died on the cross for your sins. As an atonement for your sins. And rose from the grave on the 3rd day. Ask Jesus to save you of your sins and give you eternal life in Heaven. Salvation is a free and everlasting gift from God. Please don't let pride drag you into eternal punishment in Hell, but ask Jesus to give you eternal life in Heaven. If you're getting a strong feeling of resistance while reading this, it's because Satan doesn't want you to get saved. He wants you to resist, and think it's not real. He wants you in Hell for all eternity with him. Hell is not a fun place, like worldly people like to imagine. It's everlasting torture with no relief. I'm only taking the time to text this, because I want to get the message out. There are so many distractions in life keeping people from witnessing to other people. Keeping people from thinking about salvation. Keeping you from thinking about life after death. Please, ask Jesus into your hearts to save you of your sins and cleanse you from all unrighteousness. Ask him for a place in Heaven, and he will save you from eternal damnation in Hell.", "Legends of barbarok", "THIS WAS EPIC!!!", "Spoke,Zam and Parrot are your only chance to win against Reddoons,I think that Clown also doesn't like him", "Subscribed", "Repent to Jesus Christ \n“This is the confidence we have in approaching God: that if we ask anything according to his will, he hears us.”\n‭‭1 John‬ ‭5:14‬ ‭NIV‬‬\nJ", "youve improved even more omg", "Me, still waiting for the first part of the SMP, when it began, and the story of how you got banned.", "RESPECT HISTORY", "SPOKE IS BACK", "am I the only one who noticed that he changed the thumbnail\n\n\n\n\n\n\n\n\nLike if u noticed\n\n\n\n\n\n\n\n\n\n\n\nNever gonna give you up\nNever gonna let you down\n\n(Don't scroll down or you get rickroll)", "The civilazition name:P.O.G", "\"For God so loved the world, that he gave his only begotten son, that whosoever believes in him shall not perish but have everlasting life.\" -John 3:16(bible) \"the wages of sin is death\"-Bible. Therefore God the judge has given man the death sentence due to man's sin, but because of God's mercy, he gave himself(god incarnate/jesus)to die on a cross for the sins of the world. That means he paid our fine and if we trust in him God can legally let us go guilt free in court/judgment day and have everlasting life with Him! \r\n\"Go and sin no more!\"-Jesus <3", "epic!", "Man this is like a movie. I am serious. Especially when the minecraft music starts", "Noicr", "The ultimate return", "I want the civilization to be called \"The unspoken\" Because not only does it sound cool, its inspired by ur name. :) I hope this gets picked. \n\nEdit: It should also be called the unspoken civilization because its a really cool title :) And also since the civilization doesnt exist anymore, it should be called unspoken and when its a war, well then, THAT is called the unspoken war.", "The Jungle frog nation?", "Parrot singing like a 35 year old man", "POGGIES", "Plot twist is god", "Wait what are the items that are banned", "Shadow striker squad", "pog palace", "pog palce", "The best lifesteal video ever Ur plan was INSANE", "Why is netherite illegal?", "i love how the best trapper on lifesteal is back. pog", "Cocky Civilization", "smiletown", "SPOKE", "kingdom name: mabey heartsbane?", "Love it man. You are legend 🔥\nSpoke civilization always in our heart ❤️", "So staged", "Call it \n\nNEW NEW Finlandia", "Spoke is such a nice after watching this video", "The first video of him\n\nHe does illegal stuff", "EPIC video!", "clickbat", "gooooo spoke", "LEGEND IS BACK LETS GO", "Why do u upload every 1 month?", "Yooo spoke back on lifesteal less goo", "the plot twist", "Thanos of lifesteal smp", "you should get a totem of yourself lol", "I stayed up at 3 am watching this", "THE RAINBOW GOD", "I thogh youre the owner srever", "best video ever", "#14 ON TRENDING!!!", "When you know that there's a twist since he said that he actually is teamed up with the enemy: -_-", "Can i have 1k subs bois from our legend comunity💞", "THE PLOT TWIST WAS INSANE", "THIS IS SO GOOD!", "why didn't you upload these many days about lifesteal", "THE GOAT HAS RETURNED", "Poggies", "THIS SUCH A GOOD VIDEO", "I wasnt expecting that twist in a twist wth 💀", "The Lifesteal Regain Civilization Program it might be a horrible name for the civilization but it’s all I could think of", "HE BACKKK", "THIS VIDEO IS EPIC!", "My god you should make a whole series of semi-lore where you try to rule the world like this you should definentaly do more of this stuff", "FINALLY HE HAS RETURNED, THE GOD OF LIFESTEAL SMP, NOT PVP WISE", "FINALLY HE HAS RETURNED. THIS IS EPIC", "Hi", "Gosh finally I can't even say how much we've waited for this video the entire lifesteal smp is incomplete without you spoke we missed you so much", "Drama queen", "Let’s give reddoons hell.", "THIS VIDEO IS EPIC!", "That dirty trader.", "Hey are you the same guy from Feast of Fiction? Your voice sounds exactly the same!", "Gosh finally I can't even say how much we've waited for this video the entire lifesteal smp is incomplete without you spoke we missed you so much", "I decided to watch this with my grandpa. He served in the Vietnam war but came out alive. We're at 1:50. I sure do hope nothing PTSD-inducing will happen within the next seconds!\r\n\r\nEdit: Yes, this comment is sarcastic, you can stop asking now", "THIS VIDEO IS EPIC!", "I decided to watch this with my grandpa. He served in the Vietnam war but came out alive. We're at 1:50. I sure do hope nothing PTSD-inducing will happen within the next seconds!\r\n\r\nEdit: Yes, this comment is sarcastic, you can stop asking now", "I'm so glad that this group of youtubers was found by the public", "“The Dark Side” ba ba ba ba ba ba ba ba ba", "The “Eduardo’s” godly name", "your on 4 hearts and you chose to make your civilization in the most dangerous biome", "You're a smart cookie.", "Nice vid", "I love this video, probably my favourite one of yours, went through a rollercoaster of emotions!", "This is amazing!", "SpokeisHere", "THIS IS SO GOOD!", "I hate how you made this", "I LOVE THIS VIDEO!!", "I love this video, probably my favourite one of yours, went through a rollercoaster of emotions!", "Capitalism", "hmm how about the corrupted forest of spoke", "Congrats on top 21 on trending! Not like it’s happened 10 fridays in row😏😏", "The Trojix like Trojan or Troy because parrot has done a Trojan house thing and near your base you can make a Trojan horse.", "Lets GOOO! The main man himself is finally back again on track with the BANGERS, great job, I really like this one alot!!", "THE LEGEND IS BACK ON LIFESTEAL", "How About \"Ablak\"", "THE LEGEND IS BACK ON LIFESTEAL", "Hello, Humans \nThe British Queen’s handbag is a body language communication device.\n\nTERRANCE OUT", "THIS IS SO GOOD!", "THIS IS SO GOOD!", "THIS VIDEO IS EPIC!", "THIS IS SO GOOD!", "SPOKE IS BACK", "My god you should make a whole series of semi-lore where you try to rule the world like this you should definentaly do more of this stuff", "After 8 months and a borderline unhealthy amount of Mcartneystan, this is a breath of fresh air.", "I think the civilavation name should be WE HAVE SPOKEN", "THE LEGEND IS BACK ON LIFESTEAL", "Lets GOOO! The main man himself is finally back again on track with the BANGERS, great job, I really like this one alot!!", "YO THIS IS EPIC. Every video you make it gets better and better. POG", "name it banana bread kingdom. i have no idea why but its funny ig", "13:10 i really want clown to fight them", "you should name it spoketown or spoketopia", "Lol", "My YouTube name was inspired by you", "THIS WAS AN BANGER!!!!", "Your evil", "AMAZING", "This proves it - Spoke videos are just better when filmed on Lifesteal", "hey spoke im a really huge fan and what backround music did you use at 00.40", "New spoke video is on the next level", "The name should be “Eduardo Reminiscence” idk why just thought of it.", "Man nice vid dud", "the name should be deez nuts. Simply deez nuts", "Name the base \"otter pop zone\"", "do not trust princes zam that much", "SPOKETOPIA PLZ", "This was amazing! Can't wait for more coming!", "Call it Barneymania after my dead pet", "EPIC THE BEST VID I HAVE EVR SEEN ON YouTUBE", "\"If someone ever wrongs you, create an entire civilization to bring them down\" -Sun Tzu", "Ok yeah spoke is a psycopath for sure", "Hiiiiii", "hey spoke! did you know that Tommyinnit wants to join Lifesteal", "Call the civilization The CrispyBaconClan", "Red Dead Poggies :)", "you lied to us UNSUBSCRIBED", "Yelloooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo", "Y", "CHUNGUS COMMUNITY", "Spoken Civilization", "Amazing again", "Let’s gooooooooooi", "Name it the Deadoons", "#14 on trending! nice!", "Cool video lol.", "name it quandavius gooch town", "The spoked idk", "I’m making gaming content and if you’d like to go and check it out it’d greatly appreciated! \nEvery subscriber and every view and comment means so much for me! \nThank you and sorry for the self promotion:(", "We", "The name should be hidden leaf jungle.", "Hii", "One of the best creators out there", "Love your vids! This vid was Realy good!", "Hoo", "He is BACK", "Fort whales", "name the nation the cheese natin cus cheese is good", "Not what I expected", "Kum Kingdom", "Bruh", "nut.", "P hole national"]