["D girls boys roycewalker", "The two daisies and the rainbow looks like a sad face 😇", "This brought memories I had no idea I had 😅🤣 loved this video! My first medical ASMR", "Gibi cuando haces otro video en español :( muy buen asmr eres la.mejor 💖🤙", "who else is clicking on her youtube chanell after the honey ad??", "Bring back the Luna character please ♥️", "Hey Gibi! I follow an ASMR series called ASMR for short attention spans (5 seconds) and I was wondering if you could do something like that! <333", "No more  Whispering I guess 😏", "Why does gibi ASMR trynna wake me up and do 50 push ups like.. idk man", "0:43\nPOV: you’re in an orphanage", "Better one", "11:40 can you d9 more of the headphone sounds including the beeps", "u brighten my day", "Please do a mom rp", "Thanks gibi 🤗", "You look like a pokemon trainer", "relaxing", "Day 1 of asking gibi to do a starwars roleplay", "You're the most beautiful doctor! I'm deeply sick Doctor. But i  Kindly request you to send dudes of Bob and vegane.", "Imagine the pediatrician used to do karate and they hit you in the chest....", "Want to know how i discovered your channel? A honey ad. Yes a honey ad.", "Luna bloom on top", "i loved this, also something hilarious, well not really, but remember the bit where she checks your back? i watched this the day before i go diagnosed with scoliosis, the chronic illness where your back grows in a curve. lol.", "The caption at 22:25 xD", "“Are you feeling a tummy ache or headache” yes yes yes yes yes", "No yeah, we definitely got banned from Red River too. A few too many people got clotheslined 😅", "paediatrician appointment but everything is wrong as a very important prequel. We need to know why everything is so wrong.", "Ahhh yes my ear is clean I clean it once a month\n\n\n\nEdit: Wow this is the most liked comment", "So glad this character came back, she was so sweet in the 'everything is wrong with you video.'", "My god your voice is like a feather blanket, i feel my heart rate change as i listen", "Since it almost June can we get a mid year worry removal video 🫶🏽🫶🏽", "Cool video! I have an idea! you can make a asmr video on covid test treatment ! haha", "Yes Gibi ❣️ I love your hair clips they are beautiful 😍 awesome video 🤗", "You always remember me of money heist character tokyo....You are exactly the same 🤗😍", "Gibi is Sooo cutie", "Gibi: How old are you? \nMe: Im 22 doctor", "Well. Feeling like a kid, but my appointments with doctor weren't that good jajajaja", "THE HEARING TEST IS SO GOOD BYE", "Gigi: “knock knock knock, can I come in?” \nMe: “no.”\nGigi: (barges in anyways)", "Everything was cute and all until the booster part. I just got vaccinated four times 2 days ago and I do not plan on watching someone going in my skin with a needle again. 😭😭", "This was such a cute and cool video. I have been going to the doctor's and hospital forever. I actually lived in the hospital for a little awhile to. I had three heart surgeries. Two ear surgeries and a clavicle surgery to. It's alot . But I'm alive and well. Very great ful for it too ♥️", "SHE MAKES MEE FEEL SAFE🥰💝💖💗💕💜💛❤‍🩹❤‍🔥❣🫀🤍", "Can you please do another day spa video? That massage and wipser was french kiss 💋", "THE SMUDGE IS GONE", "Hello Gibi, I have been watching your videos since about 2020. You are one of the only asmrtists that can actually relax me and help me sleep. I have trouble sleeping but I’m not going to say that I have insomnia because that would be self diagnosing, but I have a lot of trouble sleeping. I’m so glad that I found you when I did because you bring my stress level down so much and you help me sleep almost every night. I’m so great full for all the work you put into making these videos. Thank you so much Gibi for being one of the best asmrtists I’ve ever watched. Hope everyone has a wonderful rest of their day/afternoon/night <3.\n\nP.S.\nI never like going to the hospital/doctors but I absolutely loved this video, it relaxed me so much and brung down my stress level. Also I love the bunny and also your hair clips <3.", "How did you do the headphone ear test sounds?? So realistic!", "Can you make a part 2 on the ‘Fastest asmr, everything is wrong’ video. At the end of it you put us to sleep could you do anouther video where we wake up and you do the same stuff again to see if we improved?\n\nI love your videos btw, and my favorites vids are the fast roplay ones! And you where one of the first asmrtists I started watching. If you see this have a good rest of your night/day/afternoon!!", "Why do i love this so much omg", "Anyone know where I can get hair clips? 😍", "The hearing test is AMAZING, perhaps a new rare/specific trigger? Brought back so much nostalgic elementary school nurse-checkups.", "\"Can you tell me some of your friends names?\" \nme\"um i dont have any\"", "When you do the little eye test thing and sorta fail it in one of your eyes. With your glasses on 😅", "I feel like a kid again 😭❤️", "As a CNA working in a pediatric clinic, I WISH I had your level of bedside manner", "Tu mando un abrazo", "The hair accessories are on point! Good job 👏🏼 amazing video too", "Gibi I would never ask you to do this because it would break you mentally but how many days do you think you could go doing a video a day", "Can you make a everything is wrong version", "As a pediatric nurse I approve of this", "I might have to go back for a physical for my camp  and I hate the doctors ( altho I love what they do) if my mom can't find the paperwork... I have to go back lol", "exactly what I wanted", "Bro that height scale is not a a height scale in my eyes, if u know, u know…\nEdit: also even tho i know I’m not healthy this made me feel I am so I appreciate it\nAnd for some reason it makes me laugh thinking that u could be wearing PJs on ur bottom half", "vaccines are bad for your health. wake up", "I am a kid and I go to pediatrics a lot now I my ipad", "I wish my pediatrician looked like you. Mine looked more like a lunch lady and was named Beverly... She was actually really sweet and great though! 😁", "So calming ❤️❤️❤️", "How is your day going", "Gibi: we already got your weigh. Your weight: 246lbs", "I love your asmr's they're so calming and help me sleep when I really need it. Tysm❤️❤️", "Mmmm not accurate, I have a whole menagerie of issues. My blood pressure is reeeeeally low bc I don't drink enough and have a lightspeed metabolism, so it's not fun", "Friends names? I would tell u if I had any 🥲", "is it just me or is there something on the camera?", "I can't figure out why but this is so relaxing for me! ❤️ The most soothing video I've listened to in a while", "I think u gotta add an emoji for saying \"ear to ear speaking sound\" or \"normal speaking sound\". Maybe you can add 📢 and 🎧", "Gibi: So you don't feel like you have a cold or anything\nMe watching this video sick: I actually have a cold\nGibi: That's good, perfect\n\nThanks for the amazing videos!", "How tall are you", "Gibi making a relaxing ASMR while simultaneously teaching about stranger danger. Iconic 💕 also red Rover brought back the memory of everyone playing it in my primary oh man", "Anyone else thought she had a haircut????", "the sound testing one in left and right ear i couldnt do cause my right ear is deaf lmao", "I work in a pediatric office, most of our patients are under 16 yrs, usually the medical assistant does asks the questions, check height/weight if youre the right weight with the average kids your age,  vision test, blood pressure(if needed), etc. then after thats done doctor comes in, sees the patient , talk with parent if theyre under/overweight, whatever problems they have etc.\n\nedit: we check both the kid and parent's temperature before they enter our office space due to covid", "Videos like this really help a lot with medical anxiety and bad childhood experiences. Thankyou ❤", "I love how she sneaks in the actual breathing techniques that help u relax helps alot thx gibi", "Btw that pokemon headset ranges between $295.99-$495.99 USD", "I am interested in what a everything is wrong (pediatrician version) would look like", "How cool I really liked your video my dear, you are special for taking good care of me!😗", "How cool I really liked your video my dear, you are special for taking good care of me!😗", "THIS IS SO GOOD GIBI", "Gibi: Do you know how old you are?\nMe: 23!\nGibi: …\nMe: …\nGibi: Awesome.", "i don’t think anyone has seen the outro of gibi xd", "Do a m.r bean roleplay Mr bean asmr 🤣🤣🤣😜", "no off but this is kinda cringe....", "3", "What a legend", "Omg thank you Gibi, I’ve asked you to do video with pediatrician and now I’m going to sleep❤️", "This makes me feel small and I love it~", "i love watching asmr where they talk to me like this. i feel like i could just forget about the worries and stress of life and school.", "I genuinely didn't think I would love this :D BUT I DID - it was amazing haha \nBig love <3", "Good", "Wow", "スゲー好きなんですけど～", "WE NEED A VERSION WHERE EVERYTHING GOES WRONG (love the video and the concept of a fun, nice, bubbly pediatrician!)", "This was absolutely wonderful Gibi. There's just something magical about being able to be a child again, just for a little bit. Thank you so much.", "I love this so much. <3", "Your role play vids are my absolute fav ❤️", "Prompt for a new video: I did bad at the eyes test and u send me to the nice and sweet residence eye doctor! It would be super super relaxing", "That was wierd", "I absolutely love this gibi. As well those hair clips", "What is the beeping trigger called? I need more of that huhu", "We skipped our baby’s 10 month appointment and just watched this instead thanks gibi!", "I just realized how popular Gibi is, it’s kinda dawned past me but she gets millions of fews every video", "Hi Gibi! ❤️\nI’ve been watching your videos for a few years now, and I’ve heard you talk about your anxiety struggles. For the past couple of years I’ve been experiencing a ton of anxiety and I’ve really been struggling with it, and you seem very intelligent and like you know a lot about anxiety disorders and/or just anxiety in general, so could I please ask you for your advice in some sort of private chat? ❤️ I really admire you and I feel very close to you as you’re one of the only YouTubers who can calm my anxiety and give me nonstop relaxation and tingles, so I really trust you and I think that talking to you would really help me. Can we please do that? 💖💖💖❤️", "Your voice is soooooo relaxing", "My streamer cares about the environment 💚 fuck gfuel. Any nft is bad, they’re all paid for with cryptocurrency which is abhorrently bad for the environment", "Can you please be my doctor?", "This has healed a part of my inner child, Thank you Gibi 🥹❤️", "Angel face", "This was so lovely and wholesome, as a side question what is Red Rover?", "I’ve been wanting this for a while", "So glad I read the description because seeing that you also disagree with NFTs is amazing as they couldn’t be more of a scam. Putting aside a sponsor because of something they’re doing is pretty brave and makes me appreciate you even more.", "I’m a bit mad I chose Donald not Mickey", "i lke monkeys too.... )\n  \n😊", "I've been hoping for a full video since I saw your super quick pediatrician roleplay in your other video! Glad it became reality :)", "i’m very concerned i’m unable to hear one of the tones on the hearing test 😐", "My left earbud is completely broken, so I just couldn't hear the beeping or talking-\nMs. Gibi I think I'm partially deaf 😥", "hey gibi! loved this vid!!! I was wondering if you could do a whole video with the headphones on I loved the muted voices, so relaxing!", "Thank you so much for the wonderful role-play video, Gibi! You do so well.", "Your gonna be an awesome mom one day Gibi…Hurry up and get that husband of yours to put a bun in the oven already", "Te quiero mucho Gibi", "i love ur chin lol", "Can u do the same in everything goes wrong btw love your videos", "i think itd be funny of you did a doctor’s appointment with tests that were really hard. like the hearing test is pokemon calls and we have to name the pokemon and the eye test is really far away", "A pediatric eye doctor video with getting your first pair of glasses would be a great video!!", "Absolutely adore these ASMR role plays. So enjoyable and relaxing. Not so keen on the fast ASMR role plays but they are still good. Just wish Gibi the lovely bunny could make more. Love the bunny style gibi. 🤩😀😄", "i age regress because of trauma, i love this sm <33 feeds my little heart !!!!", "\"that's so healthy of you\" 💀💀", "This is amazing! I can't wait to show my daughter. She's going to love this! She loves your videos! Thank you!", "Now Gibi I know my ears don’t look good lol. I hate it I get ear wax so frequently", "the pediatrician was the first place i ever got asmr lol, the stethoscope part always gave me tingles and i was SO confused by it (but i didn't even know how to articulate it gkskdj)", "i love these videos🥺 so wholesome. it makes me go into little space. i loved the sensory book videos too !!! rly helps when I’m having hard nights", "Yasss the beep sounds remind me of my hearing tests from high school lol", "Why I get sad when was over :((", "Wait were those Pokémon themed Grados?", "12:59 thought it sounded like a microwave", "This reminds me, I actually need to do a physical exam 😂\n\n\n\n\nOh well\nԅ( ͒ ۝ ͒ )ᕤ I be lookin so stronk these days ion even think I need one.", "Man, I've always enjoyed your sponsored segments on gfuel, sucks that they choose to go that route. But respect to you for pulling that sponsorship", "Unrelated to the video. I saw your ads with Honey though I just decided to check you out. I saw your birthday was Dec 19. You have the same birthday as two of my friends and my younger cousin, though you remind me a lot of my younger cousin. Just wanted to say that. I think you’re great.", "I would LOVE Gibi as my doctor!", "The beeps scared me I thought my headphones unplugged", "Hey Gibi, have you ever filmed yourself doing a Lite Brite design? Sand art, or color by number? Feeling super 90’s tonight!", "Brings back memoriessssss.", "Why am I getting depp Willy wonky vibes freaky", "yoooooo i just had a honey ad you were in pop up before a youtube video!!!! so cool", "I’m sorry but 5:05 \nThat’s what she said", "Gibi: \"are you feeling ok no headache no tummy ache?\" \n\nme: i broke my leg on a flight of stairs", "I love the medical ASMR videos! Especially, ear cleanings!", "The hearing test was the best part of the doctors for me lol", "Just saw the honey ad on a completely different video. One of the only ads I've ever enjoyed, nice job on that", "Can you do this but we’re everything is wrong with you plss", "What a queen!!! You have so many videos and never have ads. That just shows you care about us not the money like some people. I have a channel and I don’t use ads because I don’t care about the money", "HAS NO ONE NOTICED LIKE THE DIRT OR DUST ON THE CAMERA?! SIEJFHDNKANFNF,E", "I appreciate avoiding the weight topic so much", "I have really a bad cough so this helps me sleep even tho I cough alot", "GUYS I GOT AN ASMR AD BEFORE THE VIDEO THE FUTURE IS NOWWWW", "You should do a ‘Pediatrician But Everything is Wrong’ video", "May be because I grew up in the military but I don’t remember it being like this", "This is the pediatrician from the fast pased asmr! I loved her she was my fav. Even in the everything is wrong video it was great!", "The nostalgia is getting to me", "Great video. Did you kill off daisy?", "the fact that i couldn’t even read the shape chart💀💀", "no one:\ngibi when children :🌈💐💛🐝", "The day this was posted was my birthday, and I’ve been hoping for a full video of the pediatrician after seeing the “Fastest ASMR”, so this was a really nice present ☺️", "Much respect on the gfuel nft sponsor thing", "Omg i love ur channel I watch it every night to fall asleep but can u pls do a day at Hogwarts ASMR video? I would love that if u did💜", "Cool hairpins.\n\nI'm 29 and Booster Bunny would be  nice to see when I get my shots.", "I forgot how soothing it could be to be a kid sometimes. Adult doctor visits are no where near this relaxing.", "Who else could smell the alcohol pad through the screen?", "My pediatrician is never this nice", "You have a smear on your lens", "This makes me feel safe. :)", "literally my first thought when i saw this video in my recommended was “omg it’s booster bunny!” and i don’t know why that made me so happy but i love it", "Que bonita vos qué tienes ojalá fueras cantantes para que fueras mi favorita", "Booster shot? Lmao", "This really makes me hate adult life with a passion", "I've been waiting for you to do 1 of these because as far as I can remember the pediatrician was a good ASMR experience and I thought you could recapture it really well I was not wrong you did not disappoint", "we asked for it and she provided ✋🏽 what a queen 😍", "What camera do you use to record your videos ?", "8:57 the way she says nose is oddly calmly and suitable as a pediatrician", "Is this a regular thing in the US? I’m from the UK and as far as I know regular check ups aren’t a thing once you’re not a baby. You only see a doctor if you have a concern.", "I was wrong, I said that I would help to find the puppy ! 😭", "1", "The headphone 😴💤💤💤", "For some reason the camera still feels smeared to me 👀", "Day 386\nof asking Gibi to recreate the whole Shrek movie once she reached 5 million subscribers", "One thing i wnna say is that: UR HAIR PIN IS SO CUTEES 🤧🤧", "I'm 100% serious i didn't hear anything in my right ear.", "It’s crazy how she has all this doctor equipment! She is really dedicated to Asmr.", "IM NEW TO UR CHANNEL AND I ALREADY LOVE IT!", "im short..", "Very nice and kind episode, I wish I had such fun a caring pediatrician back in childhood!", "Hey Gibi this may be a shot in the dark but have you been using a black pro mist filter on your camera lens? I notice a different halation and glow in the videos!", "this was a genius idea tbh! not only does it make adults feel small again but in my case, my daughter has been watching you since she was  little so i think she would love this video. shes 9 so she’s still seeing a pediatrician, and im sure she’d love to replace her real one with you", "You are so good at this.", "beautiful video gibi, incredible 💜👏🏻", "So much succes too u and your family and your husband", "Watching this the day before my pediatrics appointment tomorrow 😭", "Massive respect for pulling the Gfuel ad, over the Gfuel NFT.\n\nKudos Gibi.", "Gibi: Can I come in?\nMe: No.\n\n**play end credits**", "Can someone tell me what's up with GFUEL, just read the discription 🤔\n\n*side note, too sleepy to Google 😅🥱", "Got ridiculously excited about the return of booster bunny", "Hi Gibi I’m late so I don’t know if you’ll see this but I’m really sick and watching your videos makes me feel bettwr", "I had a pretty rough childhood surrounding adults I could trust, and this really makes me feel safe and not judged while being talked to like a child. thank you so much for letting me feel like it is safe to be a kid.", "This is why Gibi has 4+million subs...❤💚❤ Thank you, Gibi!", "I think i have bad eyesight because i didn't guesse the right numbers of fingers on 8:57", "so when did you gonna do everything is wrong with you version?", "gibi singlehandedly healing my inner child", "the best asmr of all world greetings from El Paso Tx", "the best ASMRtist i know", "Not me saying 4 fingers when it was 3…….. whoops", "so cool to see that you're considering your sponsors so carefully gibi :) i wouldn't support nfts either and it's nice to know you're using your platform to promote things you actually believe in. it seems like the bare minimum but thank you!", "Gfuel nfts, what the heck, I ain't buying another thing from the website now...", "Damn I miss the days where the only thing I had to worry about was hating school and getting my ass busted over something stupid 😂", "*paediatrician sorry had to love the vid as always gibiiii xx", "Your voice even gives me tingles.", "Fun fact: I've only actually had one of THESE tests in my entire childhood and that's when I went to the hospital because I kept collapsing", "hh", "Asking for a dentist video day 8,965,002", "I wish I had perfect condition…", "POV: I hate water!", "13:06 is it bad that I heard almost NONE aid those 😅", "Could you do a “treating your poison ivy” roll play? Please? I’m in misery and I can’t find one anywhere. :(", "You're so beautifu!", "Look at her nose", "I swear you've been reading my mind lately", "hello", "Lol idk why but when you said \"knock knock knock\" in the beginning I thought you said \"Nacht Nacht\" which is german and means \"night night\"🌙 I had to play it again because I misheard it the first time😅so anyway have a goodnight I guess🤗", "Daisy came to mind about this video 😋😁", "I wish, I could marry such a sweet girl like u!", "1:19 did, did she just, get that from, from my body?!", "Not me having no idea what she said during the hearing tests-", "Gibi this is so good, the beep test with the headphones genuinely brought back memories of my pediatrician who I LOVED and I can literally smell the doctor’s office just thinking about it", "I wish I had a company for making toys like this bunny when you squeezes it it will fart.", "Me during the height part: wasnt I like 4,7 as a kid? (Fr tho I was nicknamed giraffe person in 4th grade.)", "This video is assum", "Why this Ruler is shaped like that..you won.t use it for killing.right?", "Gibi: Heres an new video!\nMe: Thanks... Wait a minute.\nAlso me: OmG Its the doc from that one video!\n\nhttps://youtu.be/hi3mReQ8CGc This one", "i love your videos so much and i love how you  made me fell like i was 4 lol", "Gibi you are so beautiful", "now i miss my pediatrician she was very kind and we used to exchange jokes", "To be honest, I thought this would be a bit weird and I wouldn't be able to watch the whole thing; being a fully adult man.  But I found it simple and comforting, not patronizing.  More exquisite work from the Lady Gibi.", "Me as a kid found this very well done because it is directed at audiences like me. I hope she can make more mashed around childeren", "I did the eye exam. I can’t see for cr@$! 😂", "you're a cutey Gibi :) hope all is well with you!", "I didn’t hear the low tone from the hearing test on the first go and had to turn the volume up so this was actually a real medical test now.", "Blank screen for those who need it\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSleep well everyone", "Gibi : Do you brush twice a day\nMe : 🤡", "🐸", "i have watched this 3 times why am I never stopping???", "Dr. Gibi is my new spiritanimal I love her 💕\nI think this is my new favorite Gibi video which is a high bar already but the immersion was sooo on point and the cuteness overload and the way you said nose was the best lol.\nThis one is going to be top of my \"Sleepy Time\" playlist for a minute I tell ya! Hehe", "Another awesome video! ❤️ Thank you Gibi! 😍", "A  video on anger relief please ❤️", "OMG I LITERALLY HAD HEADPHONES ON AND IT WAS ON MAX AND WHEN GIBI SAID KNOCK KNOCK KNOCK I THOUGHT SOMEONE WAS BEHIND ME- I NEARLY DIED", "This was so nostalgic and pleasing", "I’m absolutely loving this video so far!! I also have some suggestions for videos on my mind.\n1:More Tatyana videos (they always put me to sleep 💤 )\n2: A dentist role play \n3: A tailor role play", "Gibi: Did you have any questions at all for me?\nMe: Can I keep booster bunny😏", "Amazing video! I love watching you. I almost fell asleep!", "I love your little hair clips!!!!", "So sweet ^_^", "this is so relaxing and tingly Gibi! everything about this roleplay is so cute, from your character, to the props, to the set up, even your hair clips are ultra cute 🥺 this bring so much memories to my first trip to the pediatrician. 10/10 would go back to this again", "It is so great what you are doing! I love your videos. :D", "Great video!", "Oghmkkk", "Honestly one of the tingliest ASMR videos I've seen in a good while", "I LOVE HOW YOU SAID NOSE, AND THE BUNNY!", "Yeah i always remember doctor gibi 😂😅👍", "When I cross the street, I get many beeps.. I look both ways. \nUp and down...", "Please clean your camera lens 🙏", "She's like this unorthodox mixture of hot and cute. If she farts should I have a boner or be disgusted? Honestly don't know but enough about my Mom. Great video 🤘", "ik this sounds really silly but this reminds me of when I had done my autism tests and had my help with my social skills, they were always so nice to me", "Gibi do this every year :D", "Ok but now I’m really curious as to what “red rover” is", "Not me hearing nothing at 12:47 but giving giving the sign that it rang 🥺", "you have saved my long nights into asmr nights", "keep working on ur vids we love them", "can you do a standing up to a bully ur my faviotire \nthanks and pls", "So cool you made a full version! Maybe E.N.T next?", "Gibi: “Do you know how old you are?” \nMe: “nearly 20 :)”", "look at my nose and how many fingers am I holding\nme:4\ngibi:3\nme:😳", "i haven’t even watched yet, but booster bunny is my favorite 🙌🏻", "I like!", "Day 1 : make a allergy test but everything is wrong with you video", "THANKS I WAS REPETING THE PEDITRIAN PART ON YOUR OTHER VIDEO", "Yeah a very long awaited video 😭❣️❣️", "Definitely did not hear the third sound in the hearing test … am I too old?", "Your videos has always been perfect materials to practice English listening, thank you~", "Asmr video idea: shooty sounds from a gun.", "this is the cutest, relaxing,ahhhhh!!! love from BANGLADESH Gibi[জিবি]🌹😌💝😇😘", "I would love to see one of these roleplays where the patient just absolutely will not cooperate lol", "YES YESS YESSS", "I love your videos so much they help me a lot thank u", "Why the blurriness??", "Hey Gibi! I just wanted to say I love your videos! There is one particular trigger I have found really works for me! I was watching the video with the keyboard and you using a makeup brush to brush around the keys and around the board itself. I loved that part as the brushing was both a visual and audible trigger for me. If there could be a video where you brush and \"clean\" various objects that would be amazing! Many thanks! \nAdam.", "Is it just me or is she glowing?", "*knock knock knock can I —* ABSOLUTELY YES GIBI 😂.", "The voice is calmer and lower than the other appearances of this character, was that super chipper voice too hard to keep up for longer than 5 minutes at a time? 😆", "We need a daisy video, daisy plays with children at a day care roleplay.", "You forgot the part where they leave you waiting alone with your mom for ages", "Ok this is gonna sound strange but I feel like your camera proportions are really accurate. Like when you put your hand down to our “heart” it feels like you reach the right distance, you know?", "Gibi: Do you like you teacher?\n\nMe: No", "Great video maybe you can do this again but than that everything is wrong?", "нак нак нак маза фака", "💜", "Gibi plz make a full vid of ENT, cause even the two minute one gives me the maddest tingles :)", "Hi Gibi! I’m glad you’re being very transparent about the the Gfuel NFTs. I personally don’t like or support them. But one of my coworkers came up to me at work the other day and we both are very into art. She was telling me of a new app she was into(trying to get me also into) and she started talking about making NFTs and that I should do it. I felt soooo uncomfortable I didn’t know what to say and I didn’t want to be rude. But I’d rather not have my art get stolen lol. Also the breath in and out part was so good! I love the close up whispers!❤️", "0:55 the end of the 💫smudge era💫", "YES I'VE BEEN WAITING FOR THIS! I haven't visited my pediatrician in 2 years and this was really nostalgic 😭", "Hello Gibi, thanks for helping me fall asleep sm lately 💓🌙", "Gibi, You should totally do another behind the scenes video, But this video I have no idea why but it certainly has been one of the most relaxing videos I have watched in the past while.", "Glad I have the NHS lol I would be dead several times over without it", "I love this:)", "waw super", ":O yaaaay! I've been waiting for this!", "i've been in a bad mood for the past few days and this is making me feel less lonely, thank you Gibi for the lovely video :)\n\nedit: when you said tummy ache instead of stomache ache i melted and nearly began crying, this is too wholesome qvq", "Gibi: can I come in\nMe: nooo I'm taking a fat 💩 \nGibi:walks in anyway", "Watching this while I’m mid anxiety attack, have to do a Spartan race (starts in 2.5 hrs )that I haven’t trained for at all, and trying to do it while fasting for Ramadan \n\nI feel a little better now. I’m so glad I have asmr. Thanks for normalizing it for me, you really were the one that really made me feel like i don’t have to be embarrassed just because other people call it weird and creepy that don’t experience asmr", "Super like for your description about gfuel. I respect tf out of giving up a common sponsor when they do something you don’t like, hell yea", "I just went to my pediatrician yesterday for my check up😅", "\"I don't know if you remember booster bunny\"\n\nReturn of the king 🐰", "Loved the second part of the hearing test, Gives the illusion that someone is actually whispering in your ear. That sound creepy but i find it extremally relaxing. I've tried finding more of them but i could only find people doing the beep test.", "“Okay, you can breathe like normal now.”\nThe Kid with Asthma: Really??", "I’m allergic to the bandaids that Gibi used", "Much respect for the description. 👍🏻👍🏻", "I went to meet my doctor since I was so so little until i was 14 years old, it's a flash back of good memories of my childhood, good job+", "Nobody \nGibi: gimmie this arm\nMe*yanks off my arm*\nAlso me : yes u can use this arm", "I feel booster bunny is very controversial.", "What is NFTs?", "Still have no clue what an NFT is", "I love how she sounds and how she says things she makes me feel so cozy and at home and I feel like a kid again she makes me so comfortable and feel so safe here and I absolutely love it this is one of the best Asmr videos I have ever watched THANK YOU GIBI!!! ❤️❤️", "YES I love this character, glad she's back", "I love the hair clips so swag", "I'm just commenting because of the Grado headphones. Gibi seems to have an ear for high quality audio!", "Great RP! My pediatrician was so nice back in the days, I feel the same energy in this video :)\nGood idea to ask the safety questions", "you make me feel like im 5", "I rewatched the fastest medical exam this week and thought to myself that I would love to see the paediatrician one! Thank you for this!", "Reminds me. I need to find a new primary care physician lol", "17:15 red rover... I personally saw two different incidents of people getting severely hurt from that game when I was a kid. Who would have thought ramming into each other over concrete was a bad idea, lol.", "Very much appreciated that you delayed your sponsorship with GFUEL in order to stick to your values regarding NFTs. Especially the day after Earth Day!", "Actually looked like a doctor the first time", "I'm a little 🍃 rn and when I saw this I really though \"oooo let's regress a bit\" and genuinely pressed play....", "Can you do a dentist one next, i never really had a super good dentist experience, they were always get the job done, nothing friendly, no explaining what they were doing… it kinda sucked. It’d be greatly appreciated", "Booster Bunny are so sweet", "Hola0", "Congrats to everyone who is early and found this comment 🏆", "Eres maravillosa Gibi 😚💜", "This video is double relaxing! Not only am I getting asmr but it's easing some mom anxiety I have with doctors too 😊", "A bit childish for me, but a very good video for me since I'm from the younger audience", "I would Like to see what the Child's Name is", "As someone who just had their first real-life adult doctors appointment the other day this made me feel like a child again", "I read the title wrong at first. \"Pedestrian\" 😂", "“That’s so healthy of you!”", "i'll", "Wow the hearing test blew my mind it sounds exactly like the ones the doctor use 😱", "I'd love a full video of just the first part of the hearing test, with the headphones. I used to love having that done as a kid!", "I've never had a good relationship with my weight, (eating disorder). So I'm really glad you sped through the weight portion of the check-up. :D", "I have a cold I'm not good!", "Booster Bunnyyyyy 🥺", "my hospital has us see the pediatrician until we are 22! so I’m a whole adult now but I really love going there because it’s so calming and comforting compared to a normal office so I really love and appreciate this video", "You know, as a kid I thought I was the only one that saw that doctor. I thought they had as assigned doctor for each family", "So... Wait we are a normal height? Were not 2 feet tall at what ever age were at and not everything is wrong?", "\"This is booster bunny\" \nMe: mm yeah pretty sure that's trademarked", "I've always loved the hearing test with the beeps I miss it honestly that was my favorite thing and felt so calming when I was a kid thank you for using it as a tingle its my favorite", "Is that a filter or something", "💞", "Cssjknbcdsegb", "I’m a 19 year old man but I’m still going to watch and fall asleep to this.", "Can you do a fastest ASMR speed dating where you’re different candidates? Knowing you, it that would be so funny. 😂😂", "I HAVE BEEN LITERALLY WAITING FOR THIS!!!!", "i had airpods in and when u said knock knock knock it scared the ABSOLUTE SHIT out of me 😭😭", "Gibi: How often do you drink water? \nMe who drinks water every two days", "Shout out to those hair clips. Gorgeous!", "i love watching gibi while i’m drunk, it’s my favorite thing to do before bed after a long night out", "Tf Is Red Rover Cuz Google Wouldn’t Specify N Ah Simple Way", "The rp I didn't know I needed. I love this. I never wanted to grow up as a kid, and damnit I still refuse to. Thank you for this ❤️", "I'd love to believe that these types of videos are really just memories. we're going through all our happy doctor visits trying to piece together where it all went wrong... cuz more recently, *everything* has gone wrong on these visits.", "This was the best shit ever!", "👑👑❤️", "This is fcking awesome 🔥🔥", "Gibi : *Do you participate a lot? in school ? in class?*\nMe: They call me the silent kid , and when someone asks me to do group work I give them a death glare.\nGibi: *That's really good!*\nMe: I know right!", "Okay... Sooo... Pom Pom...\n\nAlso.... Gibi always puts in 100% and I appreciate that.", "OMG I'm obsessed with your hair clips they are soooo cute...I want both your hair and hair clips for myself 😭❤ Envious! Hehe\nCuteness overload! 🌈🐰", "RIP Camera Smudge 🙏🏾\n2022 - 2022", "Your camera looks like it has a smudge", "my favorite food is salsberry steak with mashed potatoes/rice with the gravy,add some string beans on the side,with a nice cool kool-aid blueberry.", "DIO⁉️JOTARO⁉️DIO😫JOTARO😍DIO🤤", "You would be a great doctor and hair stylist tbh. You should do that in your spare time", "Welp watching this video now cuz insomnia is a bitch and a half.", "Omg this is so wierd I just got diagnosed with susac syndrome and could go deaf I'm so sad I might never be able to listen to ASMR ever again :( pray for me", "“That’s really healthy of you”\nLet’s make this a commonly used compliment", "Fortnite", "GIBI: wheatbread\nme:regret\nGIBI: great!! 100%", "There's so much nostalgia from this video! This video was so enjoyable, Gibi! Really loved the lice check and the muscle reflex check, I actually got tingles from them", "I still go to a pediatrician 😐", "After that one in the fastest one, I had a feeling we were gonna get one of these", "Has anyone noticed her foggy screen??", "Love", "I can't wait for the shrek movie amsr video", "My night isn’t complete if I’m not going to watch your uploads!! love youuu gibi ❤️", "i think it would be really nice if there was a pediatrician role play where things go wrong but everything gets fixed and turns out good in the end :) also i didn’t have good experiences with doctors as a child so this video was super soothing!", "Nice video", "I absolutely hate going to the doctors and have ever since I was a kid. This was a very pleasant little video and I appreciate the idea a lot. Thank you, Gibi.", "i didn't know how badly my inner child needed this video. i never enjoyed the doctor when i was younger and have pretty bad anxiety when it comes to medical things but this. this video was so calming in an asmr way but also a healing/comforting way.", "This was my favorite of those fastest ASMR doctors, so this is a dream come true ASMR! I am excited and I just hit play!", "you have NO IDEA how happy those hair clips make me for absolutely no reason", "OMG YES YES YES IVE BEEN WAITING SO LONG FOR THIS FINALLYYYYYY", "The Arizona Robbins vibes are immaculate", "Only difference between you and my actual pediatrician/family doctor is that you aren't British. Fantastic job Gibi.", "\" no strep throat history? \" \nMe: well...", "Oh this reminds me! I haven’t been to a doctor in years!\n\nI should probably get a checkup", "12:15 ish the sound test is just heavenly", "Say no to vaccines", "These child doctors role plays are so cutee  ... Gibi makes them more comfy❣️... ✨ obsessed✨", "You should do a witch doctor one next but everything is still wrong with you XD even with magic", "This is different. The only doctor I had as a child was always super private with the children he worked with and he'd work with only the child (No parent/parental figure in the same room). He was a very strange man... 🤔 did anyone else have some doctor like this as a child?", "Great video! Gibiiiii, could you do a face attention video where you use a long stick to section the face and examine various inconsistencies. You have done a similar video, but if you could incorporate that long pointy ‘stick’ (for lack of a better word) because it gave me su much tingles!!!", "Loved this, best Dr ever🙏❤️🎉✌️", "The urge is getting strong must hold on", "I miss Dr appointments like this. This was so calming; I felt little again😂", "I love the kids videos. The baby photographer was so so great. They're just so cute and caring and innocent. I loved in this one when you were like no, I will not tell you the rules of red Rover. 🤣", "Dr. GiBi:\n“What’s your favorite food?” \nMe:\n“Ice cream!”\nDr. GiBi:\n“Very good!”", "\"let me check your spine see if its growing in straight... okay seems to be fine!\" me with really bad scoliosis 😰", "🥰❤️❤️❤️love❤️❤️❤️❤️❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥💕💞💝", "Uh doc do you know what happened to my friend everything was wrong with them hopefully they gets better :)", "So after the hearing test with the headphones and when you started saying the words I realized I had in my headphones on wrong so I failed💀", "12:35 ！", "Wow the ear test brought back memories lol", "YES!!! i wanted a whole video with just the pediatrician character :D", "Kicked my blanket off during the knee test", "I think I need to go to the eye doctor I couldn’t see like half the board in the back", "i always get anxious at the doctor, but doctor roleplays have helped so much, because the second a doctor starts to soft speak I relax.", "Ever wonder if you missed your calling, Gibi? You would have made an amazing pediatrician. So gentle and sweet.", "It's so much more relaxing when she's not telling you to close your eyes while you're bleeding out at a alarming rate.", "Gibi is the only one saying \"Good\" on my every action 😊🙏", "Today I asked a child how old he was. He just shrugged and said, “I don’t know. I’m either hyper or dead”", "You're Doctor Who?", "I have flashbacks holy crap", "*Wishing everyone the best sleep of their life after having seen this relaxing video!*\n🥰🥰🥰\n*Greetings from ASMR Demon* 😈", "people saying they actually feel younger...look into little space besties, you'll be surprised hehe", "Glad you erased the blurry spot on your camera lense.", "You forgot the part where mom asks how you can improve academically", "What ever happened to the best gal in town, Daisy?", "“you are in a really good percentile for your weight and height”\n\n*me being 50 pounds underweight as well as being a little floor gremlin* :oKaY-", "WE STAN BOOSTER BUNNY", "Lol I love the captions!", "Knock knock knock can I come in ?\n\nNo", "omg no way i have one of the same lemon clips your wearing?!\n:o", "bruh, knowing I requested this on her Fastest Medical ASMR and seeing it now, whether i had an influence on it or not, really makes me so happy, thank you Gibi!! :)", "Dr Gibi: Do you know old you are?\nMe: 28, Dr! Can I get a sticker when we’re done here?", "loved the stethoscope breathing exercise part !! that was always so relaxing to me as a kid<33", "Omg more video like this please, I likeeeee it... love you gibi", "the little in me got so excited when i saw the little bunny in the thumbnail 🥺❤️", "is it just me or is the lens foggy or something? it seems like there is a smudge or something but I can’t tell", ":D", "Gibi casualy showing us bandaids while were bleeding out.", "Can I just point out that she looks kinda like a spring fairy?", "You should make an \"everything goes right\" type of video, where things go so well it's actually really weird", "The only thing I'd seen the pediatrician in was the \"everything is wrong with you\" fastest asmr and I felt so bad and like I was little by little breaking her down so it's nice to see her in a context where I feel like she ISN'T horrified of the various abnormalities that my body is displaying", "i saw the thumbnail and thought you got a haircut haha! great vid as always :)", "This is the only place I will be tall and not skinny.", "Hey Gibi! I love your vids and watch some of them on repeat! I was wondering if you could do another “Everything is wrong with you ASMR”, I would really appreciate it! I always end up getting tingles then falling asleep when I’m tired while watching her vids and I love it!❤️🧡💛💚💙💜💕", "Np sponsored saturday", "GIBI I NEED UR ATTENTION I DONT KNOW IF U HAVE NOTICED BUT I HAVE BEEN ASKING EVERYTIME U MAKE A VIDEO TO MAKE A ADVENTURE STORY POV ASMR BUT TODAY I WILL DECLARE I NO LONGER WANT YOU TO MAKE A ADVENTURE ASMR I WILL CONTINUE ASKING TO KEEP TRACK OF THE DAYS BUT I WILL RESUME SERIOSLY ASKING ONCE YOUR SHREK MOVIE IS DONE", "Black/ white space if you need it <3\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWishing you the best 💖", "She gets serious. Playing doctor¿", "Bonsoir", "*dude gibi is great for stopping with the gfuel sponsorships because she doesn't agree with the gfuel nft*", "We need to start a petition for booster bunny merch.", "Jajajaaj if only my doctors of childhood were like this and not vicious devils with big ass needles😅😅😅😅", "I’ve been waiting for this one since the faster medical asmr video! Glad you decided to do one dedicated to the pediatrics", "Doctor: \"Just going to put this on your tongue and press down. Can you say *aaah* again?\"\nMe: *Aaah* again. 😀 (I know, stupid joke; but I couldn't resist.) EDIT-- It seems like the beep-y hearing test hasn't changed since I was in elementary school.", "always so creative!!!", "13:15 best part of the video imo, need more of this in the future!", "Please do fast check up🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼😁😁😁😁❤️❤️❤️❤️", "There's something dirty on the lense in the intro part that blurs / makes the image unpleasing. Glad it got fixed right after, details make such a difference on the long term", "I usually am not a RP fan but I enjoyed this.", "I hope there’s a Mickey Mouse bandaid on your tri pod now", "Makes me feel like I'ma kid again like giving me an appointment lol thanks for the video..love you Gibi", "Doctors have always scared me because of a surgery I had to get when I was younger, but this is so sweet and nice! The hairclips, the flower pen, everything about it is so calming. If Gibi ever has kids, she's going to be the best mom.", "love this Gibi! thank you", "This video but with Ben", "The closest Gibi will ever get to doing a \"mommy\" role play lol", "One of my favorites from the fastest asmr video", "I am 6 years old again with this video idc ❤️😍", "Last time I saw the big caliper, you were measuring \"me\" for a sculpture bust.\n Pediatrician RP, a hint about a future announcement?", "I was and we were waiting for this video, since the one of \"everything is wrong with you\" the pediatrician was hilarious.", "\"So glad that you came in for your yearly checkup!\"\n... That'd be the first the in the last decade", "Gibi please have a good day. You’re awesome! ♥️ ❤️ 💕 💕", "YAY!!! I LOVE YOU GIBI!! ❤️❤️❤️💙💙", "have a good night i love your videos", "You know someone is a doctor for kids when they say tummy ache instead of stomach ache", "I love these roleplays! So relaxing 😄", "As a person that hoping full version of pediatrician I'm so happy to see this 🤩", "Bunneh!", "Did anybody notice that from last 2 videos Gibi's cute face is looking super glowing... She must use something really hydrating for her skin that provides her the superbly glowing healthy skin😍😍😍", "Why do I feel like I failed the hearing test?", "When you are just trying to sleep and then longs baths attack", "im glad u dont support the Gfuel NFT stuff\n\ngreat video, super cute. thank youu", "Eee I've been waiting for this!!! I was hoping you'd do a full pediatrician vid, I really enjoyed it on the fastest medical ASMRs. Found it so soothing and fun x", "OMG TYSM GIBI! I REALLY LOVE THESE KINDS OF ASMR ROLEPLAYS! :>>>", "YESSS BOOSTER BUNNY SLAAAAAAY", "Lmao even the thought of the needle made me feel nauseous so thankyou for booster bunny..", "I just want to ask how tall are we on the video cuz I'll be fine with something bigger than 4 feet tall", "booster bunny", "Iv already seen one comment say something similar but I love the video and really appreciate your decision about pulling away from the sponsorship with GFUEL because of the NFT stuff, I dont agree with it either as it is crypto and increases carbon emissions and the likes.", "YES!!! I REQUESTED THIS AFTER THE FASTEST DOCTORS ASMR VIDEO!!", "collab with ghettoasmr and bless your life!", "buenisimo video 😍", "hace algo mas con t u vida juga al ajedrez HACE ALGO CON TU VIDA \n\n\n\n\n\n\n\n\nnever gonna give you up never gonna let you down", "Gibi “do you know how old you are?” Me: “24”", "Okay, Gibi, maybe JUST MAYBE , you'll become crazy enough to cut your hair in that way, BCS YOU ARE SO CUTEEE WITH THAT SHORT HAIR ;-^-;", "does anyone have recommendations for any other ASMR videos like this? there's something I love about them treating me like I'm a little kid, it brings me back to when I was younger and life was a lot simpler lol", "SOU DO BRASIL E DORMIR OUVIDO SEU ASMR SEM ENTENDER NADA DE INGLÊS.", "Gibi looks really pretty here - more than usual.", "I turn 20 in about 2 weeks and I still go see my pediatrician. They said I can go until im 22. 😅", "Red rover we used to play that in the UK too", "Nice vid like a lot gibi your the best asmrist in the world love ur asmr vids so much and your lives in twitch", "Please do an arcane cosplay", "the hairclips just make it all so perfect- like the nostalgia omg", "I really needed this today. Thanks gibi <3", "This takes me back to elementary and middle school where mobile clinic trucks would appear and do checks on students.", "I love being treated like a child. This and the Photographer video (POV you're a baby) are just a chef's kiss for me", "I really appreciate and admire Gibi’s authenticity. Pulling her GFUEL sponsorship because she doesn’t agree with GFUEL NFT. You’re awesome, Gibi. Thank you for your continued wonderful videos. A couple of family members, including my Grandmother have passed away in the last few weeks and it’s been a really tough time. ASMR has really helped me to relax and keep calm. Thank you, Gibi.", "who likes your voice holy fuck laziest content let me speak into a microphone shituber im tired of your garbage fucking ads i hate asmr and i hate your voice!!!!!", "I just realized that I've been smiling for the entire video 😃...just a great video in general... so cute. Thank you Gibi 😊 💓", "My inner child feels good with you", "I fell very uncomfortable", "YAASSSSSSS THANK YOU QUEEN I WANTED THIS SO BAD!", "I love Dr. Gibi. She’s super friendly and kind. I recommend her services.", "7:29 CUTE :(( <3", "As a pediatrician,  I must say you have excellent rapport. Keep it up.", "I was revisiting 'before surgery fastest ASMRs' yesterday and I really wanted more of the sweet pediatrician. Thank You 💓", "So much nicer than my actual pediatrician was", "GOOD FOR YOU, nft's blow! :(", "ok but where is the \"help daisy hide the body\" asmr???", "this healed my inner child and genuinely filled me with so much happiness 🥺", "your wierd.....just kidding😂😂😂😂😂😂😂😂😂😂😂😂", "Hello", "I love you so much 😍😘❤️", "This asmr is like.... sending me back in time. It makes me feel like 5 or 6 again. I wish I had gibi as my actual doctor! She is just so calming and whenever I see her I feel at ease :) Thank you for being here gibi we all love and support you❤💖💕", "I love all your videos GiBi thank u i appreciated so much succes too u and your family GiBi", "Can't lie you are captivating.  And I enjoy these before sleeping 😴 💤", "i find it funny that the board with all the symbols on it has the liberian flag", "GAY CLIP 🫡🥹😆", "🇮🇹💚🇮🇹🤍🇮🇹❤️", "I like to imagine there was a mistake and I was sent to a pediatrician as an adult, the doctor is treating me like a child and I'm very confused but oddly conforted.", "Yaaaay!!! A Gibi video", "Uhm I think that this is one relaxing video of simulation and im a teenager and my little sister see this with me and she loved it and me too and it relax my sister because she is nervous about doctors and all of that things.. Hope you have a good day!", "17 years old watching this what have I come too", "*7 year-old me crying because I wanted a Shrek band aid*", "\"Do you drink water?\"\nMe : Yeah !!! *continues to chug gallon of Mnt Dew*\n10000/10 !!! 👏👏👏", "*not trying to be rude BTW* HER: you drink water. ME: no. HER: how much water. ME: I SAID NO ARE YOU DORA!", "Gibi you read my mind", "Ty", "This really makes me feel comfortable and safe.", "This might be too wholesome for me. But at least the clips look like the doctor stole them from a child. Hint of a dark backstory? :D", "0:01 \nNo", "Nothing better to end drinking night than gibiiii", "Gibi: do you know how old you are? \nMe: mhm I'm 26 😎 can I get a sticker?", "Hi", "The last time i went to my pediatrician they said i had scoliosis and recommended me to a spine specialist\nthe specialist said i had to have surgery\nGlad that didn't happen in this video", "the hairclips are so cute😍😍", "throughout this video I really thought this was Gibis actual job she's so good at it!!! I didn't realise I got tingles from being treated like a child again🤣🤣 thank you Gibi!!!!!", "booster bunny always makes things better", "Even the purple background is relaxing.", "Day 186 of asking for a JOJO rp", "Love this video!! Also read the descriptor about the sponsor and I love how transparent you are when things change and why you do what you do ❤️❤️ We love you Gibi!!", "You are like perfect at these role plays when we’re supposed to be kids. It’s probably so bizarre to say but these videos are my fave. So gentle and soothing. Amazing. Thank you for always doing such incredible videos Gibi!!", "Thank you Gibi for a very relaxing video! I still remember when I needed lazy eye surgery when I was a teenager I went to a doctor/Surgeon who did my surgery then after was my doctor for years. I liked her because she was nice she drove a cool Corvette and was a Yankees fan like me. I was told before I was 18 that I was too old to see a pediatrician I cried and sobbed so much I still get teary eyed thinking of having to say goodbye to her. I'm 40 going on 41 on June 5 I can still hear her voice in my head! 😢", "I was so relaxed watching this that I passed out.", "Thank you so much for this video Gibi! It gives me the attention and affection that I did not receive as a child. You are a healer. 💜", "Is it weird that I'm especially fond of the videos where I am technically supposed to be a child ? 😅 They always make me feel so safe and calm and relaxed", "YYEEEEEEEEEESSSS YEEEEEEEESSSSSSS GIBI YEEEEEEEEEEEEEEEEEESSSSS", "Gibi is based for not supporting NFTs i like that.", "Spider cameo xD", "Could you do one exam video were you're just disappointed in us. Like we're not really following instructions correctly?", "As a man, remembering my days with my pediatrician makes me sick. I just HATE him. \n\nStupid American medical standards. 🤮", "You so suit this role Gibi! and YES loving the Hair clips! x", "Been waiting for this one, ever since \"Fastest ASMR\". So happy right now", "I love booster bunny", "Pediatrician is my dream job and I already have the necessary subjects for this career and I'm giving my first actual exams (IGCSE, A-levels.....these type of exams) in a year but it needs a LOT of studying and I often lose motivation and give up\nBut through this video you reminded me why I really wanted to follow this career in the 1st place, thank you Gibi\nYou are an angel❤❤❤❤", "Thank you! This was my fave part in the fast ASMR!!", "sua voz me deixa tao relaxada, melhor asmr \ncadê os brasileiros??", "I love your smile Gibi❤️ Don't ever let go of it", "Those hair clips are so pretty and fun! 💙💕💙", "Omg this is my dream job since i was 5 and ive been working so hard to complete my goals so this is so amazing for me and made my day", "This is so cute!! I loved this! Also, does anyone think Gibi looks a little bit like Dr Manning from Chicago Med? Because I think she could really pull off a roleplay of her! Amazing as always, Gibi 🥰", "as soon as i saw booster bunny in the thumbnail i had to watch this😂", "I have a peadatrican for ADHD had him since 4 years old I'm nearly 16 now", "Your really good at pretending to be a doctor tbh :)", "ASMR GOALSSS🤤💤", "This really brings me back… except I was the kid who would ball her eyes out until she got the shot and realized it didn’t hurt…", "The hearing test was my favorite part !!\nPlease gibi make more videos with that muffled format"]