["mark plays a horror game\nyotube: HM YeS tHiS Is fNaF", "Ah yes, FNAF", "9:06 me when i stub my toe on my table", "“8E2A14”", "upside down face is amongus", "Refusing to help isn't a crime lol", "Why is it that everyone I watch play these kinds of games always go “hurhur yeah I trust the option that clearly is meant to be a threat” first lol", "Can I get a Marki hug?", "I’m not gone lie markiplier was pissing me off trusting everything", "9:18\n   \"E\"", "7:19 theres split second frames of an old painting i think it might be one of saturn (the god)", "9:37 add E T", "The first guy that showed up was a stock photo my class used for a creative writing project. We all named him Craig! Also based on his description, you should probably avoid him since he's killed 72 people according to my class lol", "è una minaccia amico mio", "I really love mark as a person from my parasocial point of view.", "Any time I see the photos all I can think is \n\nCRIMINAL\nCRIMINAL\nCRIMINAL", "This is my first markiplier video in years to see if hes changed for the better and god, still failing to play games just for content. Anoying as hell", "every very good boy feels much anger for kind very funny children", "“Every good boy feels much anger for kind very funny children”\n*yes*", "one of the threats looks like a friend that ghosted me after over a decade of friendship so i have to agree Big Threat", "refusing to cooperate is not a crime. That was fucking dumb of the officer.", "What if u get them all wrong?", "Take a look at my video👀, you might find what you're looking for🎉", "markiplier : *play scary game \nyoutube : i'm gonna put FNAF in this", "I think more pieces of the puzzle will be revealed on April 23rd, because there was an update march 8th and if you played before that update it would say a letter would come on march 8th.", "8E2A14", "Every \nvery \ngood \nboy \nfeels \nmuch \nanger \nfor \nkind \nvery \nfunny \nchildren", "I would press trust for the photos that look unusual, but press threat for the normal ones. I wonder if that would do anything", "11:13 uhhhh-", "When an alternate is downstairs but then I remember my dog’s still downstairs:\n\n“GTFO MY HOUSE BITCH”", "Who else was frustrated that he was only pressing ‘trust’", "8E2A14", "EAT OF 87???", "Markiplier: *Does a trust threat game* What he presses on 90% of the time: *trust*", "я не знаю англиский", "4:57 in my opinion, this gotta be the most trustworthy guy in the survey. I would trust him with my life.", "I stg if anything happens on April 23rd at 10:04 am 💀", "9:03 exe files be like:", "Mark: man I’m tired of gaming 😴 ima go to space", "Mark sounds like kermit the frog from the Muppets show 5:27", "I played this and I got a different ending.", "every very good boy feels much anger for kind very funny children", "Hi i just started watching,my friend showed me ur channel!!!!", "Bro it says it’s fnaf on the bit that should say what the game is", "every very good boy feels much anger for kind very funny children", "8E2A14 ⁸è²á¹⁴ [8[E[2[A[1[4)", "Why do I feel like he’s played this game before-", "That thumbnail scared the hell out of me", "Normal people: let's write this down\nMark: EVERY VERY GOOD BOY-", "Even though you own a computer, you can still write things on a piece of paper if you want.", "8e2a14", "IS IT ME OR WAS MARKS FACE MOVING WEIRD AT THE VERY BEGINNING??????", "that upsidedown face kinda looks like an AMOGUS", "8:16 OH HELL NO IM OUT *DRIVES AWAY*", "Noice", "Every\nVery\nGood\nBoy\nFeels\nMuch\nAnger\nFor\nKind\nVery\nFunny\nChildren", "funny how i watch these videos while playing Animal Crossing😭", "Threat he just Asian 😭", "Havent been watching this channel for awhile and what a mistake that was! Thanks for helping me go through everything", "pls give me a ocules cuest 2", "6:31 That picture...that place...it came in my dream. Lol", "20:22 I think because his right eye is completely black, I think that's supposed to be the give away.", "I think you could hear by the beeps whether your answer was right or not, not sure though. Okay he realized it.", "I mean that question is quite pointless, An all powerful God could easily induce fear whether you want it or not, heck most versions of an all powerful God say you simply die by the mere presence of God in your current state and that the presence of something like an Angel/Demon is survivable but only if it means you no harm or you are protected in some way like for example in most scenarios they are not allowed to directly harm humans.", "Oh I played this game! Instead of the date I got the BE something 14 then I left cause I got freaked out", "\"Are you saying all breakdancers are alternates?\"\nWell, now even I'm questioning that.", "Mark just a thought maybe you should play this on April 23rd at 10:04 am", "For the record, the third ending is getting all the answers wrong. Specifically wrong, with the same determination as getting them all right. The third ending is getting a mix of answers. Mark got 2/3 of the endings: mixed answers, and correct answers. I would love to hear his thoughts on the incorrect answers ending. It could get him thinking and I love hearing his takes", "please play cooking companions", "GRANNNNY, why would you not trust granny!?\n\n\n\n- Markiplier, 2022", "8e2a14", "I love watching these videos just so I can stay up ✨ all night. ✨", "Every very good boy feels anger for kind very funny children", "T R U S T", "you guessed it the description still says fnaf and it will still go", "\"8E2A14\"", "5:52 pause... why the ever living fuck does that look exactly like my mom, minus the semi-distortion?..🤨", "\"Walls have ears, doors have eyes. Beware the rain, Beware the snow, Beware the man you think you know.\"", "Iewaqr", "you should play omori it’s a really good phycological indie horror  game !", "9:36 EEF HAS GONE MISSING", "The way Mark remembers things is analog horror in and of itself. XD", "8E2A14", "8e2a14", "i wonder if “await further instructions” is a reference to the movie await further instructions where the tv at one point just says await further instructions for awhile", "the park thing was full of haikus", "I definitely get the feeling this test was made by alternates as a way to better perfect their human-looking form. So if that's the case, getting all the answers \"wrong\" might actually be right, as opposed to how Mark was trying to play.", "LOCK. YOUR. DOORS. \n\nNEVER open the door for someone who says they’re in danger or anything suspicious! ALWAYS call the police!\n\nIn the 70s my grandmother was at home, along with her housekeeper, getting ready to go work at the small grocery store my grandparents opened. A man dressed in drag showed up and seemed like they were probably just selling something, but despite the wig and dress you could still clearly tell it was a man.\n\nThey knocked on the door a few times and when the housekeeper opened the door to see what they wanted, the man in the dress pulled out a gun while another man with a gun emerged from the car and followed him inside. They held my grandmother and the housekeeper on their knees tied up at gunpoint and demanded to know where the safe was (those days, it was common for small business owners to handle most of their own accounting so they usually had a safe at home with cash from the business.) They told my grandmother that they had all of her children (they were actually safe at school) and they even called them all my name. After they got everything they wanted they told them if they call the police before 30 minutes they would kill her children. \n\nIt turned out they had actually been there weeks before also with the dress and wig, and actually asked my mother who was riding her bike outside, “Hey, REDACTED. Is your daddy home?” He was. So was his gun and military badassery. They left that day.\n\nThe men were eventually caught and sent to prison for this and a sting of similar robberies all up and down the east coast. \n\nLock your doors.", "Dear mark, am I gravely mistaken or are you not far away from a 10 year anniversary of playing horror games on the Tube?", "what a great gameplay from Five Nights at Freddy's :D", "love how youtube thinks this game is fnaf 😭", "Bro Mark you trusting all the Alternates", "I can't believe Mark is playing the newest installment of Five Night's At Freddy's, according to the description", "bucket list:\n1. markiplier notice me\n2. visit him\n3. make a Video together\n4. sleepover\ni know this will Not happen because i have cancer 😕", "why does everyone look like markeeplier\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ndid you click read more?", "the kid took some thalasin dorcelesness huh", "I See every body not to trust", "Have you explored Terminal 00 yet?", "Ummmmmm", "Get the theory phone! SOMEONE CALL MATPAT!!!", "The name of the game says play with me pls", "Hey there is this game called Cooking Companions that GT LIVE played. It gives me DDLC vibes. Check it out after Space with Markiplier dies down", "Markiplier: \"Assessment Examination\"\n\nYouTube: \"Five Nights at Freddy's\"", "Hey just listened to the latest distractible and I love the arg type stuff in the ad breaks! Keep up the amazing podcast!", "at 2:10 i instantly thought of talking Ben.", "Why was he bleeping the name?", "I think it’s common sense but don’t open the door.", "I’m getting massive c.c/crying child/Evan/Chris/Norman vibes from that kid ngl. “I feel his pain.” “Does he fear nightmares?” - mrs or mr afton (possibly). Also, he looked like he had severe head damage. It was bleeding, like c.c’s head. Idk if it is him or not, this is literally just a thought", "at the start if you wait a while it will say when you start the assement \"what are you waiting?\" for then go on as usual idk if there's any secret thing with it but I thought it was wierd", "5:02 Lebron James", "Ahh, can't wait to flood random channels with *\"every very good boy feels much anger for kind very funny children\"*\n\n\n\nIt's \"I'm shittin and cryin rn\" all over again", "A message for Mark 8E2A14", "*every very good boy feels much anger for kind very funny children*", "every very good boy feels much anger for kind very funny children", "8E2A14", "Are you ever going to play \"Oxygen Not Included\" again?", "\"images that don't look normal\"\n mark: \"I can trust that\"", "**Sees a child that looks like it got hit by a grenade shrapnel**\n\nI'll trust you.", "ur voice 😋😋😋", "Oh ok I’m just going to get scared 😦 even more", "Are you scared Iam scared 😦 \n 😦", "I’m scared 😦", "2:56 one fortnite", "Why do I let my 7 year old brother watch this.He won't sleep.", "*8E2814*", "mark, can you play Iron Lung?", "Ok I’m gonna watch this before I watch all of your old scp videos", "Idk if you play games people recommend. But there is a game that I think is pretty good. It’s called oxenfree. The main character is Alex who has something which connects to a cavern in an island. But, I don’t wanna give any spoilers. But! It’s just a recommendation :)", "mark where did your videos go after this and before in space?", "2:54 8 expectations 2 ashes 1 fortnite", "Some of the stuff like \"if you believe in a god pray to them and hope they grant you pity\" are super tryhardy and awkward but otherwise I kinda liked this one.", "Who else saw the picture of the girl smiling and thought of the smiling Titan😂", "if you ever hear someone outside and their bloddy if they seem the slightest bit off dont open it some  murder and kidnapping cases starts with the person tricking you into think their hurt or need help", "The redacted stuff and the *Lock your doors* stuff sounds like SCP", "5:04 is that faceless Chris Pratt", "Mark you should play cooking companions it is a game youd really enjoy. We know you like your horror games and your sim games now combine them!", "8E2A14", "I think you have to fear god because is the one make you not your mom", "Kinda infuriating he kept picking trust for so long", "This game kinda sucks", "Would you fear god? WHO ASKS THAT?", "I'm a very big fan", "sub", "8e2a14 just made me go \"oh color hexcode\". its a rusty reddish brown color", "bro at the end it said youd get the message in april on the first one but when the A.A.D thing glitched out it seemed to be saying that you’d receive it in march", "Try to fill the missing person's info with the info you are given. F E is Francisco Estrada, the guy that went to check on the sketchy kid. Apparently something bad did happen to him because he went missing.\n\nMy guess is that this whole test is his dissapearance. First you get a story of Francisco Estrada calling 911 to a sketchy kid and it ends by him being demandeb by police to help him. Then you get another story of a blank missing person which is obviously F For Francisco and E for Estrada. That part of the story is the beginnning, where he was at work waiting for his shift to end but later on to realize it was all over because as the first story tells it, is has something to do with the sketchy kid who coincidently went missing too.\n\nSeems like its all a puzzle, including the grandma red riding hood story. The pictures of random people arent so random after all.", "Do more damn powerwashing mark.", "you should play elden ring 🙂", "Hey Mark, I heard of this horror game called The Iron Lung, and I think you should play it. Its a game based on going into a Blood ocean covered planet full of fear educing events and creatures. I hope you see this comment, because I'd love to see you play the game!", "Hey Mark you should play a game called iron lung", "Mark you should play uncharted!!", "The \"poem\"  kinda reminds me of Stan - Eminem. Lol", "Mark on vacation or something? 3 weeks and no new video.", "STOP PRESSING TRUST ON ALL OF THEM", "For your next 3 scary games I recommend iron lung very creepy", "I made the huge mistake of watching this late at night home alone.    And I just heard a loud bang outside", "🈴㊙️🉐🈵🈹㊗️🈲 🉑🈷️🈺🈸🈚️🈶 🈳🈂️ 🈯️", "You should play Anemoiapolis", "You look friendly, markiplier.", "Mark says he’ll see us in the next video but someday there won’t be a next video…", "oh wow I love five nights at freddy", "15:11 those are all Haikus.", "I beg of you, play 「Iron Lung」", "stop pressing trust 😭", "ANSWER OPPOSITE.... think as you are the alien", "8E214", "What the f***.noo", "Nooo", "Why😐", "Play iron Lung mark", "Hey Mark please try playing In Sound Mind", "Why does the upside down face look like an among us character?", "Hey Markiplier, can you please play dark deception chapters 1-4 the fixed the statue level!\n\nAlso chapter 5 will be coming soon!", "You have to fear God", "2:04 Oh, it's Davy Jones", "My Theory: This is a “Ever growing family” of Alternates! They use this to see who you would trust and who you wouldn’t as to better hone their techniques against you, and then when the letter arrives early, they exploit your prayers to start giving you “Signs” to open the door.", "i really want mark to play iron lung", "“Do you fear god?”\n\nMark: *thinking* Nooooo..???\nMark’s mind: Shut up you’re god, the god of FNAF.", "No one tell him that Granny 3 has been out for almost a year now 😂😂", "Mark is a great actor!", "Could you maybe play \"peek at phone\" if you haven't played it?", "“Eight, expectations, two apples, one, fortnite”\n\n-Markiplier 2022", "Kinda wish he played a little serious but eh", "u should play Omori mr. mark", "do you still have life dept", "I suggest you try iron lung", "3:20 what did australians do to you?", "Every very good boy, feels much anger, for kind very funny children.\n\n-Mark 2022.", "You should try and play Dome Romantik.", "when are you going to play Dont touch anything 3d again?", "markiplier play this new game sifu", "8e2a14 mark ur brain need remember dat", "My mind is playing some 4d chess on me. it really feels like it wasn't that long ago since mark cut his hair after having it grow long, almost touching his shoulder, and now we're already midway there again...", "Iron Lung", "8E2A14 ez", "Hey Mark if you need to remember something in a game maybe you should write it down on a piece of paper", "Try going for all the wrong answers", "LMAO my exact response👍 3:47", "“For a real life scenario”….me:huh, okay….wait- REAL LIFE SCENARIO???", "Every very good boy feels much anger for kind very funny children. \nI did too at that age, ofcourse.", "It made me so much more scared when mark trusted the last kid but it was wrong. Because that means the alternates have started to shift into normal bodies, so now you can’t tell if they’re “normal” or not.", "AE2A14", "i farted", "Big lol moment", "Every very good boy feels much anger for kind very funny children", "I love watching Mark play creepy and horror related games! He should really play Martha is Dead", "MARK! @/returntominecraft", "MARK! @/returntominecraft", "F E is Francisco Estrada, 19, the second victim from the first cinematic. Seems like the kid is the second missing person's poster. F.E. had been working at the gas station and filed his three week notice shortly before seeing the kid who somehow had something to do with his death. That phone call where he says he's going to smoke and drink some is just before he sees the kid, because in the call transcript between him and the Officer he says he's just been drinking a little bit.", "EVGBEMAEKVFC", "\"yes, this is fnaf\"\n-youtube", "8E2A14", "8e2a14", "Can you play costume quest? Though it’s on Xbox so I’m not sure if you can play.", "Hey Mark, I found this game that was pretty good, I'm not sure how you never found it. It's called 3AM at the Krusty Krab.", "The fact this game uses jumpscares makes it a lot less impressive", "The Mandela catalog really went into depth I actually have a whole board of going into depth I love analog horror(I have been forgetting to sub to you let me do that💀)", "8:33 thats just a birth defect", "PLEASE PLAY DETRIOT BECOME HUMAN", "Could you play Cosmonious High? It is made by the same people who made Job simulator!", "Just woke up, its 6AM on the dot, and it's the perfect time to watch this", "Good thing I watched this in the morning.", "Oml I played this on my other channel! It was so cool, kinda weird tho,", "Connection terminated I'm sorry to interrupt you Elizabeth if you still even remember that name but I'm afraid you've been misinformed you are not here to receive a gift nor have you been called here by the individual you assume although you have... read more", "The way he hit “trust” on every single one made me feel anger, but when he trusted the kid with the messed up face, I wanted to scream.", "Fun fact, refusing to help someone is not a crime.", "Hey Mark, could you reply Hi to me plz?", "me who has my birthday on april 23 oh shitttttttt", "PLAY WE HAPPY FEW", "PLEASE MARK FINISH PLAYING WE HAPPY FEW", "Mark, you can't say that word! It's a racial slur!", "I worked at a gas station (not a small one, big chain kind) for 10yrs (yea I know right) with only a few years of it being night shift. I hated it in a lot of ways (which is why I finally quit) but in a lot of other ways it was easy (that's partly why I stayed). I had a lot of strange incidents with people in that time including but not limited to: drunks, angry drunks, a drunk girl who had her tires slashed and purse stolen from the club who had to call her folks to come get her, an elderly woman with blood on her clothes who acted way too calm (she was ok, domestic partner was not), an ex-military woman who (literally) ran away from someone's house because he had serial killer vibes (never heard more about that one) and another young girl who was beat up from domestic abuse who refused both police and medical help (it was sad). And those are just the ones I can think of. In my opinion all gas stations should be closed after dark (just leave the pumps running for gas). It's too dangerous man.", "Hey mark, can you check out the new hello neighbor 2 beta. It's really fun!\nIt's a huge improvement on the original game and it's only a beta!!\nIt also brings back the same level of tension from the early alphas!", "Markiplier can you play Sally face please!!", "Hey mark, you should play Virago >:)", "every good boy feels angry for killing very funny children?", "Trust all of the people that shouldn’t be trusted and don’t trust people who should be trusted don’t believe god or care for loved ones and have experience in the job as well", "*\u0014", "Hey mark, Power-wash simulator has more levels and things needed cleaning on steam", "I recommend playing phasmophobia again (it has had a update and you havent done a video on it for ages(if you want of cource))", "I don't know why i keep watching these videos because the uncanny valley is one of my biggest fears, but there's something about it that I keep coming back to, no matter how terrified I might be", "*t r u s t*", "pls do part 2 Please,dont touch anything!", "8E2A14", "Please play sister location vr", "I’m ur biggest fan hello", "when do you play warframe ?", "Mark! This is me speaking for most people! Everyone wants you to go back and finish OneShot! You never got the true ending and it has been 4 years! We need to get Mark back to Niko and get him to get the Solstice ending! Everyone comment on Mark’s new videos so that he may see and hopefully go back to finish the game that many people love!", "The police officer's behavior was definitely offputting. I've seen claims that they were an alternate simply because of that, but it is also worth noting that the police department is deliberately told to ignore calls about alternate encounters and to encourage the caller that help is on the way until they inevitably stop responding. The police choose not to engage because any possible contact with an alternate will just cause more death.", "I’ll put it on my fridge too", "omg this SPOOKED MY PANTS!!!!", "hi market pliers", "Honestly I don't even know anymore if Mark knows that pen and paper exists", "@12:15... As I'm sure y'know it's not ok.... Friggin not ok mark..... You of all people should know that mark .,,. ...", "everyverygoodboyfeelsmuchangerforkindaveryfunnychildren", "Hey Mark are you going to play little nightmares 2?", "\"Every very good boy feels much anger for kind very funny children\" is great and all but I'm upset he didn't use \"every very good boy feels much anger for killing very funny children\" instead I think it's better", "Did you know you have a bobble head in subnautica…", "I saw the cover of the video today once and this became the last thing I saw in my dream and jumpscare that I only had I finished my dream with a jumpscare", "8E2814", "I think you’re the first dude to ever notice the beep", "Are you okay?", "cool game but the lines was making me naucious", "i saw the fear of being canceled after the black woman image came on", "Halo Mark.. \nCan you play game with Chocotaco\nPls.... :(", "The picture at the end the one red color is 8E2A14", "casually enjoying some analogue horror. Game states the letter will arrive on the 23rd of April. April 23rd is my birthday.......", "if you want to see all of those photos go at second \n7,", "You should try Apsulov: end of gods. Good sci fi horror mixed with ancient norse. I feel it doesn’t get as much attention as it should.", "14:13 Among us", "In in space with markiplier", "Your actor game is unmatched", "I litterally just played this game in class today, WOW what a coincidence", "Mark you still haven't come back to us and the tower to collect the other endings.", "Unusually long limbsssssss", "I want to see your reaction in \"One Night At Shrek's Hotel!\"", "Mark you didn’t try getting them all wrong.", "At 12:24 you can see 5 censored faces and a rectangle in the middle. This rectangle has the color of the hexadecimal 8e2a14 (with the vhs filter applied). I have no idea what this means, just thought I'd point it out.", "Two games I pray you play is Yuppie Psycho and Horror Tales: The Wine. Both are pretty quick games. Yuppie Psycho gave me crazy Undertale feels. Horror Tales: The Wine had some of the craziest jump scares for me. I usually find jump scares cheap but everyone of them got me in this game. They are also making another Horror Tales this year!", "mantap bang semoga selalu sehat gw suka liat konten elu seru - seru semua", "Found your twin on YouTube ~ Indy Suzuki", "Never been more scared of a park in my life.", "Hey mark, remember \"sign of silence\"? yeah, they unleashed a new huge update that made it scarier! Along the lines of what happend to that area and lore. \r\nSo i was wondering if you, jack, bob, and wade could play it again?", "Can u pls Match again with pewdiepie and Jack pls", "3:08 i would just SC the number and look at it later or just took a photo on my phone", "Every Very Good Boy Feels Much Anger For Kind Very Funny Children.\n\nSo deep", "Can play Pix2pix", "you should playthrough the half-life games. Would be pretty cool", "Mark is gonna have trouble in the Mandela Universe when he trusts everyone too much.", "*hey kids cry because I have better vids than Markiplier and his mom is burning in hell* 🤣🤣🔥", "3:54 \"how could you not trust grandma!\"\nme when choosing wake up the crew in space with markiplier every single time and getting cookies", "That thumbnail tho", "There is a nice game you should play it’s called “Cooking Companions” it would be nice to see you play it!", "Hey Markiplier! \r\nYou should try to play the game Corpse Party (2021)! It's available on steam and I really hope that you would play it one day! It would bring a great series for you to start with us and maybe bring a horrific and magnificent let's play in your channel!", "Mark you should play cooking companion next, I heard it’s like Doki Doki Literature Club", "mark wtf pick threat", "Ok, looked up diazepam, it’s a sedative, but when mixed with alchohol, could lead to death.", "Hey Mark I know you probably won't read this my life has sucked lately I probably go to kill myself I just wanted to know I love you  sooo much and thx for a good childhood and thx again", "I'm curious. What if he does get a letter on April 23? Be careful mark and thank you for being my comfort person and you are always making me smile and laugh", "I tried to go to your most recent video but they disappeared, anyway, you should try out the new game Cooking Companion, I’m not going to spoil anything", "Be my doctor", "8:31 Oh, you don't know what Karlson is?", "Hello Markplier!\nCan you play  the coffee shop game?\nIts called \"*The closing shift*\"", "bro i was just about to download this game", "Hello Markiplier I'm the real grim reaper you have joined my every growing list of favorite YouTubers oh by the way you have a very manly voice", "*Every very good boy feels much anger for kind very funny children*", "5:52 Did anyone notice how that girl looks exactly like Harmony Ashcroft from the Unsolved Case Files series??", "Have you seen this man?", "Mark, you should definitely react to the smile tapes!", "I'm gonna issue if u pick, \"I heard of this in a dream\" and then get all of them wrong, that might do a different ending", "Dear god, the sound design for these games is getting nuts. That phone pickup sound made me feel like something moved under my desk. Real Simulacra vibes.", "If you haven't seen it you should check out the game Needy Streamer Overload", "21:55\nits it just me or is that sussy", "the fact that my name and surname is the samefront letters of somone missing is cool but my bday is on 23 of april is that a coincidence sorry my english not good im afrikaans", "Literally Nobody:\n\nNot even a single soul:\n\nYouTube: this is F N A F", "I do love me some FNAF content", "Every Very Good Boy Feels Much Anger For Kind Very Funny Children \nlmao", "\"Never trust anybody\"\nMark : ah they seem fine", "Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children Every Very Good Boy Feel Much Anger For Kind Very Funny Children", "4:53\nWhat\nThat's just my friend \nIt looks exactly like them\nWhat", "Mark, after about 4 years. One night at flumptys 3 has been made, I’d have a feeling that your viewers would love it if you went and checked it out", "Check it out!", "It's very scary!", "Play from the darkness!", "awesome video mars kepler", "Watching this at 10 pm isn’t the best idea cause of my nightmare problem when I watch scary things b4 bed ngl 😻", "All the uploads in between now and in space with markiplier were just randomly deleted. That sucks, because they were enjoyable", "ochocientos ochenta y ocho", "Don't fucking censor your swearing Mark, here's a dislike.", "I just found out, in a video from like 3 years ago, that you are apparently knowledgeable in 40k lore.", "Am I the only person who this is the first youtube video that pops up on his uploads after In Space With Markiplier? Loved the project, adored the \"easter eggs\", always enjoy mark making fun of himself as a goof and gaff, but now I want to play FNAF 5 revisted and can't find it??? Is this a glitch on my youtube and google? So confused", "IN SPCE WOTH MARK IS SOO GOOD! good job 👍🏼", "Everyone who came from Mark's Spaceship?", "EVERY VERY GOOD BOY FEELS MUCH ANGER FOR KIND VERY FUNNY CHILDREN", "The second ending was talking in 5 7 5 a haiku", "21:0[ look closely,those are the same people", "did mark delete the videos where he revisited fnaf?", "You will recieve a letter on mamammamamanmamamammia WAHOO", "This game is actually really useful since it teaches you to not trust anyone , even if they look like they might need help.", "I think you need to pick the opposite than what you did at the end there.  I think the sound of approval is actually the sound of being wrong.", "8E2A14", "Hey!! What are you doing here??? the Premiere of In Space with Markiplier is about to start!!! go go go !! OY you're still here??? you have 10 minutes get to it!!", "Every good boy feels much anger for kind very funny children", "He hasn‘t been posting for 2 Weeks I’m worried", "I'm so excited about in space with Markiplier", "4:47 MY DUMBASS FLINCHED SO BADLY", "Day 4 of asking Markiplier to play changed special edition", "This might be the worst timing mark but I don't know how to reach you to talk to you about distractible I use to be a discord member, yet I passionately would love to open debate about the 7 sentence. Mark and Bob vs Justin and wade. It's a great philosophy topic.", "This was nice to watch.^_^", "Mark: *Plays anything horror*\nYoutube: \"IT HAS TO BE FIVE NIGHT'S AT FREDDYS\"", "Req game: last of us part 2❤", "who know the real end of this game? I really want to know", "I don’t really watch you anymore, but I wanted to thank you for making my childhood more fun and memorable", "spongebob", "8 Expectations 2 Apples 1 Fortnite, got it.", "ratio", "Help! Any captain here? I'm really interested in Mark's camera lenses - are they prime/fixed(no zoom inside) lenses 35 mm - 50mm? or zoom ones 35mm - 50mm? Thank you in advance!", "Markplier you have to play choo choo Charles when it comes out it looks like a great horror game", "N\nI\nC\n.\n.\n.\n.\n.\n.\n.\n.\nE", "3:00 y didn't he just write it down?", "Every Very Good Boy Feels Much Anger For Kind Very Funny Children", "About the dispatcher and the night shift worker, if you look at the other Mandela Catalogue videos, there's a running theme, or at least some scenes where if someone calls to report alternate things, the dispatcher is just supposed to do nothing and distract them till the alternate get to em. I don't remember which video exactly, but it's one of them.\n\nThere is no safety. The law enforcement is trained to let the callers die. The Mandela Catalogue universe is brutal", "When is the edge of sleep coming out as a show it’s been sometime since you talked about it....", "NEIN FOXI NEIN NEIN NEIN NEIN neiN NEIN NEI N NEIN NEIN", "🧍‍♂", "just watch😭", "diggah das Spiel ist ENglisch", "OH MEIN SATAN ALTER", "NEIN\nICH MACH DICH LEISE", "AHHHHHHHHHHHHHHHHHHHHHHHHHHHHH", "WEN WILLST DU HIEr FIGGEN?", "einfach apored", "willst du mich verarschen", "willst du mir angst machen?", "ich bin nicht infulencer-", ": D", "Der ist nice", "he trusts everyone lol, so wholesome", "The fact that you play the game with no seriousness annoys me", "\"Every very good boy feels much anger for kind very funny children\"\nI'm gonna end up remembering this for the entire day...", "8E2A14", "You are a threat!😅", "8:43 \" ok..well dis little shit \"", "Man the longer Mark talks the more he demonstrates how full of himself he is. Idk I still like his videos but it's getting kinda hard to ignore his ever expanding ego...", "8E2A14", "8e2a14", "Can you please play Who’s Lila?", "I love how marki solved the game", "“Every Very Good Boy Feels Much Anger For Kind Very Funny Children” 🤣🤣 I laughed too hard!", "If I’m not wrong I think you can refuse to help someone who’s in “need”", "Subtitulos en español pls☹️", "saw the thumbnail, hesitated to pick this one because this shit makes me feel like i'm actually going insane.\n\nhere we go i guess", "you should play the closing shift by chillas art", "8e2a14", "Oh dont censor the swears comeon", "Nothing is worth the risk\nNothing is worth the risk\nNothing is worth the risk\nNothing is worth the risk \nNothing is worth the risk\nNothing is worth the risk", "This is terrifing for one reason \nThat reason being that it feels real engouh to emerse yourself in the world that has been created", "bro , just play the game seriosly ffs", "Hello", "Mark uses FNaF as a game description again XD", "I’m casually watching at вовлекалоШвыдкой3938484848849488лулвшаьпьпльпьпулудалаьлаталатаьаьаеььедпдалыьыь293837374748ыывлвллв", "Day 1 of me asking Markipliar to play Omori 🙂", "👹every very good boy feels much anger for kind very funny children👹", "Couldn’t even finish the video, really wished you answered those questions seriously to see how the game was meant to play out.", "I ain't watching this in full screen.", "wow this is the scariest thing since mandela catalogue", "Anyone remember early 2010s Mark? He had such charm and charisma, now he’s like a moody teenager", "Yeah I think the high tone is you did good", "Does anyone know if Mark edits his Audio with a mixer console or in post production in Premiere?", "2:57 wow", "That face at 8:49 is just straight up marks face.", "Skyrim anniversary", "bru mark is ligit out of his mind the ones the weird body fetures are the bad ones you are so unsatisfying. 👿👿💀💀👿👿🤬🤬🤬😠😠😡😡🤬🤬🤬☠☠💀💀👿👿", "Wait, April 23rd is my birthday...", "A82E14", "8a2a14", "if you dont play crawl space for the quest i will eat all you scooby snacks", "The fact he finds a reason to trust everyone 🤣🤣😭 shit was hilarious", "Hey Mark, do a Trust or Threat with all 898 Pokemons", "5:52 that image activates my fight-flight response for some reason", "Watching this on my 2001 Orion vintage tv", "I don’t understand this type of game", "@matpat", "why did i expect a jumpscare in the outro", "Person- hehehe \nMarkipler- says hehehe aswell", "imagine if mark saw a black guy and instantly press threat", "9:35 whany green!? I knew two guys that were bully's that had whany there first name and green as their last now talk about a coincidence!", "Bro at the numbers 4:52 in the vid thats my sister's face and picture", "Yo mark went for the safe option to trust everyone, he could have been canceld by those people who can't let sh*t go", "Ah yes, Here at F*CK B*TCH C*NT", "Nobody\nMark: see old women \nAlso mark: GRANDMA", "I've never felt more uncomfortable or terrified from a gameplay in my life. Idk what it is about this but it almost makes me dizzy.", "21:55 AMOGUS", "Crying and shaking rn", "Every very good boy feels much anger for kind very funny children", "Mark you should be a voice actor. Just saying", "I bet this test would fit in perfectly if you wanted to get a job at the scp foundation", "\"Do you fear god?\" You would be amazed how often I get asked that. And honestly. No. Less there is some subsection fine print on chapter 8 paragraph 29 in the 2ed contract of being able to be alive that dooms you anyway I have done nothing deserving of any ire from god that I have not all ready paid my due to the people I did harm. And no not the i think i did enough kind the person i was making it up to told me I was forgiven but they will never like me. And that is fair some things I did while young. Well anyway the only way I would be \"afraid\" is if god is a dushbag and if so then even being christen will not save you. That's like being a kid and saying if I be good mom will stop hitting me. \"Wait why do you say that so. Matter of fact.\" My past is long and depressing my friend.\n\nIf I had to take a guess even if you are fully right they don't want anyone with or can make connections. They want someone that will see a member getting stalked and walk away. Someone that can't make problems by falling in love nor care about what some god thinks. Most likely as well it is a trick. The sounds may not be telling you what you got right or wrong. Or it could be you did get them all right. no one knows how smart these alts are. One thing was as well some can have changes so minor it is only in the voice. So what if an alt that looks perfect got this tape? Well no better way to find out it is an alt by them getting every single answer right.", "“there’s a stinky baby over here”", "8E2A14", "bro aint got trust issues", "i feel like im making my nightmares worse but i enjoy your videos", "i love this rise in popularity with anologue horror, i grew up reading things like stephen king and H.P. Lovecraft. this type of horror, along with mandela and gemini; feel like modern adaptions of cosmic horror.", "right back to cursing God... dogshit content.", "when i translated 8E2A14 through base 64 it came out as the letter \"M\"\ni cant find anything on EVGBFMAFKVFC yet, ill keep trying though", "8E2A14 will be my forever password for everything.", "5:06 why he look like young Dwayne Johnson doe", "What is the best most affordable gaming computer laptops included?", "Mark should play Around the Clock at Bikini Bottom. It’s a full-length horror rpg made by the guy who made 3AM at the Krusty Krab and 6AM at the Chum Bucket.", "Day 1 of asking Mark to play Wii Sports", "*literally a faceless dude*\n\n“Never seen anything more trustworthy person in my life!”", ".the.Mandela.catalogue.", "8E2A14", "😂men..", "\"You know, refusal to cooperate is a crime, son.\" Suddenly I've become a criminal🤩", "The upside down face is sus", "I'm learning English with this channel, because besides being fun I love his voice😭", "Ah yes I remember playing this game it wasn’t really that scary though", "every very good boy feels much anger for kind very funny children\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children\r\nevery very good boy feels much anger for kind very funny children", "8E2A14", "Mark you should play closing shift !", "Is this canon with Mandela Catalog or this a fun game?", "If ya take atleast 3-3-4 letters of each word in that same exact order, it manage to say:\n\n\"The Ass Exam\"", "Markiplier: plays any game\nYouTube: Five nights at Freddy's!", "i dont think he realized when he made the right choices it says bing and when he makes the wrong choices it says bong", "! Remember !\nYour safety goes first over other no matter how much you wanna help this person if unsafe do not help", "I LIKE THAT YOU ALSO HAVE GLASSES LIKE ME", "Me: **A student**\n\n**Reads the word \"assessment\"**\n\nMe: **Gets 5 consecutive heart attacks**", "This guy trusts too many", "Remember. If your in this situation, remember what the great almighty Markiplier had said years ago.. No matter what happens.. DONT PANIC.", "Dec 5th, 2033", "man its fckin 2 am I should be asleep right now 😂\n\\", "Dude.. I got so scared for a moment because I am on my phone and then some noise plays from my headphones(on their own, not video or app). To be fair, they look like wired  headphones from the age of time where phones still had those little keyboards. Sounded like some sort of ofbrand windows start up and it scared me so bad..\n\nEdit: old \"KOSS\" headphones if anyone knows em-", "This game was so unsettling that YouTube thought it was FNAF", "dude the sound of the phone picking up somewhere between 9:50 and 10:15 scared the absolute shit out of me, i thought someone was tapping on my window", "It still surprises me that mark hasn’t fallen off like, no bright colors, no fake bouncy energetic personality just a guy enjoying his job", "That poem should be called “my window pain”", "\"Every very good boy feels much anger for kind very funny children\"\n-Markiplier 2022", "Yaay", "You can tell if the answer was right or not based on the sound played after the selection", "Play huggy wuggy chapter 2 plz it has been forever they released it", "At this point, the second someone even says \"Mandela Catalogue\", I get a chill up my spine. This shit is freaky.", "3:51 Gramma been reading so classic Junji Ito, good choice Gramma good choice", "MARK THE IPLIER HAVE YOU HEARD OF HARDSPACE: SHIPBREAKER", "Mark has 1 view :> Mark has 9b views :]", "He did the rock eyebrow at 16:01 🤨", "m", "In 8:11, the phrase \"Ave María Santísima\" is a Hispanic phrase that I hear my family use a lot, it's kind of way to say \"Well, shit.\"", "I feel like the same thing is happening with Mandela catalogue that happened with stuff like siren head, yea the games are cool and whatnot but they’re largely similar in appearance, and all that’s gonna happen is people are gonna copy the formula until it’s run into the ground and it loses its charm", "Hey mark, you should play Gorilla Tag VR and its on steam", "Mark, I want you to know that you are one of the YouTubers that inspire me to reach for my dreams!  I am an aspiring gaming youtuber.  I have sooo far to go until I am the YouTuber that you are, but you inspire me to reach for it!", "\"Are you saying all break dancers are alternates?\"\n\n-Markiplier", "Mark!!!!!! U showing up for us?", "15:15 i just noticed they were all Haikus", "I always hated watching horror movies/ or let’s plays of horror themed games. It want until I started watching Markiplier play them that I felt safe, as if he was filtering it in a really entertaining way. Now, here I am, spending my late night hours watching him play games I would have shit myself even thinking about before. It’s funny how things work ☺️", "JOHN 3:16\nFOR GOD SO LOVE THE WORLD, THAT HE GAVE HIS ONLY BEGOTTEN SON, THAT WHOSOEVER BELIEVETH IN HIM SHALL NOT PERISH, BUT HAVE EVERLASTING LIFE", "This is a request can you play barry has a secret its kinda hard", "Mark when you will finish slendytubbies 3? Its been 5 YEARS and you stil didn,t finish IT my Man", "7:25", "I love your vids", "damn danilens", "you know when the game is so good that YouTube thinks its fnaf", "thx", "Got an Amber Alert around the 4:37 picture pop up and lemme tell yall, that alarm scared the daylights out of me 💀💀", "i enjoy markiplier because hes one of the few that stayed \"good\" through the years, unlike alot of other youtubers who just went for the money making route", "17:27 he sounds like the riddler from the Arkham games", "I'm sure this is funny for some people\n\nBut to be perfectly honest, I'm genuinely irritated Mark isn't taking this game seriously. It ruins the atmosphere to take it like a joke.", "OK SO everyone-\n\nCross your eyes and make ur version blurry look slightly to your left in the begging when it says A A D and you will see A A D D or A A A D", "any time there are mysterious redacted parts of dialogue I just mentally replace it with cuss words so the beginning I was just like \"welcome to fuck fuck shit\"", "Imagine living in a world even more judgmental on what looks and sounds \"normal\" in a human. No one with any physical deformity would be left alive...and anyone with any kind of mental issue or speech impediment wouldn't be trusted be either. Even Mark's double-jointed magic tricks would really scare people and likely put him in danger. 😂😅Regular humans are already threats all on their own anyway.", "This stinky baby over there", "Hello welcome if your scared come join me and my little play date where we enjoy\n-drawing\n-writing\n-Eating\n-holding plushies\n-Having fun\nUnless your not scared BE FREE~ (´ . .̫ . `)", "Horror. King", "1:35 Yes, he has. All those games where he assessed people…\n\nGlory to Arstotzka!!!!", "you know... when you trust every hell spawn down the gullet of hell, You're going places.", "I played it prior to watching cuz i wanted to do that and it's honestly not bad. I rlly liked it but it also felt kinda shut off with the conversations. But i still liked how it ended", "*”Grandma you’re swirl face ain’t right.”*", "That blanket mark wears looks so comfy", "i think there all trustworthy", "Can you play ark again?", "I have to I can not do it hate meh if yea want.\nGame: You have been accepted by **bleep bleep**\nYoutube: YoU aRe DiScRiMiNaTiNg TeRmS aNd PoLiCiEs We WiLl TaKe YoUr ViDeO dOwN.\nMark: ARE YOU **BLEEPING** KIDDING ME! ARGHHHH\n\nI don't why I just this that feels like something youtube would do and I don't think this makes any sense at all but okay Y'all don't have to reply this dumb this if you don't wanna or like well stay safe out there and have a wonderful night!🤗", "t bo", "What’s with half people in the comment section saying “hE pOsTeD tHiS oN mY bIrThDaY!!?” like….he posted a video on my birthday but it ain’t a big deal….he just posted a video which isn’t just dedicated to people’s specific birthday", "12:02 i should be very scary about this date bc is one day off", "Operator: \"Can you open this door?\"\n\nI'm afraid I can't do that. You know the reason just as well as I do.", "He’s playing this game like it’s a fucking stand up comedy. Ruined it for me saying everything looks fine.", "When Mark posted this on my birthday", "just gonna glaze passed the prescription note saying \"Keep out of children in reach\"", "My theories are that the police are either alternatives themselves because this kid was not able to get in the gas station so the \"police\"was there to lure you to get out or its just that they're told not to help anyone with a alternate problem", "Youtube: *five nights at freddysssss- thats where i wanna be, five nights at freddys*", "21:54 amongus", "APRIL 23 IS MY BDAY AHHHH", "8E2A14!!!!!", "Just wanna thank you for being the reason I found my current boyfriend😊. When we met we hit it off cause we both love your videos and watch them together all the time! Keep up the great work Mark👍", "When are you gonna play with Dave and the others again I miss them", "Matpat it's your turn", "This feels like local 58", "grandma smoked gas station weed", "hey korean actresses themselves through our families devices give the real ones to kids around me all the time...so we cant have my family be around me at all..ie rachel, jessica, gina these are all my cousins they all loose all the real ones to kids around me 24/7. so i'm not sure how to go about this they shouldnt be around me...its not me", "8E2A14", "01010111 01101000 01111001 00001010", "Please play the closing shift dude", "\"how could you not trust grandma?\"\n\n*cuts to Granny gameplay*", "I love how instead of doing the sensible thing of idk writing these codes down he makes an incomprehensible acronym", "8e2a14", "I cant sleep tonighttttt", "10:04 am?\n\nThat's oddly specific, sounds like a trap.\n\nTRUST", "all wrong answers?", "\"ah grandmna, there's no mercy for you.\"\n\n- Markiplier 2022", "5:04 I appreciate Mark addressing a problem I have with this analogue horror series in particular even if it's for a goof. A lot of the \"deformaties\" that are \"impossible\" actually are, in cases of accidents and developmental or birth defects, perfectly possible for the human body. This series in particular is really bad for that. Scarring and asymmetry in the face is not something to use to freak people out. Like, at least with the obviously warped grandma that one actually IS physically impossible. But, while rare, not having eyes and having the scarring be in such a severe manner is still very possible. The only thing that pushes it into impossible territory is the mouth solely for needing to eat. But that's not the first thing you see, so that still kind of sucks and is too close to just disabled for my tastes :/", "Imagine actually getting a letter on April 23rd at 10:04", "Every Very Good Boy Feels Much Anger For Kind Very Funny Children", "Markiplier would kill the role of a sarcastic veteran who actually doesn't have the skills but incredible luck and bravery and in the end gets killed not by the horror but by complete accident.", "When you have trust issues so at every face with trust/threat I'd say threat. Minus gma", "Gee, mark sure trust every character in this game 😂❤️", "THE AAD IS NOT TO BE TRUSTED\n8E2A14\n8E2A14\n8E2A14\n8E2A14\n8E2A14\n8E2A14\n8E2A14\nDO NOT TRUST THEM", "8E2A14", "Mark What Distractible episode do you suggest", "4:11 woah no way is that John Brolin?!", "I see Five Night's at Freddy's is dipping into analog horror this time. ( ͡° ͜ʖ ͡°)", "hate to be that guy but it is not illegal to refuse to help someone regardless of condition. The bystander has no obligation, and you cannot be charged for it.", "So glad radiotts was able to get a job as an assessment voice in the aad", "4:10\nJFK", "I almost had chills as my birth was April 23rd, at 10:02 am, but I wasn't sure on the minute so I had to ask my mom what time I was born lol. Idk why is felt spookier with a date so close in an already spooky game.", "ha ha ha......2:57 am....... who needs sleep anyway....time to scare myself", "Hi Mr Mark, I'm a small YouTuber and just recently started, tell me how do I make quick and good videos like you?", "Very cliche", "YouTube: Yeah that's Fnaf", "9:17 E", "it’s so sad watching him try to remember the letters, how is his memory that great, just write it down i wouldn’t consider it cheating lmao", "8E2A14", "Mum", "Who else got mad he didn’t pick threat, I was screaming at the screen no that’s wrong 🤣", "I think he should try getting every question wrong", "Technically, since they censored the people and the place, how do we know that's not the O5 council? (SCP reference)", "These thumbnails keep giving me chills....\nWhy u do dis to me mark?!?", "‌F*** Samsung", "looks like markiplier's gonna die", "12:27", "mark not realizing he got two of the three endings is a mood", "I think you’d enjoy a game called Who’s Lila. It’s an indie horror, around 4-6 hours long, it seems up your alley!", "Protect markiplier with your lives with how trusting he is, he's a national treasure", "No te entiendo ni un huevo pero soy tu fan", "every very good boy feels much anger for kind very funny children.", "mark get the shotgun", "this is super cool omg", "Mark needs to play the quarry when it comes out", "The moment I saw the thumbnail I knew it had something to do with The Mandela Catalogue.", "When mark said “GRANDMAAAAAAA” i felt that 😢", "i think i am having a heart attack or a stroke", "Game: spooky \nMark: every very good boy feels much anger for kind very funny children", "5:53 is the image on an unsolved case files game lmfao", "8E2A14", "I learn so much about Mark everytime he takes tests..\nand in this one I learned that he will literally trust anybody.\nI could probably have his severed foot in my hand, and as long as I'm not a black hole he'd probably trust me.", "9:36 Not Dr. Fire Esq.! How could this happen!?", "These feels like Mark playing smash or pass again 🤣", "Gg", "the gas station dude: dont tell vanessa\nme: BUT VANESSA- hE tOld mE-", "hey mark did you know you can lie??", "3:25"]